Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# create_student_account_explanation
source: You can save your own programs with an account.
ar: يمكنك أن تحفظ برامجك باستخدام حساب.
ca: Pots guardar els teus programes si tens un compte.
de: Mit einem Konto kannst du deine eigenen Programme speichern.
es: Puedes guardar tus propios programas con una cuenta.
fr: Vous pouvez enregistrer vos propres programmes avec un compte.
id: Anda dapat menyimpan program Anda sendiri dengan akun.
kab: Tzemreḍ ad teskelseḍ ahalan-ik s umiḍan.
ko: 계정으로 자신의 프로그램을 저장할 수 있습니다.
nl: Met een account kun je programma's opslaan.
pl: Możesz zapisywać swoje programy.
sr: Можете сачувати своје програме са налогом.
ta: உங்கள் சொந்த நிரல்களை ஒரு கணக்குடன் சேமிக்க முடியும்.
tr: Bir hesap ile kendi programlarınızı kaydedebilirsiniz.
uk: Ви можете зберігати власні програми якщо маєте обліковий запис.
zh_hans: 你可以使用帐户保存自己的程序。

# create_student_accounts
source: Create student accounts for
ar: أنشأ حسابات طلبة لغرض
ca: Crear comptes d'estudiant per
es: Crear cuenta de alumno para
kab: Rnu imiḍanen n yinelmaden i
nl: Maak studentenaccounts aan voor
sr: Креирајте ученичке налоге за
ta: மாணவர் கணக்குகளை உருவாக்கவும்
uk: Створіть облікові записи студентів для
zh_hans: 创建学生帐户

# create_teacher_account
source: Create a teacher account
ar: أنشأ حساب معلم
ca: Crea un compte de professorat
de: Erstelle ein Lehr-Konto
es: Crear cuenta de profesor
fr: Créer un compte enseignant
id: Buat akun guru
kab: Rnu amiḍan n uselmad
ko: 선생님 계정 생성하기
nl: Maak een lerarenaccount
pl: Utwórz konto nauczyciela
sr: Направите налог за наставнике
ta: ஆசிரியர் கணக்கை உருவாக்கவும்
tr: Bir öğretmen hesabı oluşturun
uk: Створіть обліковий запис викладача
zh_hans: 创建一个教师账户

# create_teacher_account_explanation
source: With a teacher account, you can save your programs and see the results of your students.
ar: باستخدام حساب معلم، يمكنك أن تحفظ برامجك ورؤية نتائج طلابك.
ca: Amb un compte de professorat, pots guardar els teus programes i veure els resultats dels teus alumnes.
de: Mit einem Lehr-Konto kannst du deine Programme speichern und die Ergebnisse deiner Schülerinnen und Schüler sehen.
es: Con una cuenta de profesor, puedes guardar tus programas y ver los resultados de tus alumnos.
fr: Avec un compte enseignant, vous pouvez enregistrer vos programmes et voir les résultats de vos élèves.
id: Dengan akun guru, Anda dapat menyimpan program Anda dan melihat hasil siswa Anda.
kab: S umiḍan n uselmad, tzemreḍ ad teskelseḍ ihalan-ik yerna ad twaliḍ igmaḍ n yinelmaden-ik.
ko: 선생님 계정으로 프로그램을 저장하고 학생들의 결과를 볼 수 있습니다.
nl: Met een lerarenaccount kun je leerlingen organiseren in klassen, eigen content in je klassen tonen, en resultaten van leerlingen inzien.
pl: Z kontem nauczyciela możesz zapisywać swoje programy i przeglądać wyniki swoich uczniów.
sr: Са налогом за наставнике, можете сачувати своје програме и видети резултате својих ученика.
ta: ஆசிரியர் கணக்கு மூலம், உங்கள் திட்டங்களைச் சேமித்து, உங்கள் மாணவர்களின் முடிவுகளைப் பார்க்கலாம்.
tr: Bir öğretmen hesabı ile programlarınızı kaydedebilir ve öğrencilerinizin sonuçlarını görebilirsiniz.
uk: За допомогою облікового запису вчителя ви можете зберігати свої програми і бачити результати своїх учнів.
zh_hans: 使用教师帐户，你可以保存自己的程序并查看学生的学习结果。

# create_usernames_and_passwords_desc
source: Enter one username and password per line, separated by a semicolon. Or, if you have the data in a two-column spreadsheet, copy the file content and paste here.
ar: أدخل اسم مستخدم واحد فقط مع كلمة سر لكل سطر، مع التفرقة بينهما بفاصلة منقوطة (؟). أو إن كانت بحوزتك المعلومات في عمودين في جدول بيانات، انسخ محتوى الملف وألصقه هنا.
ca: Introdueix un nom d'usuari i una contrasenya per línia, separats per un punt i coma. O, si tens les dades en una fulla de càlcul de dues columnes, copia el contingut del fitxer i enganxa-ho aquí.
es: Introduce un nombre de usuario y contraseña por línea, separados por un punto y coma. O, si tienes los datos en una hoja de cálculo de dos columnas, copia el contenido del archivo y pégalo aquí.
nl: Voer één gebruikersnaam en wachtwoord per regel in, gescheiden door een puntkomma. Of, als je de gegevens in een spreadsheet met twee kolommen hebt, kopieer dan de bestandsinhoud en plak deze hier.
sr: Унесите једно корисничко име и лозинку по линији, одвојене тачком зарез. Или, ако имате податке у табели са две колоне, копирајте садржај фајла и налепите овде.
ta: அரைக்காற்புள்ளியால் பிரிக்கப்பட்ட ஒரு வரிக்கு ஒரு பயனர்பெயர் மற்றும் கடவுச்சொல்லை உள்ளிடவும். அல்லது, உங்களிடம் இரண்டு நெடுவரிசை விரிதாளில் தரவு இருந்தால், கோப்பு உள்ளடக்கத்தை நகலெடுத்து இங்கே ஒட்டவும்.
uk: Введіть по одному імені користувача та паролю на рядок, розділивши їх крапкою з комою. Або, якщо у вас є дані в електронній таблиці з двома стовпцями, скопіюйте вміст файлу та вставте сюди.
zh_hans: 每行输入一个用户名和密码，以分号分隔。或者，如果您的数据在双列电子表格中，请复制文件内容并粘贴在此处。

# create_usernames_and_passwords_title
source: Usernames and passwords
ar: أسماء المستخدمين وكلمات المرور
ca: Noms d'usuari i contrasenyes
es: Nombres de usuarios y contraseñas
kab: Ismawen n yiseqdacen akked wawalen n uɛeddi
nl: Gebruikersnamen en wachtwoorden
sr: Корисничка имена и лозинке
ta: பயனர்பெயர்கள் மற்றும் கடவுச்சொற்கள்
uk: Імена користувачів і паролі
zh_hans: 用户名和密码

# create_usernames_desc
source: Enter one username per line or paste them from a spreadsheet.
ar: أدخل اسم مستخدم واحد لكل سطر أو ألصقها من جدول بيانات.
ca: Introduïu un nom d'usuari per línia o enganxeu-los des d'un full de càlcul.
es: Introduce un nombre de usuario por línea o pegalos desde una hoja de cálculo.
kab: Sekcem yiwen n yisem n useqdac i yal izirig neɣ nɣel-iten-id seg tferkit n tkatut.
nl: Voer één gebruikersnaam per regel in of plak ze uit een spreadsheet.
sr: Унесите једно корисничко име по линији или их налепите из табеле.
ta: ஒரு வரிக்கு ஒரு பயனர்பெயரை உள்ளிடவும் அல்லது ஒரு விரிதாளில் இருந்து ஒட்டவும்.
uk: Введіть по одному імені користувача на рядок або вставте їх із електронної таблиці.
zh_hans: 每行输入一个用户名或从电子表格中粘贴。

# create_usernames_title
source: Usernames
ar: أسماء مستخدمين
ca: Noms d'usuari
es: Nombres de usuario
kab: Ismawen n yiseqdacen
nl: Gebruikersnamen
sr: Корисничка имена
ta: பயனர்பெயர்கள்
uk: Імена користувачів
zh_hans: 用户名

source: Creator
ar: مبتكر
ca: Creador
de: Ersteller
eo: Kreinto
es: Creador
fr: Créateur
hi: बनाने वाला
id: Pencipta
kab: Asaraw
ko: 크리에이터
nl: Maker
pl: Autor
sr: Креатор
ta: உருவாக்கியவர்
tr: Oluşturucu
uk: Автор
zh_hans: 创建者

source: Current password
ar: كلمة السر الحالية
ca: Contrasenya actual
de: Derzeitiges Passwort
es: Contraseña actual
fr: Mot de passe actuel
id: Kata sandi saat ini
kab: Awal n uɛeddi amiran
ko: 현재비밀번호
nl: Huidig wachtwoord
pl: Obecne hasło
sr: Тренутна лозинка
ta: தற்போதைய கடவுச்சொல்
tr: Geçerli şifre
uk: Поточний пароль
zh_hans: 当前密码

# customization_deleted
source: Customizations successfully deleted.
ar: تم حذف التخصيصات بنجاح.
ca: Personalitzacions esborrades correctament.
de: Anpassungen erfolgreich gelöscht.
es: Personalización eliminada.
fr: Modifications effacées avec succès.
hi: अनुकूलन सफलतापूर्वक हटा दिए गए।
id: Penyesuaian berhasil dihapus.
kab: Isenfal ttwasefḍen akken iwata.
ko: 사용자 지정을 성공적으로 삭제했습니다.
nl: Personalisatie succesvol verwijderd.
pl: Personalizacje zostaly usunięte pomyślnie.
sr: Прилагођавања успешно обрисана.
ta: தனிப்பயனாக்கங்கள் வெற்றிகரமாக நீக்கப்பட்டன.
tr: Özelleştirmeler başarıyla silindi.
uk: Налаштування успішно видалено.
zh_hans: 已成功删除自定义项。

source: Customize
ar: تفصيل
ca: Personalitza
es: Personalizar
kab: Sagen
nl: Aanpassen
pl: Dostosuj
sr: Прилагоди
ta: தனிப்பயனாக்கு
uk: Налаштувати
zh_hans: 定制

source: Customize adventure
ar: تفصيل مغامرة
ca: Personalitza l'aventura
de: Modifiziere Abenteuer
eo: Adapti aventuron
es: Personalizar aventura
fr: Personnaliser l'adventure
hi: adventures अनुकूलित करें
id: Sesuaikan petualangan
kab: Sagen tadyant
ko: 모험 사용자 지정
nl: Avontuur aanpassen
pl: Dostosuj przygodę
sr: Прилагоди авантуру
ta: சாகசத்தைத் தனிப்பயனாக்குங்கள்
tr: Macerayı özelleştirin
uk: Налаштуйте пригоду
zh_hans: 自定义探险活动

source: Customize class
ar: تفصيل الصف
ca: Personalitza la classe
de: Passe eine Klasse an
eo: Adapti klason
es: Personalizar clase
fr: Personnaliser la classe
hi: कक्षा को अनुकूलित करें
id: Sesuaikan kelas
kab: Sagen asmil
ko: 수업 사용자 정의
nl: Klas personaliseren
pl: Dostosuj klasę
sr: Прилагоди разред
ta: வகுப்பைத் தனிப்பயனாக்குங்கள்
tr: Sınıfı özelleştirin
uk: Кастомізація класу
zh_hans: 定制课室

source: Danger zone
ar: منطقة خطر
es: Zona de peligro
ta: இடர் மண்டலம்
uk: НЕБЕЗПЕЧНА ЗОНА

# dash
source: a dash
ar: علامة الشرطة
bg: тире
ca: un guió
cs: pomlčka
de: ein Gedankenstrich
eo: streketo
es: un guión
fr: un trait d'union
fy: in streepke
hi: एक निर्देशक चिन्ह
id: tanda pisah
kab: tizdit
nl: een streepje
pl: myślnik
sr: црта
sw: dashi
ta: ஒரு கோடு
tr: bir çizgi
uk: тире
zh_hans: 横杠

source: Debug
ar: صحح أخطاء برمجية
ca: Debuga
es: Depurar
kab: Tamseɣtayt
sr: Отклањање грешака
ta: பிழைத்திருத்தம்
uk: Налагодження
zh_hans: 调试

# default_401
source: Looks like you aren't authorized...
ar: ليس مصرحاً لك الوصول على ما يبدو...
ca: Sembla no estàs autoritzat...
de: Du bist anscheinend nicht authorisiert...
eo: Ŝajnas, ke vi ne estas rajtigita…
es: Parece que no tienes autorización...
fr: Il semble que vous ne soyez pas autorisé…
hi: ऐसा लगता है कि आप अधिकृत नहीं हैं...
id: Sepertinya Anda tidak berwenang...
kab: Yettban-d ur tesɛiḍ ara tisirag...
nl: Jij mag niet bij deze pagina.
pl: Wygląda na to, że nie masz wystarczających uprawnień...
sr: Изгледа да нисте овлашћени...
ta: உங்களுக்கு ஏற்பு இல்லை என்று தெரிகிறது ...
tr: Görünüşe göre yetkiniz yok...
uk: Схоже, ви не уповноважені...
zh_hans: 看起来您未获得授权...

# default_403
source: Looks like this action is forbidden...
ar: يبدو أن هذا الفعل ممنوع...
ca: Sembla que aquesta acció és prohibida...
es: Parece que esta acción está prohibida...
kab: Waqil tigawt-a tettwagdel...
ko: 당신은 권한이 없는 것 같군요...
pl: Wygląda na to, że ta akcja jest zabroniona...
sr: Изгледа да је ова акција забрањена...
ta: இந்த நடவடிக்கை தடைசெய்யப்பட்டுள்ளது என்று தெரிகிறது ...
uk: Схоже, ця акція заборонена...
zh_hans: 看来这个动作是被禁止的……

# default_404
source: We could not find that page...
ar: لم نستطع إيجاد تلك الصفحة...
ca: No hem pogut trobar aquesta pàgina...
de: Diese Seite konnten wir nicht finden…
eo: La paĝo ne troviĝis…
es: No pudimos encontrar esa página...
fr: Nous n’avons pas trouvé cette page…
hi: हमें वह पृष्ठ नहीं मिला...
id: Kami tidak dapat menemukan halaman itu...
kab: Ur nessaweḍ ara ad naf asebter-a...
ko: 그 페이지를 찾을 수가 없었어요...
nl: We konden deze pagina niet vinden.
pl: Nie byliśmy w stanie znaleźć tej strony...
sr: Нисмо могли да пронађемо ту страницу...
ta: அந்த பக்கத்தை எங்களால் கண்டுபிடிக்க முடியவில்லை ...
tr: O sayfayı bulamadık...
uk: Нам не вдалося знайти цю сторінку...
zh_hans: 我们无法找到该页面...

# default_500
source: Something went wrong...
ca: Alguna cosa ha anat malament...
de: Etwas ist schiefgegangen…
es: Algo salió mal...
fr: Quelque chose ne s’est pas bien passé…
id: Ada yang salah...
ko: 뭔가 잘못됐어요...
nl: Oeps! Er ging iets mis...
pl: Coś poszło nie tak...
sr: Нешто је пошло наопако...
ta: ஏதோ தவறு நடந்தது ...
tr: Bir şeyler ters gitti...
uk: Щось пішло не так...
zh_hans: 出问题了...

source: Delete
ar: حذف
bg: Изтрий
ca: Suprimeix
de: Löschen
eo: Forviŝi
es: Borrar
fr: Supprimer
fy: Fuortsmite
hi: हटाएँ
id: Hapus
kab: Kkes
ko: 삭제
nl: Verwijderen
pl: Usuń
sr: Обриши
sw: Futa
ta: நீக்கு
tr: Sil
uk: Видалити
zh_hans: 删除

# delete_adventure_prompt
source: Are you sure you want to remove this adventure?
ar: هل أنت متأكد أنك تريد حذف هذه المغامرة؟
ca: Segur que vols suprimir aquesta aventura?
de: Bist du dir sicher, dass du dieses Abenteuer entfernen möchtest?
eo: Ĉu vi certas, ke vi volas forviŝi ĉi tiun aventuron?
es: ¿Estás seguro/a de querer eliminar esta aventura?
fr: Es-tu sur de vouloir supprimer cette aventure ?
hi: क्या आप वाकई इस adventure को हटाना चाहते हैं?
id: Apakah Anda yakin ingin menghapus petualangan ini?
kab: D tidet tebɣiḍ ad tekkseḍ tadyant-a?
ko: 이 모험을 삭제하시겠습니까?
nl: Weet je zeker dat je dit avontuur wilt verwijderen?
pl: Czy jesteś pewien, że chcesz usunąć tę przygodę?
sr: Да ли сте сигурни да желите да уклоните ову авантуру?
ta: இந்த சாகசத்தை அகற்ற விரும்புகிறீர்களா?
tr: Bu macerayı kaldırmak istediğinizden emin misiniz?
uk: Ви впевнені, що хочете видалити цю пригоду?
zh_hans: 你确定要删除此冒险吗？

# delete_class_prompt
source: Are you sure you want to delete the class?
ar: هل أنت متأكد أنك تريد حذف هذا الصف؟
ca: Segur que vols suprimir la classe?
de: Soll die Klasse gelöscht werden?
eo: Ĉu vi certe volas forviŝi ĉi tiun klason?
es: ¿Estás seguro/a de que quieres eliminar la clase?
fr: Es-tu sur de vouloir supprimer cette classe ?
fy: Witst seker datst de klas fuortsmite wolst?
hi: क्या आप वाकई कक्षा को हटाना चाहते हैं?
id: Apa kamu yakin mau menghapus kelas?
kab: D tidet tebɣiḍ ad tekkseḍ asmel-a?
ko: 이 수업를 삭제하시겠습니까?
nl: Weet je zeker dat je deze klas wilt verwijderen?
pl: Czy jesteś pewien, że chcesz usunąć tą klasę?
sr: Да ли сте сигурни да желите да обришете одељење?
ta: நீங்கள் நிச்சயமாக வகுப்பை நீக்க விரும்புகிறீர்களா?
tr: Sınıfı silmek istediğinizden emin misiniz?
uk: Ви впевнені, що хочете видалити клас?
zh_hans: 你确定要删除这个教室吗？

# delete_confirm
source: Are you sure you want to delete the program?
ar: هل أنت متأكد من أنك تريد حذف البرنامج؟
ca: Segur que vols suprimir el programa?
de: Bist du sicher, dass du das Programm löschen möchtest?
eo: Ĉu vi certe volas forviŝi la programon?
es: Estás seguro de querer borrar este programa?
fr: Êtes-vous sûr de vouloir supprimer le programme ?
fy: Witst seker datst it programme fuortsmite wolst?
hi: क्या आप वाकई प्रोग्राम को हटाना चाहते हैं?
id: Apakah kamu yakin ingin menghapus program?
kab: D tidet tebɣiḍ ad tekkseḍ ahil?
ko: 프로그램을 삭제하시겠습니까?
nl: Weet je zeker dat je het programma wil verwijderen?
pl: Czy na pewno chcesz usunąć ten program?
sr: Да ли сте сигурни да желите да обришете програм?
sw: Je! Una uhakika unataka kufuta programu?
ta: நிரலை நீக்க விரும்புகிறீர்களா?
tr: Programı silmek istediğinizden emin misiniz?
uk: Ви впевнені, що хочете видалити програму?
zh_hans: 你确定要删除这个程序吗？

# delete_invite
source: Delete invitation
ar: حذف الدعوة
ca: Suprimeix la invitació
de: Einladung löschen
eo: Forviŝi inviton
es: Eliminar invitaciones
fr: Supprimer l'invitation
hi: आमंत्रण हटाएं
id: Hapus undangan
kab: Kkes tinnubga
ko: 초대 삭제
nl: Uitnodiging verwijderen
pl: Usuń zaproszenie
sr: Обриши позив
ta: அழைப்பை நீக்கு
tr: Davetiyeyi sil
uk: Видалити запрошення
zh_hans: 删除邀请

# delete_invite_prompt
source: Are you sure you want to remove this class invitation?
ar: هل أنت متأكد أنك تريد حذف الدعوة الى هذا الصف؟
ca: Segur que vols suprimir aquesta invitació de classe?
de: Sind Sie sicher, dass Sie diese Einladung entfernen wollen?
es: ¿Estás seguro de que quieres eliminar esta invitación de clase?
fr: Es-tu sur de vouloir supprimer cette invitation de classe ?
hi: क्या आप वाकई इस कक्षा आमंत्रण को हटाना चाहते हैं?
id: Apakah Anda yakin ingin menghapus undangan kelas ini?
kab: D tidet tebɣiḍ ad tekkseḍ tinnubga-a n usmil?
ko: 이 수업 초대를 삭제하시겠습니까?
nl: Weet je zeker dat je deze uitnodiging wilt verwijderen?
pl: Czy jesteś pewien że chcesz usunąć to zaproszenia?
sr: Да ли сте сигурни да желите да уклоните овај позив за разред?
ta: இந்த வகுப்பு அழைப்பை அகற்ற விரும்புகிறீர்களா?
tr: Bu sınıf davetini kaldırmak istediğinizden emin misiniz?
uk: Ви впевнені, що хочете видалити це запрошення на заняття?
zh_hans: 你确定要删除此课程邀请吗？

# delete_public
source: Delete public profile
ar: حذف الملف العام
ca: Suprimeix el perfil públic
de: Öffentliches Profil löschen
eo: Forviŝi publikan profilon
es: Eliminar perfil público
fr: Supprimer le profil public
hi: सार्वजनिक प्रोफ़ाइल हटाएं
id: Hapus profil publik
kab: Kkes amaɣnu azayaz
ko: 공개 프로필 삭제
nl: Openbaar profiel verwijderen
pl: Usuń profil publiczny
sr: Обриши јавни профил
ta: பொது சுயவிவரத்தை நீக்கு
tr: Herkese açık profili sil
uk: Видалити публічний профіль
zh_hans: 删除公开的个人资料

# delete_success
source: Program deleted successfully.
ar: تم حذف البرنامج بنجاح.
ca: Programa suprimit amb èxit.
de: Programm erfolgreich gelöscht.
es: Programa eliminado correctamente.
fr: Programme effacé avec succès.
hi: प्रोग्राम सफलतापूर्वक हटाया गया
id: Program berhasil dihapus.
kab: Ahil yettwasfeḍ akken iwata.
ko: 프로그램이 삭제되었습니다.
nl: Je programma is verwijderd.
pl: Program został usunięty pomyślnie.
sr: Програм успешно обрисан.
ta: நிரல் வெற்றிகரமாக நீக்கப்பட்டது.
tr: Program başarıyla silindi.
uk: Програму успішно видалено.
zh_hans: 已成功删除程序。

# delete_tag_prompt
source: Are you sure you want to delete this tag?
ar: هل أنت متأكد أنك تريد حذف هذه العلامة؟
ca: Segur que vols esborrar aquest tag?
es: ¿Estás seguro de que deseas eliminar esta etiqueta?
kab: D tidet tebɣiḍ ad tekkseḍ tabzimt-a?
pl: Czy na pewno chcesz usunąć ten znacznik?
sr: Да ли сте сигурни да желите да обришете ову ознаку?
ta: இந்த குறிச்சொல்லை நீக்க விரும்புகிறீர்களா?
uk: Ви впевнені, що бажаєте видалити цей тег?
zh_hans: 您确定要删除该标签吗？

# destroy_account
source: Delete account
ar: احذف الحساب
bg: Изтриване на акаунта
ca: Suprimeix el perfil
cs: Trvale odstranit účet
eo: Forviŝi profilon
es: Borrar mi cuenta permanentemente
fy: Dyn akkount fuortsmite
hi: खाता स्थायी रूप से हटाएं
kab: Kkes amaɣnu
nl: Account verwijderen
pl: Usuń profil
sr: Обриши профил
sw: Futa akaunti kabisa
ta: கணக்கை நீக்கு
tr: Profili sil
uk: Видалити профіль
zh_hans: 删除个人资料

# destroy_account_message
source: Deleting your account cannot be undone. This will remove your account and all associated data, such as your public profile, programs, adventures, and classes. Please make sure you want to proceed, as this action is irreversible.
ar: لا يمكنك الرجوع إلى حسابك بعد حذفه. هذا الحذف سيزيل حسابك وكل المعلومات المتعلقة، مثل حسابة الُمهيأ للعامة، برامجك، مغامراتك، وصفوفك. رجاء تيقن أنك تريد الإكمال، لأن هذا الفعل لا يمكن الرجوع عنه.
es: No se puede deshacer el borrado de la cuenta. Esto eliminará tu cuenta y todos los datos asociados, tales como tu perfil público, programas, aventuras y clases. Por favor, asegúrate de que deseas continuar, esta acción es irreversible.
nl: Als je je account verwijdert, kun je het niet meer terugdraaien. Alles wat erbij hoort, zoals je profiel, programma’s, avonturen en klassen, worden ook gewist. Weet je zeker dat je dit wilt? Zodra je het doet, is er geen weg terug.
ta: உங்கள் கணக்கை நீக்குவது செயல்தவிர்க்க முடியாது. இது உங்கள் கணக்கு மற்றும் உங்கள் பொது சுயவிவரம், நிரல்கள், சாகசங்கள் மற்றும் வகுப்புகள் போன்ற அனைத்து தொடர்புடைய தரவையும் அகற்றும். தயவுசெய்து நீங்கள் தொடர விரும்புகிறீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள், ஏனெனில் இந்த நடவடிக்கை மீளமுடியாதது.
uk: Видалення акаунта не можна скасувати. Це призведе до видалення вашого облікового запису та всіх пов'язаних з ним даних, таких як ваш публічний профіль, програми, пригоди та заняття. Будь ласка, переконайтеся, що ви хочете продовжити, оскільки ця дія є незворотною.

# developers_mode
source: Programmer's mode
ca: Mode programador
de: Programmiermodus
fr: Mode développeur
id: Mode pemrogram
ko: 프로그래머 모드
nl: Programmeursmodus
pl: Tryb programisty
sr: Програмерски режим
tr: Programcı kipi
uk: Режим програміста
zh_hans: 程序员模式

# directly_available
source: Directly open
ar: افتتح مباشرة
ca: Obrir directament
de: Direkt öffnen
eo: Rekte malfermi
es: Directamente abierto
fr: Ouvrir immédiatement
id: Terbuka langsung
kab: Ldi imir
ko: 직접 열림
nl: Gelijk open
pl: Otwórz bezpośrednio
sr: Директно отвори
ta: நேரடியாக திறந்திருக்கும்
tr: Doğrudan açın
uk: Безпосередньо відкрити
zh_hans: 直接打开

source: Disable
ar: وقِّفِ العمل
ca: Desactiva
de: Deaktivieren
es: Deshabilitado
fr: Désactiver
id: Nonaktif
kab: Sens
ko: 사용 안 함
nl: Deactiveren
pl: Wyłącz
sr: Онемогући
ta: முடக்கு
tr: Devre dışı bırak
uk: Вимкнути
zh_hans: 禁用

# disable_parsons
source: Disable all puzzles
ca: Desactiva tots els puzles
de: Alle Puzzles deaktivieren
nl: Alle puzzels uitschakelen
pl: Wyłącz wszystkie łamigłówki
sr: Онемогући све загонетке
uk: Відключити всі головоломки
zh_hans: 禁用所有拼图

# disable_quizes
source: Disable all quizes
ca: Desactiva tots els qüestionaris
de: Alle Quizze deaktivieren
nl: Alle quizzen uitschakelen
pl: Wyłącz wszystkie quizy
sr: Онемогући све квизове
uk: Вимкнути всі тести
zh_hans: 禁用所有测验

source: Disabled
ar: مُوَّقَف عن العمل
ca: Desactivat
de: Deaktiviert
es: Deshabilitado
fr: Désactivé
id: Dinonaktifkan
kab: Yensa
ko: 비활성화됨
nl: Gedeactiveerd
pl: Wyłączono
sr: Онемогућено
ta: முடக்கப்பட்டது
tr: Devre dışı
uk: Вимкнено
zh_hans: 禁用的

# disabled_button_quiz
source: Your quiz score is below the threshold, try again!
ca: La vostra puntuació és inferior al llindar de desbloqueig, torna-ho a provar!
de: Deine Quiz-Punktezahl ist unter dem Grenzwert, versuche es nochmal!
fr: Ton score au questionnaire n'est pas suffisant, essaie encore !
id: Skor kuis Anda di bawah ambang batas, coba lagi!
ko: 퀴즈 점수가 임계값 미만입니다. 다시 시도하십시오!
nl: Je quizscore is niet voldoende, probeer het opnieuw!
pl: Twój wynik quizu jest poniżej oczekiwanego poziomu. Spróbuj ponownie!
sr: Ваш резултат квиза је испод прага, покушајте поново!
tr: Sınav puanınız barajın altında, tekrar deneyin!
uk: Ваш результат тесту нижчий за прохідногу балу, спробуйте ще раз!
zh_hans: 你的测验分数低于阈值，请再试一次！

source: Discord server
ar: موزع دسكورد
ca: Servidor Discord
es: Servidor Discord
fr: Serveur Discord
id: Server perselisihan
kab: Aqeddac Discord
ko: 디스코드 서버
pl: Serwer Discord
sr: Discord сервер
ta: முரண்பாடு சேவையகம்
tr: Discord sunucusu
uk: Сервер Discord
zh_hans: 不和谐服务器

source: Distinguished user
ar: مستخدم مميز
ca: Usuari distingit
de: Ausgezeichneter Nutzer
es: Usuario distinguido
fr: Utilisateur distingué
id: Pengguna yang terhormat
kab: Aseqdac ufrin
ko: 구분사용자
nl: Uitmuntende gebruiker
pl: Wyróżniony użytkownik
sr: Истакнути корисник
ta: புகழ்பெற்ற பயனர்
tr: Seçkin kullanıcı
uk: Шановний користувач
zh_hans: 尊敬的用户

source: double quotes
ar: علامة اقتباس مزدوجة
bg: кавички
ca: cometes dobles
cs: dvojité uvozovky
de: ein doppeltes Anführungszeichen
eo: duobla citilo
es: una comilla doble
fr: guillemet
fy: twa hege komma's
hi: उद्धरण चिन्ह
id: kutip dua
kab: tuccar
ko: 큰따옴표
nl: twee hoge komma's
pl: cudzysłów
sr: наводници
sw: nukuu mbili
ta: இரட்டை மேற்கோள்கள்
tr: çift tırnak
uk: подвійні лапки
zh_hans: 双引号

source: Download
ar: نزِّل
ca: Descàrrega
es: Descargar
fr: Télécharger
id: Unduh
kab: Sader
ko: 다운로드
nl: Downloaden
pl: Pobierz
sr: Преузми
ta: பதிவிறக்கம்
tr: İndir
uk: Завантажити
zh_hans: 下载

source: Duplicate
ar: انسخ
ca: Duplica
de: Duplizieren
es: Duplicar
fr: Dupliquer
id: Duplikat
kab: Sleg
ko: 중복
nl: Dupliceren
pl: Duplikuj
sr: Дуплирај
ta: நகல்
tr: Yinele
uk: Дублювання
zh_hans: 重复

# echo_and_ask_mismatch_exception
source: Echo and ask mismatch
ar: تناقض بين الأمرين اسأل وردد
ca: Desajust entre echo i ask
de: Echo und ask Nichtübereinstimmung
es: Desajuste entre eco y pregunta
fr: {echo} et `{ask}` ne correspondent pas
id: Echo dan tanyakan ketidakcocokan
kab: Acho akked ssuter ur mṣadan ara
ko: 에코 및 질문 불일치
nl: Echo en vraag kloppen niet met elkaar
pl: Niedopasowanie echo i ask
sr: Неслагање између еха и питања
ta: எதிரொலி மற்றும் பொருந்தாத தன்மையைக் கேளுங்கள்
tr: yankıla ve sor uyuşmazlığı
uk: Невідповідність луни та запиту
zh_hans: 回声和询问不匹配
