Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# Access Before Assign
source: We detected that a variable `{name}` is being used on line {access_line_number} before being set. Can you set the variable before it is used?
ar: لقد حاولت استخدام المتغير '{name}' في السطر {access_line_number} قبل تعريفه. هل بإمكانك تعريف المتغير قبل استخدامه؟
ca: Hem detectat que la variable `{name}`s'està fent servir a la línia {access_line_number} abans ser definida. Pots definir-la abans d'usar-la?
da: Vi fandt, at en variabel `{name} ` anvendes på linje {access_line_number}, før den er indstillet. Kan du indstille variablen, før den bruges?
de: Wir haben bemerkt, dass die Variable {name} in Zeile {access_line_number} benutzt wird, bevor sie gesetzt ist. Kannst du die Variable setzen, bevor sie benutzt wird?
es: Hemos detectado que la variable `{name}` está siendo usada en la línea {access_line_number} antes de ser inicializada. ¿Puedes darle un valor a la variable antes de usarla?
fr: Tu as essayé d'utiliser la variable {name} à la ligne {access_line_number}, mais tu ne l'as défini qu'à la ligne {definition_line_number}. Défini ta variable avant de l'utiliser.
id: Project-Id-Version: PACKAGE VERSION Report-Msgid-Bugs-To: POT-Creation-Date: 2000-01-01 00:00+0000 PO-Revision-Date: 2000-01-01 00:00+0000 Last-Translator: Someone <someone@example.com> Language: id Language-Team: id <LL@li.org> Plural-Forms: nplurals=1; plural=0; MIME-Version: 1.0 Content-Type: text/plain; charset=utf-8 Content-Transfer-Encoding: 8bit Generated-By: Babel 2.11.0
ko: {access_line_number} 라인에서 {name} 변수를 사용하려고 했지만 {definition_line_number} 라인에서 설정했습니다. 변수를 사용하기 전에 변수를 설정하십시오.
nl: De variabele `{name}` gebruikt wordt op regel {access_line_number}, maar is daar nog niet ingesteld. Kun je de variabele instellen voor die gebruikt wordt?
pl: Wykryliśmy, że zmienna {name} jest używana w wierszu {access_line_number} przed jej ustawieniem. Czy możesz ustawić zmienną przed jej użyciem?
sr: Открили смо да се променљива `{name}` користи на линији {access_line_number} пре него што је постављена. Можете ли поставити променљиву пре него што се користи?
ta: அமைக்கப்படுவதற்கு முன் {access_line_number} வரியில் `{name}` பயன்படுத்தப்படுவதை நாங்கள் கண்டறிந்தோம். மாறியைப் பயன்படுத்துவதற்கு முன்பு அதை அமைக்க முடியுமா?
tr: `{access_line_number}` numaralı satırdaki "`{name}`" değişkeninin, değeri ayarlanmadan kullanıldığını tespit ettik. Değişkeni kullanmadan önce değerini ayarlayabilir misiniz?
uk: Ми виявили, що змінна `{name}` використовується в рядку {access_line_number} до встановлення. Чи можете ви встановити змінну перед її використанням?
vi: Chúng tôi phát hiện biến `{name}` được sử dụng trên dòng {access_line_number} trước khi được gán giá trị. Bạn có thể gán giá trị cho biến trước khi sử dụng không?
zh_hans: 我们检测到变量“{name}”在设置之前已在第 {access_line_number} 行被使用。您能在使用该变量之前设置它吗？

# Cyclic Var Definition
source: We detected that a variable `{variable}` is being used on the right-hand side of the `{is}` command before being set. Can you set the variable before it is used?
ar: يجب أن تضبط قيمة المتغير `{variable}` قبل أن تستعمله على الجانب الأيسر من من الأمر البرمجي '{is}'. هل بإمكانك تعريف المتغير قبل استخدامه؟
bg: Променливата `{variable}` е използвана от дясната страна на командата `{is}` преди да й е зададена стойност. Можеш ли да дадеш стойност на променливата преди да я използваш?
ca: Hem detectat que la `{variable}` s'està fent servir a la dreta de la comanda `{is}` abans de definir-se. Pots definir la variable abans de fer-la servir?
da: Vi fandt, at en variabel {variable} anvendes på den højre side af {is} kommandoen, før den er indstillet. Kan du indstille variablen, før den bruges?
de: Wir haben bemerkt, dass die Variable `{variable}` auf der rechten Seite des `{is}`Befehls verwendet wird, bevor sie gesetzt ist. Kannst du die Variable setzen, bevor sie benutzt wird?
es: Hemos detectado que la variable `{variable}` está siendo usada en el lado derecho del comando `{is}` antes de ser inicializada. ¿Puedes darle un valor antes de usarla?
fr: Le nom `{variable}` doit être défini avant que tu puisses l’utiliser à droite de la commande `is`.
id: Nama `{variable}` perlu disetel sebelum Anda dapat menggunakannya di sisi kanan perintah `{is}`.
ko: {is} 명령의 오른쪽에서 이름 {variable}을(를) 설정해야 사용할 수 있습니다.
nl: De variabele `{variable}` wordt gebruikt aan de rechterkant van de `{is}`-commando voor deze is ingesteld. Kun je de variabele instellen die het gebruikt wordt?
pl: Wykryliśmy, że zmienna {variable} jest używana po prawej stronie polecenia {is} przed jej ustawieniem. Czy możesz ustawić zmienną przed jej użyciem?
sr: Открили смо да се променљива `{variable}` користи на десној страни команде `{is}` пре него што је постављена. Можете ли поставити променљиву пре него што се користи?
ta: `{variable}` என்பது `{is}` கட்டளையின் வலது புறத்தில் பயன்படுத்தப்படுவதை நாங்கள் கண்டறிந்தோம். மாறியைப் பயன்படுத்துவதற்கு முன்பு அதை அமைக்க முடியுமா?
tr: "`{variable}`" değişkeninin değeri ayarlanmadan önce "`{is}`" komutunun sağ tarafında kullanıldığını tespit ettik. Değişkeni kullanmadan önce değerini ayarlayabilir misiniz?
uk: Ми виявили, що змінна `{variable}` використовується в правій частині команди `{is}` перед встановленням. Чи можете ви встановити змінну перед її використанням?
zh_hans: 我们检测到变量“{variable}”在“{is}”命令的右侧被使用，但尚未设置。您可以在使用之前设置该变量吗?

# Else Without If Error
source: We detected that there is an `{else}` being used before an `{if}` on line {line_number}. Can you try writing an `{if}` before the `{else}`?
ar: لقد اكتشفنا أن '{else}' استخدمت قبل '{if}' في السطر {line_number}. هل بإمكانك كتابة '{if}' قبل '{else}'؟
bg: Командата `{else}` е използвана преди командата `{if}` на ред {line_number}. Можеш ли да сложиш `{if}` преди `{else}`?
ca: Hem detectat que hi ha un `{else}` en ús abans d'un `{if}` a la línia {line_number}. Pots provar d'escriure `{if}` abans de `{else}`?
da: Vi fandt, at der er en `{else}` bruges før en `{if}` på linje {line_number}. Kan du prøve at skrive en `{if} ` før `{else}'?
de: Wir haben festgestellt, dass in Zeile {line_number} ein `{else}` vor einem `{if}`benutzt wird. Kannst du probieren, ein `{if}` vor dem `{else}` zu schreiben?
es: Detectamos que hay un `{else}`se utiliza antes de un `{if}`en línea {line_number}. ¿Puede intentar escribir un `{if}`antes del `{else}`?
pl: Wykryliśmy, że przed {if} w wierszu {line_number} jest używany {else}. Czy możesz spróbować napisać {if} przed {else}?
sr: Открили смо да се `{else}` користи пре `{if}` на линији {line_number}. Можете ли покушати да напишете `{if}` пре `{else}`?
ta: {line_number} என்ற வரியில் `{else}` என்பது `{if}`க்கு முன்னால் பயன்படுத்தப்படுவதை நாங்கள் கண்டறிந்தோம். `{else}` க்கு முன் `{if}` எழுத முயற்சிக்கலாமா?
tr: `{line_number}` numaralı satırda "`{if}`" kullanmadan bir "`{else}`" kullanıldığını tespit ettik. "`{else}`" kullanmadan önce bir "`{if}`" yazmayı deneyebilir misiniz?
uk: Ми виявили, що перед {if} у рядку {line_number} використовується «{else}». Чи можете ви спробувати написати `{if}` перед `{else}`?
vi: Chúng tôi phát hiện được lệnh `{else}` được sử dụng trước khi có lệnh `{if}` trên dòng {line_number}. Bạn có thể thử viết lệnh `{if}` trước lệnh `{else}` không?
zh_hans: 我们检测到在第 {line_number} 行的 `{if}` 之前使用了 `{else}`。你应该尝试在 `{else}` 之前写入 `{if}` ？

# Function Undefined
source: We detected that a function {name} is being used without being defined. Can you define the function before it is used?
ar: لقد اكتشفنا أن الدالة {name} تُستخدم قبل أن تُعرَّف. هل بإمكانك تعريف الدالة قبل استخدامها؟
bg: Функция с име {name} е използвана преди да е дефинирана. Можеш ли да я дефинираш преди да я използваш?
ca: Hem detectat que la funció {name} s'està fent servir abans de definir-se. Pots definir-la abans d'usar-la?
da: Vi fandt, at en funktion {name} bruges uden at være defineret. Kan du definere funktionen, før den bruges?
de: Wir haben bemerkt, dass die Funktion {name} benutzt wird, obwohl sie nicht definiert nicht. Kannst du die Funktionen definieren, bevor du sie verwendest?
es: Detectamos que una función {name} está siendo utilizada sin ser definida. ¿Puede definir la función antes de que sea usada?
pl: Wykryliśmy, że funkcja {name} jest używana bez definiowania. Czy możesz zdefiniować funkcję przed jej użyciem?
sr: Открили смо да се функција {name} користи без дефинисања. Можете ли дефинисати функцију пре него што се користи?
ta: ஒரு செயல்பாடு {name} வரையறுக்கப்படாமல் பயன்படுத்தப்படுவதை நாங்கள் கண்டறிந்தோம். செயல்பாட்டைப் பயன்படுத்துவதற்கு முன்பு அதை வரையறுக்க முடியுமா?
tr: "`{name}`" isimli fonksiyonun tanımlanmadan kullanıldığını tespit ettik. Fonksiyonu kullanmadan önce tanımlayabilir misiniz?
uk: Ми виявили, що функція {name} використовується без визначення. Чи можете ви визначити функцію перед її використанням?
vi: Chúng tôi phát hiện hàm {name} được sử dụng mà chưa được định nghĩa. Bạn có thể định nghĩa hàm trước khi sử dụng nó không?
zh_hans: 我们检测到函数 {name} 未被定义，但已被使用。你应该使用该函数之前定义它？

# Has Blanks
source: We detected that the code seems to be incomplete. Can you fill in the blanks with code?
ar: لقد اكتشفنا أن برنامجك غير مكتمل. هل بإمكانك أن تملأ الفراغات الموجودة؟
ca: Hem detectat que el teu codi pot ser incomplet. Pots assegurar-te que has omplert tots els espais que s'havien d'omplir amb codi?
de: Wir haben bemerkt, dass dein Programm leer ist. Kannst du die Leerzeichen mit Programm füllen?
es: Detectamos que el código parece estar incompleto. ¿Puede rellenar los espacios en blanco con código?
fr: Ton code est incomplet. Il contient des blancs que tu dois remplacer par du code.
id: Kode Anda tidak lengkap. Ini berisi bagian kosong yang harus Anda ganti dengan kode.
ko: 코드가 불완전합니다. 코드로 대체해야하는 빈칸이 들어있습니다.
pl: Wykryliśmy, że kod wydaje się niekompletny. Czy możesz wypełnić puste miejsca kodem?
sr: Открили смо да код изгледа непотпун. Можете ли попунити празнине кодом?
ta: குறியீடு முழுமையடையாது என்று நாங்கள் கண்டறிந்தோம். குறியீட்டைக் கொண்டு வெற்றிடங்களை நிரப்ப முடியுமா?
tr: Bu kodun tamamlanmamış olduğunu tespit ettik. Boşlukları doldurabilir misiniz?
uk: Ми виявили, що код виглядає неповним. Чи можете ви заповнити пропуски кодом?
vi: Chúng tôi phát hiện chương trình của bạn chưa hoàn thiện. Bạn có thể viết thêm vào chỗ trống được không?
zh_hans: 我们发现代码似乎不完整。能能用代码填补空白吗？

# Incomplete
source: We detected that part of the code seems to be missing from the `{incomplete_command}` on line {line_number}. Can you try adding what's missing?
ar: لقد اكتشفنا أن جزءًا من اﻷمر البرمجي يبدو مفقودًا من`{incomplete_command}` على السطر رقم {line_number}. هل يمكنك أن تضيف ما هو مفقود؟
ca: Hem detectat que falta part del codi a la comanda `{incomplete_command}` a la línia {line_number}. Pots provar d'afegir el que falta?
da: Vi fandt, at en del af koden synes at mangle fra `{incomplete_command}` på linje {line_number}. Kan du prøve at tilføje, hvad der mangler?
de: Wir haben festgestellt, dass ein Teil des Codes vom {incomplete_command} Befehl in Zeile {line_number} zu fehlen scheint. Kannst du probieren, den fehlenden Code hinzuzufügen?
es: Detectamos que parte del código parece estar faltando en el `{incomplete_command}` en la línea {line_number}. ¿Puede intentar agregar lo que falta?
fr: Oups ! Tu as oublié un morceau du code ! À la ligne {line_number}, tu dois ajouter du texte après `{incomplete_command}`.
id: Ups! Anda sedikit lupa kodenya! Pada baris {line_number}, Anda perlu memasukkan teks di belakang `{incomplete_command}`.
ko: 이런! 코드를 조금 잊으셨군요! {line_number} 라인에서 {incomplete_command} 뒤에 텍스트를 입력해야 합니다.
sr: Детектовали смо да део кода изгледа да недостаје у `{incomplete_command}` на линији {line_number}. Можете ли да покушате да додате оно што недостаје?
ta: குறியீட்டின் ஒரு பகுதி {line_number} வரியில் `{incomplete_command} இருந்து இலிருந்து காணவில்லை என்று நாங்கள் கண்டறிந்தோம். காணாமல் போனதைச் சேர்க்க முயற்சிக்கலாமா?
tr: `{line_number}` numaralı satırdaki "`{incomplete_command}`" komutunda kodun bir kısmının eksik olduğunu tespit ettik. Eksik olan kısmı eklemeyi deneyebilir misiniz?
uk: Ми виявили, що частина коду, схоже, відсутня в `{incomplete_command}` у рядку {line_number}. Чи можете ви спробувати додати те, чого не вистачає?
vi: Chúng tôi phát hiện chương trình của bạn đang bị thiếu một phần tại`{incomplete_command}` trên dòng {line_number}. Bạn có thể bổ sung phần còn thiếu được không?
zh_hans: 我们发现第 {line_number} 行的 `{incomplete_command}` 部分代码似乎缺失。您可以尝试添加缺失的内容吗？

# Incomplete Repeat
source: We detected that the `{repeat}` on line {line_number} is missing a `{command}` command. Can you try adding it?
ar: لقد اكتشفنا أن الأمر البرمجي '{repeat}' على السطر {line_number} يفتقد إلى الأمر البرمجي '{command}'. هل بإمكانك إضافته؟
ca: Hem detectat que al `{repeat}` de la línia {line_number} li falta una comanda`{command}`. Pots afegir-la?
da: Vi fandt, at kommandoen `{repeat}`på linje {line_number} mangler en `{command}`kommando. Kan du prøve at tilføje det?
de: Wir haben festgestellt, dass dem {repeat} Befehl in Zeile{line_number} ein `{command}` Befehl fehlt. Kannst du probieren, es hinzuzufügen?
es: Detectamos que el `{repeat}` en la línea {line_number} está faltando un `{command}`comando. ¿Puede intentar agregarlo?
fr: Il semble que tu as oublié d'utiliser `{command}` avec la commande repeat qui est à la ligne {line_number}.
id: Sepertinya Anda lupa menggunakan perintah dengan perintah `{repeat}` yang Anda gunakan pada baris {line_number}.
kab: Nufa`{repeat}` ɣef yizirig {line_number} txuṣṣ tladna`{command}`. Tzemreḍ ad tt-ternuḍ?
ko: {line_number} 라인에서 사용한 {repeat} 명령을 사용하지 않은 것 같습니다.
pl: Wykryliśmy, że w wierszu{repeat} w wierszu {line_number} brakuje polecenia {command}. Czy możesz spróbować go dodać?
sr: Открили смо да `{repeat}` на линији {line_number} недостаје команда `{command}`. Можете ли покушати да је додате?
ta: {line_number} வரியில் `{repeat}` ஒரு `{command}` கட்டளையைக் காணவில்லை என்பதைக் கண்டறிந்தோம். இதைச் சேர்க்க முயற்சிக்கலாமா?
tr: `{line_number}` numaralı satırdaki "`{repeat}`" ifadesinin yanında bir "`{command}`" komutunun eksik olduğunu tespit ettik. Eksik komutu eklemeyi deneyebilir misiniz?
uk: Ми виявили, що в `{repeat}` у рядку {line_number} відсутня команда `{command}`. Ви можете спробувати його додати?
zh_hans: 我们检测到第 {line_number} 行的 `{repeat}` 缺少 `{command}` 命令。你可以尝试添加它吗？

# Invalid
source: We detected that `{invalid_command}` is not a Hedy level {level} command. Can you try using `{guessed_command}`?
ar: لقد اكتشفنا أن `{invalid_command}` ليس أمراً برمجياً ضمن المستوى {level} من هيدي. هل كنت تقصد الأمر `{guessed_command}`؟
ca: Hem detectat que la comanda `{invalid_command}` no és vàlid en el nivell {level} d'Hedy. Et serveix la comanda `{guessed_command}`?
da: Vi fandt, at `{invalid_command}` er ikke en Hedy niveau {level} kommando. Kan du prøve at bruge `{guessed_command}`?
de: `{invalid_command}` ist kein Hedy-Level-{level}-Befehl. Kannst du probieren`{guessed_command}` zu benutzen?
es: Detectamos que el comando `{invalid_command}' no es un comando de nivel Hedy {level}. ¿Puede intentar usar el comando `{guessed_command}'?
fr: `{invalid_command}` n’est pas une commande du niveau {level} d’Hedy. Voulais-tu écrire `{guessed_command}` ?
id: `{invalid_command}` bukan perintah {level} level Hedy. Apakah maksud Anda `{guessed_command}`?
ko: {invalid_command}이(가) Hedy 레벨 {level} 명령이 아닙니다. {guessed_command}을(를) 말씀하신 건가요?
pl: Wykryliśmy, że {invalid_command} nie jest poleceniem poziomu Hedy {level}. Czy możesz spróbować użyć `{guessed_command}`?
sr: Открили смо да `{invalid_command}` није Hedy ниво {level} команда. Можете ли покушати да користите `{guessed_command}`?
ta: `{invalid_command}` ஒரு எடி நிலை {level} கட்டளை அல்ல என்பதை நாங்கள் கண்டறிந்தோம். `{guessed_command}` ஐப் பயன்படுத்த முயற்சிக்கலாமா?
tr: "`{invalid_command}`" ifadesinin Hedy seviye {level} komutu olmadığını tespit ettik. "`{guessed_command}`" kullanmayı deneyebilir misiniz?
uk: Ми виявили, що `{invalid_command}` не є командою рівня Hedy {level}. Чи можете ви спробувати використати `{guessed_command}`?
zh_hans: `{invalid_command}` 不是海蒂第{level}关里的命令。你是不是想写 `{guessed_command}`？

# Invalid Argument
source: We detected that `{command}` is not usable with `{invalid_argument}`. Can you try changing `{invalid_argument}` to {allowed_types}?
ar: لا يمكن استعمال الأمر `{command}` مع هذا المدخل: `{invalid_argument}`. هل بإمكانك تغيير `{invalid_argument}` الى {allowed_types}؟
ca: Hem detectat que la comanda `{command}` no es pot fer servir amb `{invalid_argument}`. Pots canviar `{invalid_argument}` a {allowed_types}?
da: Vi fandt, at `{command}` er ikke anvendelig med `{invalid_argument}`. Kan du prøve at ændre `{invalid_argument}` til {allowed_types}?
de: Wir haben festgestellt, dass `{command}` nicht mit dem Argument `{invalid_argument}` benutzt werden kann. Kannst du probieren, `{invalid_argument}` zu einem erlaubten Typ von {allowed_types} zu ändern?
es: Hemos detectado que `{command}` no es utilizable con `{invalid_argument}`. ¿Puede intentar cambiar `{invalid_argument}`a {allowed_types}?
fr: Tu ne peux pas utiliser la commande `{command}` avec `{invalid_argument}`. Essaye de remplacer `{invalid_argument}` par {allowed_types}.
id: Anda tidak dapat menggunakan perintah `{command}` dengan `{invalid_argument}`. Coba ubah `{invalid_argument}` menjadi {allowed_types}.
ko: {invalid_argument} 명령을 {invalid_argument}에 사용할 수 없습니다. {invalid_argument}을(를) {allowed_type}(으)로 변경해 보십시오.
pl: Wykryliśmy, że {command} nie nadaje się do użytku z {invalid_argument}. Czy możesz spróbować zmienić {invalid_argument} na {allowed_types}?
sr: Открили смо да `{command}` није употребљив са `{invalid_argument}`. Можете ли покушати да промените `{invalid_argument}` у {allowed_types}?
ta: `{invalid_argument}` உடன் `{command}` பொருந்தாது என்பதை நாங்கள் கண்டறிந்தோம். `{invalid_argument}`என்பதை {allowed_types} ஆக மாற்ற முயற்சிக்கலாமா?
tr: "`{command}`" komutununun "`{invalid_argument}`" ile kullanılamayacağını tespit ettik. "`{invalid_argument}`" argümanını bir "`{allowed_types}`" olarak değiştirmeyi deneyebilir misiniz?
uk: Ми виявили, що `{command}` не можна використовувати з `{invalid_argument}`. Чи можете ви спробувати змінити `{invalid_argument}` на {allowed_types}?
zh_hans: 我们检测到 `{command}` 不能与`{invalid_argument}`一起使用。你可以尝试将`{invalid_argument}`更改为`{allowed_types}`？

# Invalid Argument Type
source: We detected that `{command}` doesn't work with `{invalid_argument}` because it is {invalid_type}. Can you try changing `{invalid_argument}` to {allowed_types}?
ar: لا يمكن استعمال الأمر `{command}` مع `{invalid_argument}` وذلك بسبب كونها {invalid_type}. هل بإمكانك تغيير `{invalid_argument}` الى {allowed_types}؟
ca: Hem detectat que la comanda `{command}` no funciona amb `{invalid_argument}`, ja que és {invalid_type}. Pots provar de canviar `{invalid_argument}` a {allowed_types}?
da: Vi fandt, at `{command}` ikke virker med `{invalid_argument}` fordi det er {invalid_type}. Kan du prøve at ændre `{invalid_argument}` til {allowed_types}?
de: Wir haben festgestellt, dass `{command}` nicht mit dem Argument `{invalid_argument}` funktioniert, weil es ein {invalid_type} ist. Kannst du probieren`{invalid_argument}` zu einem erlaubten Typ von {allowed_types} zu ändern?
es: Hemos detectado que el `{command}` no funciona con el `{invalid_argument}`, porque es {invalid_type}. ¿Puede intentar cambiar el `{invalid_argument}` a {allowed_types}?
fr: Tu ne peux pas utiliser `{command}` avec `{invalid_argument}` car c’est {invalid_type}. Essaie de modifier `{invalid_argument}` en {allowed_types}.
id: Anda tidak dapat menggunakan `{command}` dengan `{invalid_argument}` karena {invalid_type}. Coba ubah `{invalid_argument}` menjadi {allowed_types}.
ko: {invalid_type}이므로 {command}을(를) {invalid_argument}에 사용할 수 없습니다. {invalid_argument}을(를) {allowed_type}(으)로 변경해 보십시오.
pl: Wykryliśmy, że {command} nie działa z {invalid_argument}, ponieważ jest to {invalid_type}. Czy możesz spróbować zmienić {invalid_argument} na {allowed_types}?
sr: Открили смо да `{command}` не ради са `{invalid_argument}` јер је {invalid_type}. Можете ли покушати да промените `{invalid_argument}` у {allowed_types}?
ta: `{command}` `{invalid_argument} உடன் வேலை செய்யாது என்பதை நாங்கள் கண்டறிந்தோம், ஏனெனில் இது {invalid_type}. `{invalid_argument}` {allowed_types} ஆக மாற்ற முயற்சிக்கலாமா?
tr: "`{command}`" komutunun "`{invalid_argument}`" ile çalışmadığını tespit ettik, çünkü bu argüman bir "`{invalid_type}`". "`{invalid_argument}`" değerini "`{allowed_types}`" türüne değiştirmeyi deneyebilir misiniz?
uk: Ми виявили, що `{command}` не працює з `{invalid_argument}`, оскільки це {invalid_type}. Чи можете ви спробувати змінити `{invalid_argument}` на {allowed_types}?
zh_hans: 我们检测到 `{command}` 无法与 `{invalid_argument}` 配合使用，因为它是 {invalid_type}。你可以尝试将 `{invalid_argument}` 更改为 {allowed_types} ？

# Invalid At Command
source: We detected that `{command}` may not be used from level 16 onward. Can you try using square brackets `[]` for lists?
ar: هذا الأمر البرمجي: '{command}' لا يمكن استخدامه من المستوى 16 فصاعدا. هل بإمكانك استخدام قوسين مربعين '[]' للقوائم؟
ca: Hem detectat que `{command}` no es pot fer servir des del nivell 16 endavant. Pots fer servir claudàtors`[]` a les llistes?
da: Vi fandt, at `{command}` må ikke anvendes fra niveau 16 og videre frem. Kan du prøve at bruge firkantede beslag `[]`for lister?
de: Wir haben festgestellt, dass der `{command}` Befehl ab Level 16 nicht mehr verwendet werden darf. Kannst du probieren, eckige Klammern `[]` für Listen zu verwenden?
es: Hemos detectado que `{command}`no puede ser utilizado a partir del nivel 16. ¿Se puede intentar usar corchetes para listas `[]`?
fr: La commande `{command}` n'est pas utilisable avant le niveau 16. Tu peux utiliser des crochets pour utiliser un élément d'une liste, par exemple `friends[i]`, `lucky_numbers[{random}]`.
id: Perintah `{command}` tidak boleh digunakan mulai level 16 dan seterusnya. Anda dapat menggunakan tanda kurung siku untuk menggunakan elemen dari daftar, misalnya `teman[i]`, `angka_keberuntungan[{random}]`.
ko: 레벨 16부터는 {at} 명령어를 사용할 수 없습니다. 대괄호를 사용하여 friends[i], lucky_numbers[{random}]와 같은 목록의 요소를 사용할 수 있습니다.
pl: Wykryliśmy, że {command} nie może być używane od poziomu 16. Czy możesz spróbować użyć nawiasów kwadratowych `[]` dla list?
sr: Открили смо да `{command}` можда не може да се користи од нивоа 16 па надаље. Можете ли покушати да користите угласте заграде `[]` за листе?
ta: `{command}` நிலை 16 முதல் பயன்படுத்தப்படாது என்பதைக் கண்டறிந்தோம். பட்டியல்களுக்குச் சதுர அடைப்புக்குறிகளைப் `[]` பயன்படுத்த முயற்சிக்கலாமா?
tr: "`{command}`" komutunun seviye 16'dan itibaren kullanılamayabileceğini tespit ettik. Listeler için köşeli parantezler, "`[ ]`", kullanmayı deneyebilir misiniz?
uk: Ми виявили, що `{command}` не можна використовувати з рівня 16 і далі. Чи можете ви спробувати використати квадратні дужки `[]` для списків?
zh_hans: 我们检测到从 16 级开始可能无法使用 `{command}`。你可以尝试使用方括号 `[]` 来列出列表？
