Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# languages
source: Which of these programming languages have you used before?
ar: أي من لغات البرمجة التالية استخدمتها من قبل؟
ca: Quin d'aquests llenguatges de programació has utilitzat abans?
cs: Které z těchto programovacích jazyku jsi už někdy použil*a?
de: Welche dieser Programmiersprachen hast du schonmal verwendet?
eo: Kiujn el ĉi tiuj programlingvoj vi uzis antaŭe?
es: ¿Cuáles de estos lenguajes de programación has utilizado antes?
fr: Lequel de ces langages de programmation avez-vous déjà utilisé ?
fy: Hokker programmeartaal hasto wolris brûkt?
hi: आपने इनमें से किस प्रोग्रामिंग भाषा का पहले उपयोग किया है?
id: Bahasa pemrograman mana yang sudah pernah kamu kuasai sebelumnya?
ko: 이 프로그래밍 언어들 중에 어떤 것을 사용해 본 적이 있습니까?
nl: Welke programmeertaal heb je wel eens gebruikt?
pl: Których języków programowania używałeś wcześniej?
sr: Које програмске језике сте користили раније?
ta: இந்த நிரலாக்க மொழிகளில் எது இதற்கு முன்பு பயன்படுத்தினீர்கள்?
tr: Daha önce bu programlama dillerinden hangilerini kullandınız?
uk: Якою з цих мов програмування ви користувалися раніше?
zh_hans: 您以前使用过以下哪种编程语言？

source: Last edited
ar: تاريخ آخر تعديل
ca: Última edició
de: Zuletzt geändert
es: Última edición
fr: Dernière modification
hi: पिछला संपादित
id: Terakhir diedit
kab: Aẓrag aneggaru
ko: 마지막 편집
nl: Laatst bewerkt
pl: Ostatnio edytowano
sr: Последњи пут уређено
ta: கடைசியாக திருத்தப்பட்டது
tr: Son düzenleme
uk: Останнє редагування
zh_hans: 最后编辑

source: Last update
ar: اخر تحديث
ca: Última actualització
de: Letztes Update
eo: Lasta ĝisdatigo
es: Última actualización
fr: Dernière mise à jour
hi: आखिरी अपडेट
id: Pembaharuan Terakhir
kab: Lqem aneggaru
ko: 마지막 업데이트
nl: Laatste update
pl: Ostatnia aktualizacja
sr: Последње ажурирање
ta: கடைசி புதுப்பிப்பு
tr: Son güncelleme
uk: Останнє оновлення
zh_hans: 上次的更新

source: Last Name
ar: اسم العائلة
ca: Cognoms
cs: Příjmení
de: Nachname
eo: Familia nomo
es: Apellido(s)
fr: Nom
id: Nama Belakang
kab: Isem n twacult
ko: 성
nl: Achternaam
pl: Nazwisko
sr: Презиме
ta: கடைசி பெயர்
tr: Soyadı
uk: Прізвище
zh_hans: 姓

source: Leave class
ar: مغادرة الصف
ca: Surt de la classe
de: Verlasse die Klasse
eo: Forlasi klason
es: Abandonar clase
fr: Quitter la classe
hi: कक्षा छोड़ें
id: Tinggalkan kelas
kab: Eǧǧ asmil
ko: 수업 떠나기
nl: Klas verlaten
pl: Opuść klasę
sr: Напусти одељење
ta: வகுப்பு விடுங்கள்
tr: Sınıftan ayrılın
uk: Залиште урок
zh_hans: 退出班级

source: Level
ar: مستوى
bg: Ниво
ca: Nivell
eo: Nivelo
es: Nivel
fr: Niveau
hi: स्तर
kab: Aswir
ko: 레벨
pl: Poziom
sr: Ниво
sw: Kiwango
ta: நிலை
tr: Seviye
uk: Рівень
zh_hans: 级别

# level_accessible
source: Level is open to students
ar: المستوى مُتاح للطلاب
ca: El nivell està obert als estudiants
de: Level ist offen für Schüler und Schülerinnen
es: Nivel abierto a los alumnos
fr: Niveau est ouvert aux élèves
id: Level terbuka untuk siswa
kab: Aswir yeldi i yinelmaden
ko: 레벨은 학생들에게 열려있다
nl: Dit level is open voor leerlingen
pl: Poziom jest otwarty dla uczniów
sr: Ниво је отворен за ученике
ta: நிலை மாணவர்களுக்கு திறந்திருக்கும்
tr: Seviye öğrencilere açıktır
uk: Рівень відкритий для студентів
zh_hans: 级别对学生开放

source: Level disabled
ar: المستوى غير مُفَعَّل
ca: Nivell desactivat
de: Level deaktiviert
es: Nivel deshabilitado
fr: Niveau désactivé
id: Tingkat dinonaktifkan
kab: Aswir yensa
ko: 레벨 비활성화됨
nl: Level staat nog uit
pl: Poziom wyłączony
sr: Ниво онемогућен
ta: நிலை முடக்கப்பட்டது
tr: Seviye devre dışı
uk: Рівень вимкнено
zh_hans: 级别已禁用

# level_future
source: This level automatically opens on
ar: هذا المستوى يفتتح تلقائيا على
ca: Aquest nivell s'obrirà automàticament el
de: Dieses Level öffnet automatisch am
es: Este nivel se abrirá automáticamente en
fr: Ce niveau sera automatiquement accessible dès le
fy: This level will open automatically after the opening date
id: Level ini otomatis terbuka
ko: 이 레벨은 자동으로 다음에 열립니다
nl: Dit level gaat automatisch open op
pl: Ten poziom otwiera się automatycznie
sr: Овај ниво се аутоматски отвара на
ta: இந்த நிலை தானாகவே திறக்கும்
tr: Bu seviye otomatik olarak açılacak
uk: Цей рівень автоматично відкривається на
zh_hans: 此级别将在开放日期后自动打开

# level_invalid
source: This Hedy level is invalid.
ar: هذا المستوى من هيدي غير صحيح.
ca: Aquest nivell d'Hedy no és vàlid.
es: Este nivel de Heidi no es válido.
kab: Aswir-a n Hedy d arameɣtu.
ko: 이 Hedy 레벨은 유효하지 않습니다.
pl: Ten poziom Hedy jest nieprawidłowy.
sr: Овај Hedy ниво је неважећи.
ta: இந்த எடி நிலை தவறானது.
uk: Цей рівень Hedy недійсний.
zh_hans: 此海蒂级别无效。

# level_not_class
source: This level has not been made available in your class yet
ar: هذا المستوى ليس متاحا لصفك الدراسي بعد
bg: Това ниво не е налично в твоя клас все още
ca: Aquest nivell encara no està disponible a la vostra classe
cs: Jste ve třídě, kde tato úroveň ještě nebyla zpřístupněna
de: Dieses Level ist in deiner Klasse noch nicht verfügbar
eo: Ĉi tiu nivelo ankoraŭ ne estas disponebla por via klaso
es: Este nivel todavía no está disponible en tu clase
fr: Ce niveau n’a pas encore été rendu disponible dans votre classe
id: Level ini belum tersedia di kelas Anda
ko: 이 레벨은 아직 수업에서 사용할 수 없습니다
nl: Je zit in een klas waar dit level nog niet beschikbaar is gemaakt
pl: Ten poziom nie jest jeszcze dostępny w twojej klasie
sr: Овај ниво још није доступан у вашем разреду
ta: இந்த நிலை உங்கள் வகுப்பில் இதுவரை கிடைக்கவில்லை
tr: Bu seviye henüz sınıfınızda kullanıma açılmadı
uk: Цей рівень ще не доступний у вашому класі
zh_hans: 此级别还没有对你的班级开放

# level_title
source: Level
ar: مستوى
bg: Ниво
ca: Nivell
cs: Úroveň
eo: Nivelo
es: Nivel
fr: Niveau
hi: स्तर
kab: Aswir
ko: 레벨
pl: Poziom
sr: Ниво
sw: Kiwango
ta: நிலை
tr: Seviye
uk: Рівень
zh_hans: 级别

source: levels
ar: المستويات
ca: nivells
es: niveles
kab: Iswiren
pl: Poziomy
sr: нивои
ta: நிலைகள்
uk: рівнях
zh_hans: 关卡

source: Link
ar: الرابط
ca: Enllaç
eo: Ligo
es: Enlace
fr: Lien
id: Tautan
kab: Aseɣwen
ko: 링크
sr: Веза
ta: இணைப்பு
tr: Bağlantı
uk: Посилання
zh_hans: 链接

# list
source: a list
ar: قائمة
ca: una llista
de: eine Liste
eo: listo
es: una lista
fr: une liste
hi: एक सूची
id: daftar
kab: tabdart
ko: 목록
nl: een lijstje
pl: lista
sr: листа
ta: ஒரு பட்டியல்
tr: bir liste
uk: список
zh_hans: 列表

# list_variable_role
source: list
ar: قائمة
ca: llista
es: lista
kab: tabdart
pl: lista
sr: листа
ta: பட்டியல்
uk: список
zh_hans: 列表

# logged_in_to_share
source: You must be logged in to save and share a program.
ar: يجب أن تسجل دخول كي تستطيع أن تحفظ وتشارك برنامجك.
ca: Heu d'iniciar sessió per desar i compartir un programa.
de: Du musst eingeloggt sein, um Programme zu speichern und zu teilen.
es: Debe iniciar sesión para guardar y compartir un programa.
fr: Un compte est nécessaire pour sauvegarder et partager un programme.
id: Anda harus masuk untuk menyimpan dan berbagi program.
ko: 프로그램을 저장하고 공유하려면 로그인해야 합니다.
nl: Je moet ingelogd zijn om een programma op te slaan en te delen.
pl: Musisz się zalogować aby zapisać i udostępnić program.
sr: Морате бити пријављени да бисте сачували и делили програм.
ta: ஒரு நிரலைச் சேமிக்கவும் பகிரவும் நீங்கள் உள்நுழைய வேண்டும்.
tr: Bir programı kaydetmek ve paylaşmak için oturum açmış olmanız gerekir.
uk: Ви повинні увійти, щоб зберегти програму та поділитися нею.
zh_hans: 你必须登录才能保存和共享程序。

source: Log in
ar: تسجيل الدخول
bg: Вход
ca: Inicia sessió
cs: Přihlásit se
de: Anmelden
eo: Saluti
es: Ingresar
fr: Se connecter
fy: Log yn
hi: लॉगिन
id: Masuk
kab: Qqen
ko: 로그인
nl: Inloggen
pl: Zaloguj się
sr: Пријави се
ta: புகுபதிகை
tr: Giriş yap
uk: авторизуватися
zh_hans: 登录

# login_long
source: Log in to your account
ar: الدخول الى حسابك
bg: Влез с твоя акаунт
ca: Inicia sessió al teu compte
cs: Přihlásit se ke svému účtu
de: Melde dich mit deinem Konto an
eo: Saluti en vian konton
es: Ingresar a mi cuenta
fr: Connectez-vous à votre compte
fy: Ynlogge
hi: आपके खाते में लॉगिन करें
id: Masuk dengan akun kamu
kab: Qqen ɣer umiḍan-ik·im
ko: 계정에 로그인합니다
nl: Inloggen op jouw account
pl: Zaloguj się do konta
sr: Пријавите се на свој налог
sw: Ingia kwenye akaunti yako
ta: உங்கள் கணக்கில் உள்நுழைக
tr: Hesabınıza giriş yapın
uk: Увійдіть у свій обліковий запис
zh_hans: 登录到您的账户

source: Log in to save your work
ar: سجل دخول كي تحفظ عملك
ca: Inicia sessió per desar la teva feina
de: Log dich ein um zu speichern
es: Inicia sesión para guardar tu progreso
fr: Se connecter pour sauvegarder son travail
id: Masuk untuk menyimpan pekerjaan Anda
kab: Qqen i wakken ad teskelseḍ amahil-ik
ko: 작업을 저장하려면 로그인하십시오
nl: Log in om je werk op te slaan
pl: Zaloguj się, aby zapisać swoją pracę
sr: Пријавите се да бисте сачували свој рад
ta: உங்கள் வேலையைச் சேமிக்க உள்நுழைக
tr: Çalışmanızı kaydetmek için giriş yapın
uk: Увійдіть, щоб зберегти свою роботу
zh_hans: 登录以保存你的工作

source: Log out
ar: تسجيل الخروج
bg: Изход
ca: Surt
cs: Odhlásit se
de: Abmelden
eo: Adiaŭi
es: Salir
fr: Se déconnecter
fy: Log út
hi: लॉग आउट
id: Keluar
kab: Ffeɣ
ko: 로그아웃
nl: Log uit
pl: Wyloguj się
sr: Одјави се
ta: விடுபதிகை
tr: Oturumu kapatın
uk: Вийти
zh_hans: 退出

source: Longest program
ca: Programa més llarg
de: Längstes Programm
fr: Programme le plus long
id: Program terpanjang
ko: 가장 긴 프로그램
nl: Langste programma
pl: Najdłuższy program
sr: Најдужи програм
tr: En uzun program
uk: Найдовша програма
zh_hans: 最长的程序

# mail_change_password_body
source: Your Hedy password has been changed. If you did this, all is good. If you didn't change your password, please contact us immediately by replying to this email.
ar: تم تغيير كلمة مرور هيدي الخاصة بك. إذا كنت أنت من قام/طلب هذا ، فكل شيء على ما يرام. إذا لم تقم بطلب/بفعل تغيير كلمة المرور الخاصة بك ، فيرجى الاتصال بنا على الفور من خلال الرد على هذا البريد الإلكتروني.
ca: La teva contrasenya d'Hedy s'ha canviat. Si ja n'estaves al corrent, tot bé. Si no heu canviat la vostra contrasenya, poseu-vos en contacte amb nosaltres immediatament responent a aquest correu electrònic.
de: Ihr Hedy-Passwort wurde verändert. Wenn Sie das waren, ist alles in Ordnung. Wenn Sie ihr Passwort nicht verändert haben, kontaktieren Sie uns bitte sofort, indem Sie auf diese Mail antworten.
es: Tu contraseña de Hedy ha cambiado. Si lo has hecho tú, no te preocupes. Si no has cambiado tu contraseña, por favor contáctanos inmediatamente contestando a este email.
fr: Votre password Hedy a été modifié. Si cette modification vient de vous, tout va bien. Si vous n'avez pas modifié votre mot de passe, veuillez nous contacter immédiatement en répondant à ce mail.
fy: Feroarje wachtwurd If you didn't change your password, please contact us immediately by replying to this email.
id: Password Hedy kamu sudah berhasil diubah. Jika kamu melakukan ini, tidak ada masalah. Jika kamu tidak melakukan ini, mohon segera kontak kami dengan cara membalas email ini.
ko: Hedy 비밀번호가 변경되었습니다. 만약 의도하셨다면, 모든 것이 잘 된 일입니다. 비밀번호를 변경하지 않으셨다면, 이 이메일에 답장을 보내 즉시 저희에게 연락해주세요.
nl: Jouw Hedy wachtwoord is veranderd. Als jij dit was, helemaal goed! Als jij jouw wachtwoord niet hebt veranderd, neem dan zo snel mogelijk contact met ons op door te reageren op deze mail.
pl: Twoje hasło Hedy zostało zmienione. Jeśli to zrobiłeś, wszystko jest w porządku. Jeśli nie zmieniłeś hasła, natychmiast skontaktuj się z nami, odpowiadając na tę wiadomość e-mail.
sr: Ваша Hedy лозинка је промењена. Ако сте ви то урадили, све је у реду. Ако нисте променили лозинку, молимо вас да нас одмах контактирате одговарајући на овај емаил.
ta: உங்கள் எடி கடவுச்சொல் மாற்றப்பட்டுள்ளது. நீங்கள் இதைச் செய்திருந்தால், எல்லாம் நல்லது. உங்கள் கடவுச்சொல்லை மாற்றவில்லை என்றால், இந்த மின்னஞ்சலுக்கு பதிலளிப்பதன் மூலம் உடனடியாக எங்களை தொடர்பு கொள்ளவும்.
tr: Hedy şifreniz değiştirildi. Eğer bunu siz yaptıysanız, her şey yolunda demektir. Şifrenizi siz değiştirmediyseniz, lütfen bu e-postayı yanıtlayarak hemen bizimle iletişime geçin.
uk: Ваш пароль Hedy було змінено. Якщо ви зробили це, все добре. Якщо ви не змінювали свій пароль, негайно зв’яжіться з нами, відповівши на цей електронний лист.
zh_hans: 您的Hedy密码已被更改。如果是你改的那就没事。 如果你并没有修改密码，请立即回复本邮件与我们联系。

# mail_change_password_subject
source: Your Hedy password has been changed
ar: تم تغيير كلمة مرور هيدي الخاصة بك
ca: La teva contrasenya d'Hedy s'ha canviat
de: Dein Hedy-Passwort wurde geändert
es: Tu contraseña de Hedy ha sido cambiada
fr: Ton mot de passe Hedy a été modifié
id: Password Hedy kamu sudah berhasil diubah
ko: Hedy 비밀번호가 변경되었습니다
nl: Jouw Hedy wachtwoord is veranderd
pl: Twoje hasło Hedy zostało zmienione
sr: Ваша Hedy лозинка је промењена
ta: உங்கள் எடி கடவுச்சொல் மாற்றப்பட்டுள்ளது
tr: Hedy şifreniz değiştirildi
uk: Ваш пароль Hedy було змінено
zh_hans: 您的Hedy密码已被更改

# mail_error_change_processed
source: Something went wrong when sending a validation mail, the changes are still correctly processed.
ar: حصل خلل ما عند إرسال رسالة الكترونية للتأكيد، لكن التغييرات تمت معالجتها بشكل صحيح.
ca: S'ha produït un error en enviar el correu de validació, els canvis encara es processen correctament.
de: Etwas lief schief beim Senden der Validierungs-E-Mail, die Änderungen werden dennoch korrekt verarbeitet.
es: Algo salió mal al enviar un correo de validación, los cambios aún se procesan correctamente.
fr: Les modifications sont prises en compte, mais une erreur a empêché l'envoi d'un mail de validation.
id: Ada yang salah saat mengirim email validasi, perubahan masih diproses dengan benar.
ko: 유효성 확인 메일을 보낼 때 오류가 발생했습니다. 변경 사항은 여전히 올바르게 처리되고 있습니다.
nl: Er ging iets mis met het sturen van de validatie mail, de veranderingen zijn wel succesvol doorgevoerd.
pl: Wysyłanie emaila z potwierdzeniem nie powiodło się, ale zmiany zostały poprawnie zapisane.
sr: Нешто је пошло наопако при слању валидационог мејла, промене су ипак успешно обрађене.
ta: சரிபார்ப்பு அஞ்சலை அனுப்பும்போது ஏதோ தவறு ஏற்பட்டது, மாற்றங்கள் இன்னும் சரியாக செயலாக்கப்படுகின்றன.
tr: Doğrulama postası gönderilirken bir şeyler yanlış gitti, yine de değişiklikler doğru şekilde kaydedildi.
uk: Щось пішло не так під час надсилання листа перевірки, зміни все ще правильно обробляються.
zh_hans: 发送验证邮件时出现问题，正在处理中。

# mail_goodbye
source: Keep programming! The Hedy team
ar: استمر في البرمجةّ فريق هيدي
ca: Segueix programant! L'equip d'Hedy
de: Programmiere weiter! Das Hedy-Team
eo: Dankon! La teamo Hedy
es: ¡Sigue programando! El equipo de Hedy
fr: Continuez de programmer ! L'équipe Hedy
id: Terima kasih! Tim Hedy
kab: Kemmel asihel Tarbaɛt n Hedy
ko: 꾸준한 프로그래밍! Hedy 팀
nl: Dankjewel! Het Hedy team
pl: Powodzenia w programowaniu! Zespół Hedy
sr: Наставите да програмирате! Hedy тим
ta: நிரலாக்கத்தை வைத்திருங்கள்! எடி அணி
tr: Programlamaya devam edin! Hedy ekibi
uk: Продовжуйте програмувати! Команда Hedy
zh_hans: 继续编程! Hedy团队

# mail_hello
source: Hi {username}!
ar: مرحباً {username}!
ca: Hola {username}!
eo: Saluton {username}!
es: ¡Hola, {username}!
fr: Salut {username} !
id: Hai {username}!
kab: Azul a {username}!
ko: 안녕하세요 {username}!
nl: Hallo {username}!
pl: Witaj {username}!
sr: Здраво {username}!
ta: ஆய் {username}!
tr: Merhaba {username}!
uk: привіт {username}!
zh_hans: 你好 {username}！

# mail_recover_password_body
source: By clicking on this link, you can set a new Hedy password. This link is valid for <b>4</b> hours. If you haven't required a password reset, please ignore this email: {link}
ar: من خلال الضغط على هذا الرابط ، يمكنك ضبط كلمة مرور جديدة لـهيدي. هذا الرابط صالح لمدة <b> ٤ </b> ساعات. إذا لم تطلب إعادة ضبط كلمة المرور ، فيرجى تجاهل هذا البريد الإلكتروني: {link}
ca: Clicant a aquest enllaç, podreu establir una nova contrasenya d'Hedy. Aquest enllaç serà vàlid durant <b>4</b> hores. Si no heu sol·licitat un restabliment de la contrasenya, ignoreu aquest correu electrònic: {link}
de: Durch Klicken auf diesen Link können Sie ein neues Hedy-Passwort festlegen. Der Link ist für <b>4</b> Stunden gültig. Wenn Sie keine Zurücksetzung angefordert haben, können Sie diese Mail ignorieren: {link}
es: Al hacer click en este enlace, puedes cambiar tu contraseña. Este enlace es válido durante <b>4</b> horas. Si no has pedido restablecer tu contraseña, por favor ignora este email. {link}
fr: En cliquant sur ce lien, vous pouvez modifier votre mot de passe Hedy. Ce lien est valable <b>4</b> heures. Si vous n'avez pas demandé une modification du mot de passe, veuillez ignorer ce mail : {link}
id: Dengan mengklik tautan ini, kamu dapat men-set password Hedy baru. Tautan ini berlaku selama <b>4</b> jam. Jika kamu tidak membutuhkan set ulang password, mohon abaikan email ini: {link}
ko: 이 링크를 클릭하면 새 Hedy 비밀번호를 설정할 수 있습니다. 이 링크는 <b>4</b>시간 동안 유효합니다. 비밀번호 리셋이 필요하지 않은 경우 이메일 {link}을(를) 무시하십시오
nl: Door te klikken op deze link kun je een nieuw Hedy wachtwoord instellen. Deze link is geldig voor <b>4</b> uur. Als jij geen nieuw wachtwoord wilt, negeer dan deze e-mail: {link}
pl: Klikając ten link, możesz ustawić nowe hasło Hedy. Ten link jest ważny przez <b>4</b> godziny. Jeśli nie wymagałeś resetowania hasła, zignoruj ten e-mail: {link}
sr: Кликом на ову везу, можете поставити нову Hedy лозинку. Ова веза је важећа <b>4</b> сата. Ако нисте захтевали ресетовање лозинке, молимо вас да игноришете овај емаил: {link}
ta: இந்த இணைப்பைக் சொடுக்கு செய்வதன் மூலம், நீங்கள் புதிய எடி கடவுச்சொல்லை அமைக்கலாம். இந்த இணைப்பு <b> 4 </b> மணிநேரங்களுக்கு செல்லுபடியாகும். உங்களுக்கு கடவுச்சொல் மீட்டமைப்பு தேவையில்லை என்றால், தயவுசெய்து இந்த மின்னஞ்சலை புறக்கணிக்கவும்: {link}
tr: Bu bağlantıya tıklayarak yeni bir Hedy şifresi belirleyebilirsiniz. Bu bağlantı <b>4</b> saat süreyle geçerlidir. Şifre sıfırlama talebiniz olmadıysa lütfen bu e-postayı dikkate almayın: {link}
uk: Натиснувши це посилання, ви можете встановити новий пароль Hedy. Це посилання дійсне протягом <b>4</b> годин. Якщо ви не вимагали скидання пароля, проігноруйте цей електронний лист: {link}
zh_hans: 通过单击此链接，您可以设置新的Hedy密码。此链接的有效期为 <b>4</b> 小时。 如果您不需要重置密码，请忽略此电子邮件：{link}

# mail_recover_password_subject
source: Request a password reset.
ar: طلب إعادة ضبط كلمة المرور.
bg: Поискайте повторно задаване на парола.
ca: Sol·liciteu un restabliment de la contrasenya.
cs: Požádat o obnovení hesla.
da: Anmod om nulstilling af adgangskode.
de: Passwort-Reset anfordern.
eo: Petu pasvortigon.
es: Restablecer contraseña.
fr: Demander la restauration de mot de passe.
hi: सांकेतिक शब्द को फिर से कायम करने अनुरोध करें।
id: Set ulang password Hedy kamu.
kab: Ssuter awennez n wawal n uɛeddi.
ko: 암호 리셋을 요청합니다.
nl: Reset jouw Hedy wachtwoord.
pl: Poproś o zresetowanie hasła.
sr: Затражите ресетовање лозинке.
sw: Omba kuweka upya nenosiri.
ta: கடவுச்சொல் மீட்டமைப்பைக் கோருங்கள்.
tr: Şifre sıfırlama talebinde bulunun.
uk: Запит на скидання пароля.
vi: Yêu cầu đặt lại mật khẩu.
zh_hans: 请求重置密码。

# mail_reset_password_body
source: Your Hedy password has been reset to a new one. If you did this, all is good. If you didn't change your password, please contact us immediately by replying to this email.
ar: تمت إعادة ضبط كلمة مرور هيدي الخاصة بك إلى كلمة مرور جديدة. إذا كنت أنت من طلب/قام بهذا ، فكل شيء على ما يرام. إذا لم تقم بطلب/بفعل تغيير كلمة المرور الخاصة بك ، فيرجى الاتصال بنا على الفور من خلال الرد على هذا البريد الإلكتروني.
ca: La teva contrasenya d'Hedy s'ha restablert a una de nova. Si ja n'estaves al corrent, tot bé. Si no heu canviat la vostra contrasenya, poseu-vos en contacte amb nosaltres immediatament responent a aquest correu electrònic.
de: Ihr Hedy-Passwort wurde zurückgesetzt. Wenn Sie das waren, ist alles in Ordnung. Wenn Sie ihr Passwort nicht verändert haben, kontaktieren Sie uns bitte sofort, indem Sie auf diese Mail antworten.
es: Tu contraseña de Hedy ha cambiado a una nueva. Si lo has hecho tú, no te preocupes. Si no has cambiado tu contraseña, por favor contáctanos inmediatamente contestando a este email.
fr: Votre mot de passe Hedy a été modifié. Si vous en êtes à l'origine, tant mieux. Autrement, veuillez nous contacter immédiatement en répondant à ce mail.
fy: Dyn wachtwurd resette If you didn't change your password, please contact us immediately by replying to this email.
id: Password Hedy kamu sudah di-set ke yang baru. Jika kamu melakukan ini, tidak masalah. Jika kamu tidak mengganti password, segera kontak kami dengan membalas email ini.
ko: 독자 분의 Hedy 비밀번호가 새 비밀번호로 리셋되었습니다. 만약 의도 하셨다면, 모든 것이 잘 된 일입니다. 비밀번호를 변경하지 않으셨다면, 이 이메일에 답장을 보내 즉시 저희에게 연락해주세요.
nl: Jouw Hedy wachtwoord is ge-reset naar een nieuw wachtwoord. Als jij dit was, helemaal goed! Als jij jouw wachtwoord niet hebt veranderd, neem dan zo snel mogelijk contact met ons op door te reageren op deze mail.
pl: Twoje hasło Hedy zostało zresetowane do nowego. Jeśli to zrobiłeś, wszystko jest w porządku. Jeśli nie zmieniłeś hasła, natychmiast skontaktuj się z nami, odpowiadając na tę wiadomość e-mail.
sr: Ваша Hedy лозинка је ресетована на нову. Ако сте ви то урадили, све је у реду. Ако нисте променили лозинку, молимо вас да нас одмах контактирате одговарајући на овај емаил.
ta: உங்கள் எடி கடவுச்சொல் புதியதாக மீட்டமைக்கப்பட்டுள்ளது. நீங்கள் இதைச் செய்திருந்தால், எல்லாம் நல்லது. உங்கள் கடவுச்சொல்லை மாற்றவில்லை என்றால், இந்த மின்னஞ்சலுக்கு பதிலளிப்பதன் மூலம் உடனடியாக எங்களை தொடர்பு கொள்ளவும்.
tr: Hedy şifreniz yeni bir şifre ile sıfırlandı. Eğer bunu siz yaptıysanız, her şey yolunda demektir. Şifrenizi siz değiştirmediyseniz, lütfen bu e-postayı yanıtlayarak hemen bizimle iletişime geçin.
uk: Ваш пароль Hedy скинуто на новий. Якщо ви зробили це, все добре. Якщо ви не змінювали свій пароль, негайно зв’яжіться з нами, відповівши на цей електронний лист.
zh_hans: 您的Hedy密码已被重置为新密码。如果是你改的那就没事。 如果你并没有修改密码，请立即回复本邮件与我们联系。

# mail_reset_password_subject
source: Your Hedy password has been reset
ar: تم إعادة ضبط كلمة مرور هيدي الخاصة بك
ca: La teva contrasenya de Hedy s'ha restablert
de: Dein Hedy-Passwort wurde zurückgesetzt
es: Tu contraseña de Hedy ha sido reseteada
fr: Ton mot de passe Hedy a été remis à zéro
id: Password Hedy kamu sudah berhasil di-set ulang
kab: Awal-ik n uɛeddi n Hedy yettuwennez
ko: Hedy 암호가 리셋되었습니다
nl: Jouw Hedy wachtwood is ge-reset
pl: Twoje hasło Hedy zostało zresetowane
sr: Ваша Hedy лозинка је ресетована
ta: உங்கள் எடி கடவுச்சொல் மீட்டமைக்கப்பட்டுள்ளது
tr: Hedy şifreniz sıfırlandı
uk: Ваш пароль Hedy скинуто
zh_hans: 你的Hedy密码已被重置
