Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# student_adventures_table_explanation
source: This table displays the programs created by students for each adventure in a level. By clicking the eye icon, you can view the program's page; after reviewing the program, you can tick the checkmark to indicate completion.
ar: يعرض هذا الجدول البرامج التي أنشأها الطلاب لكل مغامرة في كل مستوى. بالنقر على علامة العين، يمكنك عرض صفحة البرنامج؛ وبعد مراجعة البرنامج، بإمكانك وضع علامة صح للإشارة أنه مكتمل.
ca: Aquesta taula mostra els programes creats pels alumnes per a cada aventura en un nivell. En fer clic a la icona de l'ull, pots veure la pàgina del programa; després de revisar el programa, pots marcar la casella per indicar que està completat.
es: Esta tabla muestra los programas creados por los alumnos para cada aventura de un nivel. Haciendo clic en el icono del ojo, puede ver la página del programa; después de revisar el programa, puede marcar la marca de verificación para indicar que lo ha completado.
pl: W tej tabeli wyświetlane są programy tworzone przez uczniów dla każdej przygody na poziomie. Klikając ikonę oka, możesz wyświetlić stronę programu; po przejrzeniu programu możesz zaznaczyć jego ukończenie.
sr: Ова табела приказује програме које су креирали ученици за сваку авантуру на нивоу. Кликом на икону ока, можете видети страницу програма; након прегледа програма, можете означити квачицу да бисте означили завршетак.
ta: இந்த அட்டவணை ஒவ்வொரு சாகசத்திற்கும் மாணவர்கள் உருவாக்கிய திட்டங்களை ஒரு மட்டத்தில் காட்டுகிறது. கண் ஐகானைக் சொடுக்கு செய்வதன் மூலம், நீங்கள் நிரலின் பக்கத்தைக் காணலாம்; நிரலை மதிப்பாய்வு செய்த பிறகு, நிறைவடைவதைக் குறிக்க செக்மார்க்கைத் தேர்வுசெய்யலாம்.
uk: У цій таблиці показано програми, створені учнями для кожної пригоди рівня. Натиснувши значок ока, ви можете переглянути сторінку програми; після перегляду програми ви можете поставити галочку, щоб вказати завершення.
zh_hans: 此表显示学生为某一级别的每个冒险创建的程序。单击眼睛图标可查看程序页面；查看程序后，可勾选对勾以表示完成。

# student_already_invite
source: This student already has a pending invitation.
ar: هذا التلميذ بالفعل لديه دعوة قيد الإنتظار.
ca: Aquest alumne ja té una invitació pendent.
de: Diese(r) Schüler(in) hat bereits eine ausstehende Einladung.
es: Este alumno ya tiene una invitación pendiente.
fr: L'élève a déjà une invitation en attente.
hi: इस छात्र के पास पहले से ही एक आमंत्रण लंबित है
id: Siswa ini sudah memiliki undangan yang menunggu keputusan.
ko: 이 학생은 이미 초대 대기 중입니다.
nl: Deze leerling heeft al een openstaande uitnodiging.
pl: Ten uczeń został już zaproszony do klasy.
sr: Овај ученик већ има на чекању позивницу.
ta: இந்த மாணவர் ஏற்கனவே நிலுவையில் உள்ள அழைப்பைக் கொண்டுள்ளார்.
tr: Bu öğrencinin zaten bekleyen bir daveti var.
uk: У цього студента вже є запрошення, що очікує на розгляд.
zh_hans: 该学生有待处理的邀请。

# student_in_another_class
source: This student is in another class. Ask the student to leave all classes and try again.
ar: هذا الطالب في صف آخر. اسأل الطالب أن يرحل كل صفوفه وأن يحاول مرة أخرى.
ca: Aquest alumne està en una altra classe. Demana a l'estudiant que surti de totes les classes i ho intenti de nou.
es: Este alumno está en otra clase. Pídale al alumno que abandone todas las clases y vuelva a intentarlo.
nl: Leerling zit in een andere klas. Vraag de leerling om alle lessen te verlaten en het opnieuw te proberen.
sr: Овај ученик је у другом разреду. Замолите ученика да напусти све разреде и покушајте поново.
ta: இந்த மாணவர் மற்றொரு வகுப்பில் இருக்கிறார். எல்லா வகுப்புகளையும் விட்டுவிட்டு மீண்டும் முயற்சிக்கவும் மாணவரிடம் கேளுங்கள்.
uk: Цей учень в іншому класі. Попросіть учня залишити всі заняття та повторити спробу.
zh_hans: 该学生正在上其他课程。请该学生退出所有课程并重试。

# student_information
source: Student's Information
ar: معلومات الطالب
ca: Informació de l'alumne
es: Información del alumno
kab: Talɣut n yinelmaden
pl: Informacje ucznia
sr: Информације о ученику
ta: மாணவர்களின் செய்தி
uk: Інформація для студента
zh_hans: 学生信息

# student_information_explanation
source: This table displays basic information about the students in your class. There are also several actions you can do in this table: change the password of a student by clicking the pencil icon, view the program's page of a student by clicking the code icon, and delete a student from the class by clicking the red bin icon.
ar: هذا الجدول يعرض معلومات أساسية عن طلاب صفك. يمكنك أيضا: تغيير كلمة مرور أحد الطلاب بالضغط على علامة القلم، الاطّلاع على صفحة برنامج طالب بالضغط على علامة البرنامج، وحذف طالب من الصف بالضغط على العلامة الحمراء.
ca: Aquesta taula mostra informació bàsica sobre els alumnes de la teva classe. També hi ha diverses accions que pots fer en aquesta taula: canviar la contrasenya d'un alumne fent clic a la icona del llapis, veure la pàgina del programa d'un alumne fent clic a la icona del codi i eliminar un alumne de la classe fent clic a la icona de la paperera vermella.
es: Esta tabla muestra información básica sobre los alumnos de su clase. También hay varias acciones que puede realizar en esta tabla: cambiar la contraseña de un alumno haciendo clic en el icono del lápiz, ver la página del programa de un alumno haciendo clic en el icono del código y eliminar a un alumno de la clase haciendo clic en el icono rojo de la papelera.
pl: W tej tabeli wyświetlane są podstawowe informacje o uczniach w klasie. W tej tabeli można również wykonać kilka czynności: zmienić hasło ucznia, klikając ikonę ołówka, wyświetlić stronę programu ucznia, klikając ikonę kodu, i usunąć ucznia z klasy, klikając czerwoną ikonę kosza.
sr: Ова табела приказује основне информације о ученицима у вашој класи. Такође постоји неколико радњи које можете урадити у овој табели: промените лозинку ученика кликом на икону оловке, погледајте страницу програма ученика кликом на икону кода и обришите ученика из класе кликом на црвену икону канте.
ta: இந்த அட்டவணை உங்கள் வகுப்பில் உள்ள மாணவர்களைப் பற்றிய அடிப்படை தகவல்களைக் காட்டுகிறது. இந்த அட்டவணையில் நீங்கள் செய்யக்கூடிய பல செயல்களும் உள்ளன: பென்சில் ஐகானைக் சொடுக்கு செய்வதன் மூலம் ஒரு மாணவரின் கடவுச்சொல்லை மாற்றவும், குறியீடு ஐகானைக் சொடுக்கு செய்வதன் மூலம் ஒரு மாணவரின் திட்டத்தின் பக்கத்தைக் காணவும், ரெட் பின் ஐகானைக் சொடுக்கு செய்வதன் மூலம் வகுப்பிலிருந்து ஒரு மாணவரை நீக்கவும்.
uk: У цій таблиці відображається основна інформація про учнів вашого класу. У цій таблиці також можна виконати кілька дій: змінити пароль студента, клацнувши значок олівця, переглянути сторінку програми студента, клацнувши значок коду, і видалити студента з класу, клацнувши червоний значок кошика .
zh_hans: 此表显示你班级学生的基本信息。你还可以在此表中执行多项操作：单击铅笔图标可更改学生的密码，单击代码图标可查看学生的课程页面，单击红色垃圾箱图标可从班级中删除学生。

# student_signup_header
source: Student
ar: طالب
ca: Alumne
de: Schüler(in)
es: Alumno
fr: Étudiant
id: Siswa
kab: Anelmad
ko: 학생
nl: Leerling
pl: Uczeń
sr: Ученик
ta: மாணவர்
tr: Öğrenci
uk: студент
zh_hans: 学生

source: students
ar: طلاب
ca: alumnat
de: Schüler*innen
eo: lernantoj
es: alumnos
fr: élèves
fy: learlingen
hi: छात्र
id: murid-murid
kab: inelmaden
ko: 학생들
nl: Leerlingen
pl: uczniowie
sr: ученици
ta: மாணவர்கள்
tr: öğrenciler
uk: студентів
zh_hans: 学生

# submission_time
source: Handed in at
ar: تم التسليم بتوقيت
ca: Entregat fa
de: Eingereicht um
es: Entregado en
fr: Rendu à
id: Diserahkan pada
kab: Yettwarr i
ko: 제출일
nl: Ingeleverd op
pl: Data wręczenia
sr: Предато у
ta: ஒப்படைக்கப்பட்டது
tr: Teslim edilme zamanı
uk: Здано о
zh_hans: 交于

# submit_answer
source: Answer question
ca: Respon la pregunta
de: Frage beantworten
fr: Répondre à la question
id: Jawab pertanyaan
ko: 확인
nl: Beantwoord vraag
pl: Odpowiedz na pytanie
sr: Одговори на питање
tr: Soruyu cevaplayın
uk: Відповідь на запитання
zh_hans: 回答问题

# submit_program
source: Submit
ar: قدِّم
ca: Lliura
de: Absenden
eo: Submeti
es: Enviar
fr: Envoyer
hi: प्रस्तुत
id: Kirim
kab: Azen
ko: 제출하다
nl: Inleveren
pl: Wyślij
sr: Предај
ta: சமர்ப்பிக்கவும்
tr: Teslim edin
uk: Надіслати
zh_hans: 提交

# submit_warning
source: Are you sure you want to submit this program?
ar: هل أنت متأكد أنك تريد تقديم هذا البرنامج؟
ca: Estàs segur que vols lliurar aquest programa?
de: Bist du dir sicher dass du das Programm absenden willst?
eo: Ĉu vi certe volas submeti ĉi tiun programon?
es: ¿Estás seguro de que quieres enviar este programa?
fr: Êtes-vous sûr de vouloir soumettre ce programme ?
hi: क्या आप वाकई इस प्रोग्राम को प्रस्तुत करना चाहते हैं?
id: Apakah Anda yakin ingin mengirimkan program ini?
kab: D tidet tebɣiḍ ad tazneḍ ahil-a?
ko: 이 프로그램을 제출하시겠습니까?
nl: Weet je zeker dat je dit programma wilt inleveren?
pl: Czy jesteś pewien, że chcesz wysłać ten program?
sr: Да ли сте сигурни да желите да предате овај програм?
ta: இந்த திட்டத்தை சமர்ப்பிக்க விரும்புகிறீர்களா?
tr: Bu programı teslim etmek istediğinizden emin misiniz?
uk: Ви впевнені, що хочете подати цю програму?
zh_hans: 是否确实要提交此程序？

source: Submitted
ar: تم التسليم
ca: Lliurat
de: Eingereicht
es: Enviado
fr: Déposé
id: Dikirim
kab: Yettwazen
ko: 제출된
nl: Ingeleverd
pl: Wysłane
sr: Предати
ta: சமர்ப்பிக்கப்பட்டது
tr: Teslim edildi
uk: Надіслано
zh_hans: 已提交

# submitted_header
source: This program has been successfully submitted and can't be edited anymore.
ar: هذا برنامج تم تسليمه ولا يمكن تعديله.
ca: Aquest és un programa ja lliurat i no pot ser modificat.
de: Das ist ein bereits versendetes Programm und kann nicht mehr geändert werden.
fr: Ce programme a été déposé et ne peut être modifié.
id: Ini adalah program yang telah dikirimkan dan tidak dapat diubah.
ko: 제출된 프로그램이므로 변경할 수 없습니다.
nl: Dit is een ingeleverd programma en kan niet worden bewerkt.
pl: Ten program został wysłany i nie może zostać zmieniony.
sr: Ово је предат програм и не може се мењати.
ta: இந்த திட்டம் வெற்றிகரமாக சமர்ப்பிக்கப்பட்டுள்ளது, இனி திருத்த முடியாது.
tr: Bu teslim edilmiş bir programdır ve üzerinde değişiklik yapılamaz.
uk: Це подана програма, і вона не може бути змінена.
zh_hans: 这是一个已提交的程序，无法更改。

source: Subscribe
ar: اشترك
ca: Subscriu-te
cs: Potvrdit
de: Abonnieren
eo: Aboni
es: Suscribirse
fr: S'abonner
id: Langganan
kab: Multeɣ
ko: 구독하기
nl: Schrijf je in
pl: Zasubskrybuj
sr: Претплати се
ta: குழுசேர்
tr: Abone Olun
uk: Підпишіться
zh_hans: 订阅

# subscribe_message
source: Stay up to date with our latest news and events by subscribing to our newsletter. You can opt in by clicking the button below. If you change your mind later, use the unsubscribe link in any of our emails.
ar: كن على اطلاع بآخر أخبارنا بالاشتراك لنشرتنا الإخبارية. يمكنك المشاركة بالضغط على الزر في الأسفل. إذا غيرت رأيك فيما بعد، يمكن استخدام زر إلغاء الاشتراك في أي من رسائلنا الالكترونية.
es: Mantente informado con las últimas noticias y eventos suscribiéndote a nuestro boletín. Puedes darte de alta haciendo clic en el botón de abajo. Si cambias de opinión más tarde, utiliza el enlace para darte de baja en cualquiera de nuestros correos electrónicos.
nl: Schrijf je in voor onze nieuwsbrief en blijf op de hoogte van het laatste nieuws en evenementen. Klik op de knop hieronder om je aan te melden. Uitschrijven kan altijd via de link in onze e-mails.
ta: எங்கள் செய்திமடலுக்கு குழுசேர்வதன் மூலம் எங்கள் அண்மைக் கால செய்திகள் மற்றும் நிகழ்வுகளுடன் புதுப்பித்த நிலையில் இருங்கள். கீழே உள்ள பொத்தானைக் சொடுக்கு செய்வதன் மூலம் நீங்கள் தேர்வு செய்யலாம். பின்னர் உங்கள் எண்ணத்தை மாற்றினால், எங்கள் எந்த மின்னஞ்சல்களிலும் குழுவிலகும் இணைப்பைப் பயன்படுத்தவும்.
uk: Будьте в курсі наших останніх новин та подій, підписавшись на нашу розсилку. Ви можете підписатися, натиснувши кнопку нижче. Якщо ви передумаєте пізніше, скористайтеся посиланням для відписки в будь-якому з наших листів.

# subscribe_newsletter
source: Subscribe to the newsletter
ar: اشترك في النشرة الإخبارية
bg: Абонирай се за нашия журнал
ca: Subscriu-te al butlletí
cs: Přihlásit se k newsletteru
de: Abonniere den Newsletter
es: Subscribirse al newsletter
fr: S'abonner à la newsletter
fy: Ynskreaue foar de nijsbrief
hi: समाचार पत्रिका की सदस्यता लें
id: Berlangganan ke buletin
kab: Multeɣ ɣer uḥric n yisalan
ko: 뉴스레터 구독하기
nl: Schrijf je in voor de nieuwsbrief
pl: Zasubskrybuj do biuletynu informacyjnego
sr: Претплатите се на билтен
sw: Jisajili kwa jarida
ta: செய்திமடலுக்கு குழுசேரவும்
tr: Haber bültenine abone olun
uk: Підпишіться на розсилку
zh_hans: 订阅通讯

# subscribed_header
source: You are subscribed
ar: لقد صرت الآن مشتركا
es: Te has suscrito
nl: Je bent ingeschreven
ta: நீங்கள் சந்தா செலுத்தியுள்ளீர்கள்
uk: Ви підписані

# subscribed_message
source: Thank you for subscribing to our newsletter! We hope you are enjoying it and we would love to hear any feedback you have in our <a target="_blank" href="https://discord.gg/8yY7dEme9r">Discord server</a>. If you change your mind later, use the unsubscribe link in any of our emails.
ar: شكرا لاشتراكك في نشرتنا الإخبارية! نأمل أن تستمتع بها، ونحب أن تشاركنا رأيك بها على موزع الدسكورد الخاص بنا: <a target="_blank" href="https://discord.gg/8yY7dEme9r">. إذا غيرت رأيك لاحقا، يمكنك استخدام رابط إلغاء الاشتراك في أي من رسالاتنا الالكترونية.
es: ¡Gracias por suscribirte a nuestro boletín! Esperamos que lo disfrutes y nos encantaría saber cualquier opinión que puedas tener en nuestro <a target="_blank" href="https://discord.gg/8yY7dEme9r">servidor de Discord</a>. Si cambias de opinión más adelante, emplea el enlace para darte de baja en cualquiera de nuestros correos electrónicos.
nl: Bedankt voor je inschrijving voor onze nieuwsbrief! We zijn blij dat je erbij bent! Laat ons weten wat je ervan vindt in onze <a target="_blank" href="https://discord.gg/8yY7dEme9r">Discord server</a>. Uitschrijven kan altijd via de link in onze e-mails.
ta: எங்கள் செய்திமடலுக்கு குழுசேர்ந்ததற்கு நன்றி! நீங்கள் அதை அனுபவிக்கிறீர்கள் என்று நாங்கள் நம்புகிறோம், எங்கள் <a target = "_ BLANG" href = "https://discord.gg/8yy7deme9r"> முரண்பாடு சேவையகம் </a> இல் உங்களிடம் உள்ள எந்தவொரு கருத்தையும் கேட்க விரும்புகிறோம். பின்னர் உங்கள் எண்ணத்தை மாற்றினால், எங்கள் எந்த மின்னஞ்சல்களிலும் குழுவிலகும் இணைப்பைப் பயன்படுத்தவும்.
uk: Дякуємо за підписку на нашу розсилку! Сподіваємося, вам це подобається, і ми будемо раді почути будь-які ваші відгуки в нашому <a target="_blank" href="https://discord.gg/8yY7dEme9r">Discord сервер</a>. Якщо ви пізніше передумаєте, скористайтеся посиланням для скасування підписки в будь-якому з наших електронних листів.

# successful_runs
source: Successful runs: {successful_runs}
ar: محاولات ناجحة:: {successful_runs}
ca: Execucions exitoses: {successful_runs}
es: Ejecuciones exitosas: {successful_runs}
kab: Iteddu akken iwata: {successful_runs}
pl: Udane uruchomienia: {successful_runs}
sr: Успешна извршења: {successful_runs}
ta: வெற்றிகரமான ரன்: {successful_runs}
uk: Успішні пробіжки: {successful_runs}
zh_hans: 成功运行：{successful_runs}

# successfully_subscribed
source: You have been successfully subscribed to our newsletter
ar: لقد تم اشتراكك في رسالتنا الإخبارية بنجاح
es: Te has suscrito correctamente a nuestro boletín
nl: Je bent ingeschreven voor onze nieuwsbrief
ta: எங்கள் செய்திமடலுக்கு நீங்கள் வெற்றிகரமாக சந்தா செலுத்தியுள்ளீர்கள்
uk: Ви успішно підписалися на нашу розсилку

# suggestion_color
source: Try using another color
ca: Prova d'utilitzar un altre color
es: Intenta usar otro color
nl: Probeer een andere kleur
pl: Spróbuj użyć innego koloru
sr: Покушајте да користите другу боју
ta: மற்றொரு வண்ணத்தைப் பயன்படுத்த முயற்சிக்கவும்
uk: Спробуйте використати інший колір
zh_hans: 尝试使用另一种颜色

# suggestion_note
source: Try using a note between C0 and B9 or a number between 1 and 70
ca: Prova d'utilitzar una nota entre C0 i B9 o un número entre 1 i 70
es: Intente utilizar una nota entre C0 y B9 o un número entre 1 y 70
pl: Użyj nuty między C0 i B9 lub liczby pomiędzy 1 a 70
sr: Покушајте да користите ноту између C0 и B9 или број између 1 и 70
ta: C0 மற்றும் B9 க்கு இடையில் ஒரு குறிப்பைப் பயன்படுத்த முயற்சிக்கவும் அல்லது 1 முதல் 70 க்கு இடையில் ஒரு எண்ணைப் பயன்படுத்தவும்
uk: Спробуйте використати ноту від C0 до B9 або число від 1 до 70
zh_hans: 尝试使用 C0 至 B9 之间的音符或 1 至 70 之间的数字

# suggestion_number
source: Try changing the value to a number
ca: Prova de canviar el valor a un número
es: Intenta cambiar el valor a un número
nl: Probeer de waarde te veranderen in een nummer
pl: Spróbuj zmienić wartość na liczbę
sr: Покушајте да промените вредност у број
ta: மதிப்பை ஒரு எண்ணாக மாற்ற முயற்சிக்கவும்
uk: Спробуйте змінити значення на число
zh_hans: 尝试将值更改为数字

# suggestion_numbers_or_strings
source: Try changing the values to be all text or all numbers
ca: Prova de canviar els valors perquè siguin tots text o tots números
es: Prueba a cambiar los valores para que sean todo texto o todo números
pl: Spróbuj zmienić wartości na tekst lub liczby
sr: Покушајте да промените вредности да буду све текст или све бројеви
ta: அனைத்து உரை அல்லது அனைத்து எண்களாக மதிப்புகளை மாற்ற முயற்சிக்கவும்
uk: Спробуйте змінити значення, щоб вони були лише текстом або лише числами
zh_hans: 尝试将值更改为全部文本或全部数字

# surname
source: First Name
ar: الاسم الأول
ca: Nom
cs: Jméno
de: Vorname
eo: Antaŭnomo
es: Nombre
fr: Prénom
id: Nama Depan
kab: Isem
ko: 이름
nl: Voornaam
pl: Imię
sr: Име
ta: முதல் பெயர்
tr: İlk Adınız
uk: Ім'я
zh_hans: 名

# survey_skip
source: Don't show this again
ar: لا تظهر هذا مرة أخرى
ca: No ho tornis a mostrar
es: No vuelvas a mostrar esto
kab: Ur d-skan ara tikkelt niḍen
nl: Laat dit niet meer zien
pl: Nie pokazuj tego ponownie
sr: Не приказуј ово поново
ta: இதை மீண்டும் காட்ட வேண்டாம்
uk: Не показувати це знову
zh_hans: 不要再显示这个

# survey_submit
source: Submit
ar: قدِّم
ca: Envia
es: Enviar
kab: Azen
nl: Indienen
pl: Wyślij
sr: Предај
ta: சமர்ப்பிக்கவும்
uk: Надіслати
zh_hans: 提交

source: Tag in adventure
ar: ضع علامة: مغامرة
ca: Etiqueta en l'aventura
es: Etiqueta en la aventura
nl: Keyword (tag) in avontuur
pl: Oznacz w przygodzie
sr: Ознака у авантури
ta: சாகசத்தில் குறிச்சொல்
uk: Теги в пригодах
zh_hans: 标记挑战

# tag_input_placeholder
source: Enter a new tag
ar: اكتب علامة جديدة
ca: Introdueix una nova etiqueta
es: Introduzca una nueva etiqueta
id: Masukkan tag baru
kab: Sekcem tabzimt tamaynut
nl: Geef een nieuw keyword (tag)
pl: Wprowadź nowy znacznik
sr: Унесите нову ознаку
ta: புதிய குறிச்சொல்லை உள்ளிடவும்
uk: Введіть новий тег
zh_hans: 输入一个新标签

source: Tags
ar: العلامات
ca: Etiquetes
es: Etiquetas
id: Tag
kab: Tibzimin
nl: Keywords (Tags)
pl: Znaczniki
sr: Ознаке
ta: குறிச்சொற்கள்
uk: Теги
zh_hans: 标签

source: Teacher
ar: معلم
ca: Professor
de: Lehrer
eo: Instruisto
es: Profesor
fr: Enseignant
id: Guru
kab: Aselmad
ko: 선생님
nl: Leraren
pl: Nauczyciel
sr: Учитељ
ta: ஆசிரியர்
tr: Öğretmen
uk: Вчитель
zh_hans: 教师

# teacher_invalid
source: Your teacher value is invalid.
ar: قيمة المعلم الخاصة بك غير صالحة.
ca: El valor professor no és vàlid.
de: Dein LehrerIn-Wert ist ungültig.
es: Tu valor de profesor no es válido.
fr: La valeur du paramètre enseignant n'est pas valable.
hi: आपका शिक्षक मान अमान्य है
id: Nilai guru Anda tidak valid.
ko: 선생님 값이 올바르지 않습니다.
nl: Jouw leraren waarde is ongeldig.
pl: Twoja wartość nauczyciela jest niepoprawna.
sr: Ваша вредност наставника је неважећа.
ta: உங்கள் ஆசிரியர் மதிப்பு தவறானது.
tr: Öğretmen değeriniz geçersiz.
uk: Ваше значення викладача недійсне.
zh_hans: 你的教师值无效。

# teacher_invitation_require_login
source: To set up your profile as a teacher, we will need you to log in. If you don't have an account, please create one.
ar: لإعداد ملفك الشخصي كمعلم ، سنحتاج منك تسجيل الدخول. إذا لم يكن لديك حساب ، فالرجاء إنشاء حساب.
ca: Per a configurar el teu perfil com a professor, cal que t'autentifiquis primer. Si no tens un compte, crea'n un.
de: Um dein LehrerIn Profil zu erstellen musst du dich anmelden. Wenn du noch kein Konto besitzt, dann erstell dir bitte eins.
es: Para configurar tu perfil como profesor, necesitamos que te autentifiques. Si no tienes una cuenta, crea una.
fr: Pour configurer votre compte professeur, vous devez vous connecter. Si vous n'avez pas de compte, veuillez en créer un.
hi: एक शिक्षक के रूप में आपकी प्रोफ़ाइल सेट करने के लिए हमें आपको लॉग इन करने की आवश्यकता होगी। यदि आपके पास कोई खाता नहीं है, तो कृपया एक बनाएं।
id: Untuk mengatur profil Anda sebagai guru, kami mengharuskan Anda masuk. Jika Anda belum memiliki akun, silakan buat akun.
ko: 선생님으로 프로필을 설정하려면 로그인을 해야 합니다. 계정이 없으면 계정을 만들어 주세요.
nl: Om je lerarenaccount te activeren moet je eerst inloggen. Als je nog geen account hebt, maak dan eerst een account aan.
pl: Żeby ustawić Twoje konto jako konto nauczyciela musisz się najpierw zalogować. Jeżeli nie masz konta, proszę stworzyć nowe.
sr: Да бисте подесили свој профил као наставник, потребно је да се пријавите. Ако немате налог, молимо вас да га направите.
ta: ஆசிரியராக உங்கள் சுயவிவரத்தை அமைக்க, நீங்கள் உள்நுழைய வேண்டும். உங்களிடம் கணக்கு இல்லையென்றால், ஒன்றை உருவாக்கவும்.
tr: Bir öğretmen olarak profilinizi oluşturmak için oturum açmanız gerekmektedir. Eğer bir hesabınız yoksa, lütfen bir hesap oluşturun.
uk: Щоб налаштувати свій профіль як викладача, нам потрібно буде увійти. Якщо у вас немає облікового запису, створіть його.
zh_hans: 要将您的个人资料设置为教师，我们需要您登录。如果您没有帐户，请创建一个。

source: Teacher manual
ar: دليل المعلمين
ca: Manual del professor
de: Lehranleitung
es: Manual de profesor
fr: Manuel de l'enseignant
id: Panduan guru
kab: Awfus n uselmad
ko: 선생님용 설명서
nl: Lerarenhandleiding
pl: Instrukcja dla nauczyciela
sr: Приручник за наставнике
ta: ஆசிரியர் கையேடு
tr: Öğretmen kılavuzu
uk: Посібник учителя
zh_hans: 教师手册

# teacher_signup_header
source: Teacher
ar: المعلم
ca: Professor
de: Lehrperson
es: Profesor
fr: Enseignant
id: Guru
kab: Aselmad
ko: 선생님
nl: leraar
pl: Nauczyciel
sr: Учитељ
ta: ஆசிரியர்
tr: Öğretmen
uk: вчитель
zh_hans: 教师

# teacher_welcome
source: Welcome to Hedy! Your are now the proud owner of a teachers account which allows you to create classes and invite students.
ar: مرحباً في هيدي! بكل فخر أنت الآن تمتلك حساباً كمعلم وذا يسمح لك بانشاء صفوف ودعوة تلاميذ.
ca: Benvinguda a Hedy! El teu compte s'ha actualitzat a compte de professorat. Això et permetrà crear classes i convidar alumnes.
de: Willkommen bei Hedy! Du bist nun eine stolze BesitzerIn eines LehrerIn Kontos, welches dir erlaubt Klassen zu erstellen und Schüler einzuladen.
es: ¡Bienvenido/a a Hedy! Ahora eres el orgulloso dueño de una cuenta de profesor, lo que te permite crear clases e invitar a alumnos.
fr: Bienvenue chez Hedy ! Vous êtes maintenant l'heureux propriétaire d'un compte enseignant qui vous permet de créer des cours et d'inviter des étudiants.
hi: हेडी में आपका स्वागत है! अब आप एक शिक्षक खाते के गर्वित स्वामी हैं जो आपको कक्षाएं बनाने और छात्रों को आमंत्रित करने की अनुमति देता है।
id: Selamat datang di Hedy! Anda sekarang bangga menjadi pemilik akun guru yang memungkinkan Anda membuat kelas dan mengundang siswa.
ko: Hedy에 오신 것을 환영합니다! 여러분은 이제 수업을 만들고 학생들을 초대할 수 있는 선생님 계정의 자랑스러운 소유자가 되었습니다.
nl: Welkom bij Hedy! Jouw account is omgezet naar een lerarenaccount. Je kan nu klassen maken en er leerlingen in uitnodigen.
pl: Witaj w Hedy! Jesteś teraz dumnym posiadaczem konta nauczyciela, które pozwala Ci na tworzenie klas i zapraszanie uczniów.
sr: Добродошли у Hedy! Сада сте поносни власник налога за наставнике који вам омогућава да креирате одељења и позивате ученике.
ta: எடிக்கு வருக! நீங்கள் இப்போது ஆசிரியர்கள் கணக்கின் பெருமைமிக்க உரிமையாளர், இது வகுப்புகளை உருவாக்கவும் மாணவர்களை அழைக்கவும் உங்களை அனுமதிக்கிறது.
tr: Hedy'ye hoş geldiniz! Artık sınıflar oluşturmanıza ve öğrencileri davet etmenize olanak tanıyan bir öğretmen hesabının gururlu sahibisiniz.
uk: Ласкаво просимо до Hedy! Тепер ви щасливий власник облікового запису вчителя, який дозволяє вам створювати класи та запрошувати студентів.
zh_hans: 欢迎来到海蒂！ 您现在是教师帐户的自豪拥有者，该帐户允许您创建课程并邀请学生。

source: Teachers
ar: المعلمون
ca: Professors
es: Profesores
id: Guru-guru
kab: Iselmaden
nl: Leraren
pl: Nauczyciele
sr: Наставници
ta: ஆசிரியர்கள்
uk: Вчителі
zh_hans: 教师
