Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# heard_about_hedy
source: How have you heard about Hedy?
ar: كيف سمعت عن هيدي؟
ca: Com t'has assabentat d'Hedy?
de: Wie hast du von Hedy erfahren?
es: ¿Cómo has conocido Hedy?
fr: Comment avez-vous entendu parler d'Hedy ?
id: Bagaimana Anda pernah mendengar tentang Hedy?
kab: Amek i tesliḍ s Hedy?
ko: Hedy 얘기는 어떻게 들었어?
nl: Heb je al van Hedy gehoord?
pl: W jaki sposób usłyszałeś o Hedy?
sr: Како сте чули за Hedy?
ta: எடி பற்றி நீங்கள் எப்படி கேள்விப்பட்டீர்கள்?
tr: Hedy'yi nereden duydunuz?
uk: Як ви дізналися про Хеді?
zh_hans: 你是怎么知道海蒂的？

# heard_about_invalid
source: Please select a valid way you heard about us.
ar: رجاء اختر كيف سمعت عنا.
ca: Si us plau, seleccioni una forma vàlida de com es va assabentar de nosaltres.
de: Bitte wähle einen gültigen Weg, wie du von uns gehört hast.
es: Por favor, selecciona una forma válida de cómo nos conociste.
fr: Veuillez sélectionner une réponse valide.
id: Silakan pilih cara valid Anda mendengar tentang kami.
kab: Ttxil-k fren abrid ameɣtu swayes i tesliḍ fell-aɣ.
ko: 우리에 대해 들은 올바른 방법을 선택해 주세요.
nl: Kies hoe je van ons gehoord hebt.
pl: Proszę wybrać poprawny sposób w jaki o nas usłyszałeś.
sr: Молимо вас да изаберете важећи начин на који сте чули за нас.
ta: எங்களைப் பற்றி நீங்கள் கேள்விப்பட்ட சரியான வழியைத் தேர்ந்தெடுக்கவும்.
tr: Lütfen bizden haberdar olduğunuz geçerli bir yolu seçin.
uk: Виберіть правильний спосіб, яким ви дізналися про нас.
zh_hans: 请选择你了解我们的有效方式。

source: Hedy Introduction Slides
ar: شرائح تحتوي مقدمة عن هيدي
ca: Diapositives d'introducció a Hedy
es: Diapositivas de introducción de Hedy
kab: Tibursatin n tazwara n Hedy
pl: Slajdy zawierające wprowadzenie do Hedy
sr: Уводне слајдове за Хеди
ta: எடி அறிமுகம் ச்லைடுகள்
uk: Слайди вступу Хеді
zh_hans: 海蒂介绍幻灯

# hedy_logo_alt
source: Hedy logo
ar: العلامة المؤسسية لهيدي
ca: Logotip d'Hedy
eo: Emblemo de Hedy
es: Logo de Hedy
fr: Logo d'Hedy
id: Logo Hedy
kab: Alugu n Hedy
ko: Hedy 로고
pl: Logo Hedy
sr: Hedy лого
ta: எடி லோகோ
tr: Hedy logosu
uk: Логотип Hedy
zh_hans: 海蒂标志

source: Hedy on Github
ar: هيدي على Github
ca: Hedy a Github
de: Hedy auf Github
es: Hedy en Github
fr: Hedy sur Github
id: Hedy di Github
kab: Hedy ɣef Github
nl: Hedy op Github
pl: Hedy na Githubie
sr: Hedy на Github-у
ta: கிதுபில் எடி
tr: Github'da Hedy
uk: Hedy на Github
zh_hans: 海蒂在 Github 上

# hello_logo
source: hello
ar: مرحبا
bg: Здравей
ca: hola
cs: Ahoj!
de: hallo
eo: Saluton!
es: hola
fr: Bonjour
fy: hallo
hi: हेलो
id: Halo
kab: Azul
ko: 안녕하세요
nl: hallo
pl: hej
sr: здраво
sw: Hujambo!
ta: வணக்கம்
tr: Merhaba
uk: Привіт
zh_hans: 你好

source: Hide adventures
ar: أخفِ المغامرات
ca: Amaga aventures
es: Esconder aventuras
kab: Ffer tidyanin
nl: Verberg avonturen
pl: Ukryj przygody
sr: Сакриј авантуре
ta: சாகசங்களை மறைக்கவும்
uk: Сховати пригоди
zh_hans: 隐藏探险

source: Hide classes
ar: أخفِ الصفوف
ca: Amaga classes
es: Esconder clases
kab: Ffer ismilen
pl: Ukryj klasy
sr: Сакриј часове
ta: வகுப்புகளை மறைக்கவும்
uk: Приховати класи
zh_hans: 隐藏课程

source: Hide keyword switcher
ar: اخفاء تبديل الكلمات المفتاحية
ca: Amaga el commutador de paraules clau
de: Verstecke Schlüsselwortumschalter
es: Ocultar selector de palabras clave
fr: Masquer le sélecteur de mots clés
id: Sembunyikan pengalih kata kunci
kab: Ffer amefran n wawalen n tsarut
ko: 키워드 전환기 숨기기
nl: Verberg commando-taal switcher
pl: Ukryj przełącznik słów kluczowych
sr: Сакриј прекидач кључних речи
ta: முக்கிய சுவிட்சரை மறைக்கவும்
tr: Anahtar kelime değiştiriciyi gizle
uk: Приховати перемикач ключових слів
zh_hans: 隐藏关键字切换器

source: Hide slides
ar: أخفِ الشرائح
ca: Amaga diapositives
es: Esconder diapositivas
kab: Ffer tibursatin
pl: Ukryj slajdy
sr: Сакриј слајдове
ta: ச்லைடுகளை மறைக்கவும்
uk: Сховати слайди
zh_hans: 隐藏幻灯

source: Highest level reached
ar: أعلى مستوى تم الوصول له
ca: Màxim nivell assolit
de: Höchstes erreichtes Level
es: Nivel más alto alcanzado
fr: Plus haut niveau atteint
fy: Heechste level berikke
hi: पहुंचा गया उच्चतम स्तर
id: Level tertinggi yang berhasil dicapai
kab: Aswir ɛlayen i yettwaxedmen
ko: 최고 레벨 도달
nl: Hoogste level afgerond
pl: Najwyższy osiągnięty poziom
sr: Највиши достигнути ниво
ta: மிக உயர்ந்த நிலை அடைந்தது
tr: Ulaşılan en yüksek seviye
uk: Досягнуто найвищого рівня
zh_hans: 达到的最高等级

source: Highest quiz score
ca: Puntuació més alta del qüestionari
de: Höchster Quiz Punktestand
fr: Meilleur score au quiz
id: Skor kuis tertinggi
ko: 퀴즈 최고점
nl: Hoogste quiz score
pl: Największy wynik z Quizu
sr: Највиши резултат на квизу
tr: En yüksek kısa sınav puanı
uk: Найвищий бал у тестуванні
zh_hans: 最高测验分

source: Hint?
ca: Pista?
de: Hinweis?
fr: Un indice ?
id: Petunjuk?
ko: 힌트?
pl: Podpowiedź?
sr: Савет?
tr: İpucu?
uk: Підказка?
zh_hans: 提示？

# ill_work_some_more
source: I'll work on it a little longer
ar: سأعمل على هذه فترة أطول قليلا
ca: Hi treballaré una mica més
de: Ich werde noch ein wenig weiter dran arbeiten
es: Voy a trabajar en él un poco más
fr: Je vais le travailler encore un peu
id: Saya akan mengerjakannya sedikit lebih lama
kab: Ad rnuɣ ad sluɣmuɣ fell-as
ko: 제가 조금만 더 작업을 해볼게요
nl: Ik werk er nog even aan verder
pl: Jeszcze nad nim popracuję
sr: Радићу на овоме још мало
ta: நான் இன்னும் சிறிது நேரம் வேலை செய்வேன்
tr: Üzerinde biraz daha çalışacağım
uk: Я ще трохи попрацюю над цим
zh_hans: 我会再努力一会儿

# image_invalid
source: The image you chose is invalid.
ar: الصورة التي اخترتها غير صالحة.
ca: La imatge que has escollit no és vàlida.
es: La imagen que has escogido no es válida.
kab: Tugna i tferneḍ d tarameɣtut.
ko: 선택한 이미지가 올바르지 않습니다.
nl: Jouw gekozen profielfoto is ongeldig.
pl: Wybrany obraz jest niewłaściwy.
sr: Слика коју сте изабрали је неважећа.
ta: நீங்கள் தேர்ந்தெடுத்த படம் தவறானது.
uk: Вибране вами зображення недійсне.
zh_hans: 你选择的图像是无效的。

# incomplete_command_exception
source: Incomplete Command
ar: أمر برمجي غير مكتمل
ca: Comanda incompleta
de: Unvollständiges Kommando
es: Comando incompleto
id: Perintah Tidak Lengkap
kab: Taladna tarummidt
ko: 불완전한 명령어
nl: Commando niet compleet
pl: Niekompletne polecenie
sr: Непотпуна команда
ta: முழுமையற்ற கட்டளை
tr: Tamamlanmamış Komut
uk: Незавершена команда
zh_hans: 命令不完整

# incorrect_handling_of_quotes_exception
source: Incorrect handling of quotes
ar: تعامل غير صحيح مع علامات الاقتباس
ca: Ús incorrecte de les cometes
es: Uso incorrecto de las comillas
id: Penanganan kutipan yang salah
ko: 견적처리가잘못되었습니다
nl: Haakjes niet goed gebruikt
pl: Nieprawidłowa obsługa cytatów
sr: Нетачно руковање наводницима
ta: மேற்கோள்களின் தவறான கையாளுதல்
tr: Tırnak işaretlerinin yanlış kullanımı
uk: Некоректна обробка котирувань
zh_hans: 引号处理不正确

# incorrect_use_of_types_exception
source: Incorrect use of types
ar: استعمال غير صحيح للأنواع
ca: Ús incorrecte dels tipus
es: Uso incorrecto de los tipos
id: Penggunaan tipe yang salah
kab: Yir aseqdec n wanawen
ko: 잘못된종류사용
nl: type niet goed gebruikt
pl: Nieprawidłowe użycie typów
sr: Нетачна употреба типова
ta: வகைகளின் தவறான பயன்பாடு
tr: Tiplerin yanlış kullanımı
uk: Некоректне використання типів
zh_hans: 类型使用不当

# incorrect_use_of_variable_exception
source: Incorrect use of variable
ar: استعمال غير صحيح للمتغيرات
ca: Ús incorrecte de la variable
de: Falsche Nutzung von Variablen
es: Uso incorrecto de la variable
id: Penggunaan variabel yang salah
kab: Yir aseqdec n umutti
ko: 변수사용오류
nl: Variabele niet goed gebruikt
pl: Nieprawidłowe użycie zmiennej
sr: Нетачна употреба променљиве
ta: மாறியின் தவறான பயன்பாடு
tr: Değişkenin yanlış kullanımı
uk: Некоректне використання змінної
zh_hans: 变量使用不当

# indentation_exception
source: Incorrect Indentation
ar: توجد مسافة غير صحيحة
ca: Indentació incorrecta
es: Sangría incorrecta
id: Indentasi Salah
ko: 잘못된 들여쓰기
nl: Inspringen niet goed gebruikt
pl: Niepoprawne wcięcie
sr: Нетачно увлачење
ta: தவறான உள்தள்ளல்
tr: Yanlış Girintileme
uk: Неправильний відступ
zh_hans: 缩进不正确

# input
source: input from `{ask}`
ar: مُدخل من '{ask}'
ca: Input d'un {ask}
de: Eingabe aus `{ask}`
es: input de `{ask}`
fr: saisie de `{ask}`
hi: `{ask}` से input
id: masukan dari `{ask}`
kab: anekcum seg `{ask}`
ko: {ask}에서 입력
nl: invoer van `{ask}`
pl: wejście z `{ask}`
sr: унос од `{ask}`
ta: `{ask}` என்பதிலிருந்து உள்ளீடு
tr: `{ask}`'dan alınan girdi
uk: вхідні дані з `{ask}`
zh_hans: `{ask}`中的输入

# input_variable_role
source: input
ar: مُدخل
ca: entrada
es: entrada
kab: sekcem
pl: wejście
sr: унос
ta: உள்ளீடு
uk: введення
zh_hans: 输入

# integer
source: a number
ar: رقم
ca: un numero
de: eine ganze Zahl
eo: nombro
es: un número
fr: un nombre
hi: एक संख्या
id: sebuah angka
kab: azwil
ko: 수
nl: een getal
pl: liczba
sr: број
ta: ஒரு எண்
tr: bir sayı
uk: число
zh_hans: 数字

# invalid_class_link
source: Invalid link for joining the class.
ar: رابط الانضمام للصف غير صالح.
ca: Enllaç d'unió a la classe invàlid.
de: Ungültiger Link zum Beitreten zu einer Klasse.
es: Enlace incorrecto para unirse a la clase.
fr: Lien non valide pour rejoindre la classe.
hi: कक्षा में शामिल होने के लिए अमान्य लिंक|
id: Tautan untuk bergabung ke kelas tidak valid.
kab: Yir aseɣwen i unekcum ɣer usmil.
ko: 수업에 가입하기 위한 링크가 잘못되었습니다.
nl: Ongeldige klassenlink.
pl: Niepoprawny link dołączenia do klasy.
sr: Неважећа веза за придруживање одељењу.
ta: வகுப்பில் சேர தவறான இணைப்பு.
tr: Sınıfa katılmak için geçersiz bağlantı.
uk: Недійсне посилання для приєднання до класу.
zh_hans: 用于加入班级的链接无效。

# invalid_command_exception
source: Invalid command
ar: أمر برمجي غير صحيح
ca: Comanda invàlida
de: Ungültiges Kommando
es: Comando no válido
id: Perintah tidak valid
kab: Yir taladna
ko: 잘못된 명령어
nl: Ongeldig commando
pl: Nieprawidłowe polecenie
sr: Неважећа команда
ta: தவறான கட்டளை
tr: Geçersiz komut
uk: Недійсна команда
zh_hans: 无效命令

# invalid_keyword_language_comment
source: # The provided keyword language is invalid, keyword language is set to English
ar: # الكلمة الرئيسة المدخلة غير صحيحة، لغة الكلمات الرئيسة تم ضبطها إلى الانجليزية
ca: # L'idioma per a les comandes proporcionat no és vàlid, es farà servir l'anglès mentrestant
es: # La palabra clave para el idioma proporcionada no es válida, la palabra clave idioma se establece en Inglés
id: # Bahasa kata kunci yang diberikan tidak valid, bahasa kata kunci disetel ke bahasa Inggris
nl: # De gegeven keyword taal is ongeldig, keyword taal is naar Engels gezet
pl: # Podany język słów kluczowych jest nieprawidłowy, język słów kluczowych jest ustawiony na angielski
sr: # Дати језик кључних речи је неважећи, језик кључних речи је постављен на енглески
ta: # வழங்கப்பட்ட முக்கிய மொழி தவறானது, முக்கிய மொழி ஆங்கிலத்திற்கு அமைக்கப்பட்டுள்ளது
tr: # Belirtilen anahtar kelime dili geçersiz, bu yüzden anahtar sözcük dili İngilizce olarak ayarlandı
uk: # Надана мова ключового слова недійсна, мовою ключового слова встановлено англійську
zh_hans: # 提供的关键字语言无效，关键字语言设置为英语

# invalid_language_comment
source: # The provided language is invalid, language set to English
ar: # اللغة المستخدمة غير صحيحة، عدل اللغة إلى الانجليزية
ca: # L'idioma proporcionat no és vàlid, es farà servir l'anglès
es: # El idioma proporcionado no es válido, el idioma está configurado en inglés
id: # Bahasa yang diberikan tidak valid, bahasa disetel ke bahasa Inggris
nl: # De gegeven taal is ongeldig, de taal is naar Engels gezet
pl: # Podany język jest nieprawidłowy, język ustawiony na angielski
sr: # Дати језик је неважећи, језик је постављен на енглески
ta: # வழங்கப்பட்ட மொழி தவறானது, மொழி ஆங்கிலத்திற்கு அமைக்கப்பட்டுள்ளது
tr: # Belirtilen dil geçersiz, bu yüzden dil İngilizce olarak ayarlandı
uk: # Вказана мова недійсна, вибрано англійську мову
zh_hans: # 提供的语言无效，语言设置为英语

# invalid_level_comment
source: # The provided level is invalid, level is set to level 1
ar: # المستوى الذي أدخلته غير صحيح، تم اختيار المستوى الأول لك
ca: # El nivell proporcionat no és vàlid, s'ha establert el nivell 1
es: # El nivel proporcionado no es válido, el nivel se establece en el nivel 1
id: # Level yang diberikan tidak valid, level disetel ke level 1
nl: # Het gegeven level is ongeldig, het level is naar level 1 gezet
pl: # Podany poziom jest nieprawidłowy, poziom jest ustawiony na poziom 1
sr: # Дати ниво је неважећи, ниво је постављен на ниво 1
ta: # வழங்கப்பட்ட நிலை தவறானது, நிலையை நிலை 1 என அமைக்கப்பட்டுள்ளது
tr: # Belirtilen seviye geçersizdir, bu yüzden seviye 1 olarak ayarlandı
uk: # Наданий рівень недійсний, встановлено рівень 1
zh_hans: # 提供的级别无效，级别设置为级别1

# invalid_program_comment
source: # The provided program is invalid, please try again
ar: # البرنامج المزود غير صحيح، رجاءً حاول مرة أخرى
ca: # El programa proporcionat no és vàlid, torneu-ho a provar
es: # El programa proporcionado no es válido, por favor inténtelo de nuevo
id: # Program yang disediakan tidak valid, silakan coba lagi
nl: # Het gegeven programma is ongeldig, graag nogmaals proberen
pl: # Podany program jest nieprawidłowy, spróbuj ponownie
sr: # Дати програм је неважећи, молимо покушајте поново
ta: # வழங்கப்பட்ட நிரல் தவறானது, தயவுசெய்து மீண்டும் முயற்சிக்கவும்
tr: # Belirtilen program geçersiz, lütfen tekrar deneyin
uk: # Надана програма недійсна, спробуйте ще раз
zh_hans: # 提供的程序无效，请重试

# invalid_teacher_invitation_code
source: The teacher invitation code is invalid. To become a teacher, reach out to hello@hedy.org.
ar: رمز الدعوة للمعلم غير صالح. لتصبح معلماً أو معلمةً تواصل معنا على hello@hedy.org.
bg: Този код не е валиден.
ca: El codi d'invitació del professor no és vàlid. Per convertir-vos en professor, poseu-vos en contacte amb hello@hedy.org.
de: Der Einladungscode als Lehrkraft ist ungültig. Um Lehrkraft zu werden, kontaktiere hello@hedy.org.
eo: La invitkodo por instruisto ne validas. Por fariĝi instruisto, kontaktu nin ĉe hello@hedy.org.
es: El código de instructor es inválido. Para ser instructor, por favor mande un mensaje a hello@hedy.org.
fr: Le code d’invitation d’enseignant n’est pas valide. Pour devenir enseignant, veuillez contacter hello@hedy.org.
hi: िक्षक आमंत्रण कोड अमान्य है| शिक्षक बनने के लिए, hello@hedy.org पर संपर्क करें|
id: Kode undangan guru tidak valid. Untuk menjadi guru, hubungi hello@hedy.org.
ko: 선생님 초청 코드가 올바르지 않습니다. 선생님가 되려면 hello@hedy.org 에 연락해보세요.
nl: Deze lerarenuitnodigingscode is niet geldig. Als je een nieuwe uitnodiging nodig hebt, neem dan contact op met hello@hedy.org.
pl: Kod zaproszenia nauczyciela jest niewłaściwy. Aby zostać nauczycielem, skontaktuj się z hello@hedy.org.
sr: Код за позив наставника је неважећи. Да бисте постали наставник, обратите се на hello@hedy.org.
ta: ஆசிரியர் அழைப்புக் குறியீடு தவறானது. ஆசிரியராக மாற, Hello@hedy.org ஐ அணுகவும்.
tr: Öğretmen davet kodu geçersizdir. Öğretmen olmak için, hello@hedy.org adresine ulaşın.
uk: Код запрошення для викладача недійсний. Щоб стати викладачем, зверніться за адресою hello@hedy.org.
zh_hans: 教师邀请码无效。想要成为一名教师，请联系 hello@hedy.org。

source: Invalid username/password.
ar: اسم المستخدم/كلمة المرور غير صحيحة.
ca: Nom d'usuari/contrasenya no vàlid.
cs: Neplatné uživatelské jméno/heslo.
de: Benutzername/Passwort ist ungültig.
eo: Nevalida salutnomo aŭ pasvorto.
es: Combinación de usuario/contraseña inválida.
fr: Pseudo/Mot de passe invalide.
fy: Unjildige brûkersnamme as wachtwurd.
hi: अमान्य उपयोगकर्तानाम/सांकेतिक शब्द
id: Username/password tidak valid.
kab: Isem n useqdac/awal n uɛeddi d arameɣtu.
ko: 사용자 이름/비밀번호가 잘못되었습니다.
nl: Ongeldige gebruikersnaam/wachtwoord combinatie.
pl: Niepoprawna nazwa użytkownika lub hasło.
sr: Неважеће корисничко име/лозинка.
sw: Jina la mtumiaji/nenosiri ni batili.
ta: தவறான பயனர்பெயர்/கடவுச்சொல்.
tr: Geçersiz kullanıcı adı/şifre.
uk: Недійсне ім'я користувача/пароль.
zh_hans: 无效的用户名/密码。

# invitations_sent
source: All the invitations were sent successfully!
ar: أُرسلت كل الدعوات بنجاح!
ta: அனைத்து அழைப்புகளும் வெற்றிகரமாக அனுப்பப்பட்டன!
uk: Усі запрошення успішно надіслано!

source: Invite
ar: ادعو
ta: அழைக்கவும்
uk: Запросити

source: Invite by username
ar: ادعو باستخدام اسم المستخدم
ca: Convida per nom d'usuari
de: Einladen mit Benutzername
eo: Inviti per salutnomo
es: Invitar por nombre de usuario
fr: Invitation par nom d'utilisateur
id: Undang berdasarkan nama pengguna
kab: Asnubget s yisem n useqdac
ko: 사용자 이름으로 초대
nl: Uitnodigen met een gebruikersnaam
pl: Zaproś za pomocą nazwy użytkownika
sr: Позови по корисничком имену
ta: பயனர்பெயர் மூலம் அழைக்கவும்
tr: Kullanıcı adına göre davet et
uk: Запросити по імені користувача
zh_hans: 按用户名邀请

source: Invite date
ar: تاريخ الدعوة
ca: Data de la invitació
de: Einladungsdatum
eo: Dato de invito
es: Fecha de invitación
fr: Date d'invitation
hi: आमंत्रण तिथि
id: Tanggal undangan
kab: Azemz n tinnubga
ko: 초대일자
nl: Uitnodigingsdatum
pl: Data zaproszenia
sr: Датум позива
ta: தேதியை அழைக்கவும்
tr: Davet tarihi
uk: Дата запрошення
zh_hans: 邀请日期

# invite_message
source: You have received an invitation to join class
ar: لقد تلقيت دعوة للإنضمام إلى الصف
ca: Has rebut una invitació per unir-te a la classe
de: Du hast eine Einladung zu einer Klasse erhalten
es: Has recibido una invitación para unirse a una clase
fr: Vous avez reçu une invitation à rejoindre le cours
hi: आपको कक्षा में शामिल होने का निमंत्रण मिला है
id: Anda telah menerima undangan untuk bergabung dengan kelas
kab: Teṭṭfeḍ tinnubga i tmerna ɣer usmil
ko: 수업에 참여하라는 초대장을 받았습니다
nl: Je hebt een uitnodiging ontvangen voor de klas
pl: Otrzymałeś zaproszenie dołączenia do klasy
sr: Примили сте позив да се придружите одељењу
ta: வகுப்பில் சேர உங்களுக்கு அழைப்பு வந்துள்ளது
tr: Sınıfa katılmak için bir davetiye aldınız
uk: Ви отримали запрошення приєднатися до класу
zh_hans: 你已经收到了加入班级的邀请

# invite_prompt
source: Enter a username
ar: أدخل اسم مستخدم
ca: Introduïu un nom d'usuari
de: Nutzernamen eingeben
eo: Tajpu salutnomon
es: Introduce un nombre de usuario
fr: Entre un nom d'utilisateur
hi: एक उपयोगकर्ता नाम दर्ज करें
id: Masukkan nama pengguna
kab: Sekcem-d isem n useqdac
ko: 사용자 이름 입력
nl: Vul een gebruikersnaam in
pl: Wprowadź nazwę użytkownika
sr: Унесите корисничко име
ta: பயனர்பெயரை உள்ளிடவும்
tr: Bir kullanıcı adı girin
uk: Введіть ім'я користувача
zh_hans: 输入一个用户名

# invite_teacher
source: Invite a teacher
ar: دعوة معلم
ca: Convida un professor
es: Invitar a un profesor
id: Undang seorang guru
kab: Snubget aselmad
nl: Nodig een leraar/lerares uit
pl: Zaproś nauczyciela
sr: Позовите наставника
ta: ஒரு ஆசிரியரை அழைக்கவும்
uk: Запросити вчителя
zh_hans: 邀请老师

source: Join class
ar: انضم الى صف
ca: Uneix-te a la classe
de: Klasse beitreten
eo: Aliĝi al klaso
es: Unirse a la clase
fr: Rejoindre la classe
hi: कक्षा में शामिल हों
id: Gabung kelas
kab: Rnu ɣer usmil
ko: 수업참여
nl: Inschrijven voor klas
pl: Dołącz do klasy
sr: Придружи се разреду
ta: வகுப்பில் சேரவும்
tr: Sınıfa katılın
uk: Приєднуйтесь до класу
zh_hans: 加入课堂

# join_prompt
source: You need to have an account to join a class. Would you like to login now?
ar: يجب أن يكون لديك حساب لتنضم الى صف. هل تريد تسجيل الدحول الآن؟
ca: Necessites tenir un compte per unir-te a una classe. Vols iniciar sessió ara?
de: Zum Beitreten benötigst du ein Konto. Möchtest du dich registrieren?
es: Debes estar registrado para unirte a una clase. ¿Deseas entrar a tu cuenta?
fr: Tu dois avoir un compte pour rejoindre cette classe. Veux-tu te connecter maintenant ?
fy: Hast in akkount nedich om oan in klas meidwaan te kinnen. Wolst no ynlogge?
hi: कक्षा में शामिल होने के लिए आपके पास एक खाता होना चाहिए। क्या आप अभी लॉग इन करना चाहेंगे?
id: Kamu memerlukan akun untuk bergabung ke kelas. Apakah kamu ingin masuk dengan akun kamu sekarang?
kab: Tesriḍ ad tesɛuḍ amiḍan i wakken ad ternuḍ ɣer usmil. Tebɣiḍ ad teqqneḍ tura?
ko: 수업에 참여하려면 계정이 있어야 합니다. 지금 로그인하시겠습니까?
nl: Je moet ingelogd zijn om je voor een klas in te kunnen schrijven. Wil je inloggen of een account maken?
pl: Potrzebujesz konta aby dołączyć do klasy. Czy chcesz się teraz zalogować?
sr: Морате имати налог да бисте се придружили разреду. Да ли желите да се пријавите сада?
ta: ஒரு வகுப்பில் சேர உங்களுக்கு ஒரு கணக்கு இருக்க வேண்டும். இப்போது உள்நுழைய விரும்புகிறீர்களா?
tr: Bir sınıfa katılmak için bir hesabınızın olması gerekir. Şimdi giriş yapmak ister misiniz?
uk: Щоб приєднатися до класу, вам необхідно мати обліковий запис. Бажаєте увійти зараз?
zh_hans: 你需要有一个帐户才能加入课程。你想立即登录吗？

# keybinding_waiting_for_keypress
source: Waiting for a keypress...
ar: في انتظار ضغطة من لوحة المفاتيح...
ca: S'està esperant una tecla...
de: Warte auf Knopfdruck...
es: Esperando a que se pulse una tecla...
fr: En attente d'une touche pressée…
id: Menunggu tombol ditekan...
sr: Чекање на притисак дугмета...
ta: ஒரு கீ பிரச்சுக்காக காத்திருக்கிறது ...
uk: Очікування натискання клавіші...
zh_hans: 等待按键...

# keyword_language_invalid
source: Please select a valid keyword language (select English or your own language).
ar: الرجاء اختيار لغة صحيحة للكلمات المفتاحية (الأوامر البرمجية). اختر اللغة الإنجليزية أو لغتك الخاصة.
ca: Seleccioneu un idioma vàlid per a les comandes (seleccioneu l'anglès o el vostre idioma).
de: Bitte wähle eine gültige Schlüsselwortsprache (wähle Englisch oder deine eigene Sprache).
es: Por favor, selecciona un idioma para palabras clave (selecciona Inglés o tu propio idioma).
fr: Veuillez sélectionner une langue valide.
id: Silakan pilih bahasa kata kunci yang valid (pilih bahasa Inggris atau bahasa Anda sendiri).
ko: 올바른 키워드 언어(영어 또는 자국어 선택)를 선택하십시오.
nl: Dit is geen geldige commando taal (kies Engels of je eigen taal).
pl: Proszę wybrać poprawny język słów kluczowych (wybierz angielski lub twój własny język).
sr: Молимо вас да изаберете важећи језик кључних речи (изаберите енглески или свој језик).
ta: செல்லுபடியாகும் முக்கிய மொழியைத் தேர்ந்தெடுக்கவும் (ஆங்கிலம் அல்லது உங்கள் சொந்த மொழியைத் தேர்ந்தெடுக்கவும்).
tr: Lütfen geçerli bir anahtar kelime dili seçin (İngilizce, Türkçe veya kendi dilinizi seçin).
uk: Будь ласка, виберіть дійсну мову ключового слова (виберіть англійську або свою мову).
zh_hans: 请选择有效的关键词语言（选择英语或你自己的语言）。

# landcode_phone_number
source: Please also add your country's landcode
ar: الرجاء إضافة رقم فتح خط دولتك
ca: Si us plau afegeix el prefix internacional del teu país
es: Por favor, añadir también el prefijo internacional de su país
pl: Dodaj również kod identyfikacji kraju
sr: Молимо вас да додате и позивни број ваше земље
ta: தயவுசெய்து உங்கள் நாட்டின் நிலப்பரப்பையும் சேர்க்கவும்
uk: Також додайте код країни
zh_hans: 另请添加您所在国家/地区的地号

source: Language
ar: اللغة
ca: Llengua
de: Sprache
es: Idioma
id: Bahasa
kab: Tutlayt
nl: Taal
pl: Język
sr: Језик
ta: மொழி
tr: Dil
uk: Мова
zh_hans: 语言

# language_invalid
source: Please select a valid language.
ar: الرجاء اختيار لغة صحيحة.
ca: Si us plau selecciona una llengua vàlida.
de: Bitte wähle eine gültige Sprache.
eo: Bonvolu elekti validan lingvon.
es: Por favor, selecciona un lenguaje válido.
fr: Veuillez sélectionner une langue valide.
hi: कृपया एक मान्य भाषा चुनें
id: Silakan pilih bahasa yang valid.
kab: Ttxil-k fren tutlayt tameɣtut.
ko: 올바른 언어를 선택하십시오.
nl: Dit is geen geldige taal, kies een taal vanuit de lijst.
pl: Proszę wybrać poprawny język.
sr: Молимо вас да изаберете важећи језик.
sw: Tafadhali ingiza mwaka lakita 1900 na
ta: சரியான மொழியைத் தேர்ந்தெடுக்கவும்.
tr: Lütfen geçerli bir dil seçin.
uk: Виберіть дійсну мову.
zh_hans: 请选择有效的语言。
