Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# mail_welcome_teacher_subject
source: Your Hedy teacher account is ready
ar: حساب هيدي الخاص بك كمعلم جاهز
ca: El teu compte de professor ja està llesta
de: Dein Hedy-Lehr-Konto ist bereit
es: Tu cuenta de Hedy está lista
fr: Votre compte professeur Hedy est prêt
id: Akun guru Hedy Anda sudah siap
kab: Amiḍan-ik n uselmad n Hedy yewjed
ko: 당신의 Hedy 선생님 계정은 준비가 되었습니다
nl: Jouw Hedy lerarenaccount is klaar
pl: Twoje konto nauczyciela Hedy jest gotowe
sr: Ваш Hedy налог за наставнике је спреман
ta: உங்கள் எடி ஆசிரியர் கணக்கு தயாராக உள்ளது
tr: Hedy öğretmen hesabınız hazır
uk: Ваш обліковий запис викладача Hedy готовий
zh_hans: 您的 Hedy 教师帐户已准备就绪

# mail_welcome_verify_body
source: Your Hedy account has been created successfully. Welcome! Please click on this link to verify your email address: {link}
ar: تم انشاء حساب هيدي الخاص بك بنجاح. أهلاً بك! الرجاء الضغط على هذا الرابط للتحقق من بريدك الإلكتروني: {link}
ca: El teu compte Hedy s'ha creat correctament. Et donem la Benvinguda! Si us plau clica el següent enllaç per verificar el teu correu electrònic: {link}
de: Dein Hedy-Konto wurde erfolgreich angelegt. Willkommen! Bitte klicke auf diesen Link, um deine E-Mail-Adresse zu bestätigen: {link}
es: Tu cuenta de Hedy ha sido creada con éxito. ¡Bienvenido/a! Haz clic en este enlace para verificar su dirección de correo electrónico: {link}
fr: Votre compte Hedy a été crée avec succès. Bienvenue ! Veuillez cliquer sur ce lien pour vérifier votre address mail : {link}
id: Akun Hedy kamu sudah berhasil dibuat. Selamat datang! Silakan klik tautan berikut untuk verifikasi email kamu. {link}
kab: Amiḍan-ik n uselmad n Hedy yettwarna akken iwata. Ansuf Ttxil-k sit ɣef useɣwen-a i usenqed n tansa-k n yimayl: {link}
ko: 귀하의 Hedy 계정이 성공적으로 생성되었습니다. 환영합니다! 이메일 주소를 확인하려면 이 링크를 클릭하십시오. {link}
nl: Jouw Hedy account is aangemaakt! Welkom! Klik op deze link om jouw e-mailadres te bevestigen: {link}
pl: Twoje konto Hedy zostało utworzone. Witaj! Proszę kliknąć na ten link żeby zweryfikować swój adres email: {link}
sr: Ваш Hedy налог је успешно креиран. Добродошли! Молимо кликните на ову везу да верификујете вашу емаил адресу: {link}
ta: உங்கள் எடி கணக்கு வெற்றிகரமாக உருவாக்கப்பட்டுள்ளது. வரவேற்கிறோம்! உங்கள் மின்னஞ்சல் முகவரியை சரிபார்க்க இந்த இணைப்பைக் சொடுக்கு செய்க: {link}
tr: Hedy hesabınız başarıyla oluşturuldu. Hoş geldiniz! E-posta adresinizi doğrulamak için lütfen bu bağlantıya tıklayın: {link}
uk: Ваш обліковий запис Hedy успішно створено. Ласкаво просимо! Натисніть це посилання, щоб підтвердити свою електронну адресу: {link}
zh_hans: 您的Hedy账户已成功创建。欢迎你！ 请点击此链接以验证您的电子邮件地址：{link}

# mail_welcome_verify_subject
source: Welcome to Hedy
ar: مرحباً بك في هيدي
ca: Benvingut/da a Hedy
de: Willkommen bei Hedy
eo: Bonvenon al Hedy
es: Bienvenido/a a Hedy
fr: Bienvenue sur Hedy
id: Selamat datang di Hedy
kab: Ansuf ɣer Hedy
ko: Hedy에 오신것을 환영합니다
nl: Welkom bij Hedy
pl: Witaj w Hedy
sr: Добродошли у Hedy
ta: எடிக்கு வருக
tr: Hedy'ye Hoş Geldiniz
uk: Ласкаво просимо до Хеді
zh_hans: 欢迎来到Hedy

# mailing_title
source: Subscribe to the Hedy newsletter
ar: اشترك في نشرة هيدي الإخبارية
ca: Subscriu-te al butlletí electrònic de Hedy
cs: Přihlaš se k odběru Hedy newsletteru
de: Abonniere den Hedy-Newsletter
es: Suscríbete a la newsletter de Hedy
fr: Abonnez-vous à la newsletter Hedy
id: Berlangganan ke buletin Hedy
kab: Multeɣ ɣer uɣmis n Hedy
ko: Hedy 뉴스레터 구독하기
nl: Schrijf je in voor de Hedy nieuwsbrief
pl: Zasubskrybuj newsletter Hedy
sr: Претплатите се на Hedy билтен
ta: எடி செய்திமடலுக்கு குழுசேரவும்
tr: Hedy haber bültenine abone olun
uk: Підписатися на розсилку новин Hedy
zh_hans: 订阅Hedy新闻通讯

# main_subtitle
source: Textual programming for the classroom
ar: لغة برمجة متدرجة
bg: Градуален език за програмиране
ca: Programació textual per a l’aula
cs: Stupňovitý programovací jazyk
de: Eine mitwachsende Programmiersprache
eo: Laŭgrada programlingvo
es: Programación textual para las aulas
fr: Un langage de programmation textuel pour la salle de classe
id: Sebuah bahasa pemrograman bertahap
kab: Asihel aḍrisan i usmil
ko: 교실용 텍스트 프로그래밍
nl: Een graduele programmeertaal
pl: Stopniowany język programowania
sr: Текстуално програмирање за учионицу
ta: வகுப்பறைக்கான உரை நிரலாக்க
tr: Sınıf için metinsel programlama
uk: Поступова мова програмування
zh_hans: 一种渐进式的编程语言

# main_title
source: Hedy
ar: هيدي
sr: Хеди
ta: எடி
uk: Хеді
zh_hans: 海蒂

# make_sure_you_are_done
source: Make sure you are done! You will not be able to change your program anymore after you click "Hand in".
ar: تأكد أنك قد انتهيت! لن تستطيع أن تغير برنامجك بعد أن تختار "سَلِّم".
ca: Assegura't que has acabat! No podràs canviar el teu programa més després de fer clic a "Lliurar".
de: Stelle sicher, dass du fertig bist! Du wirst dein Programm nicht mehr ändern können, nach du "Abgeben" geklickt hast.
es: ¡Asegúrate de que has terminado! Ya no podrás cambiar tu programa después de hacer clic en "Entregar".
fr: Vérifie d'avoir terminé ! Tu ne pourras pas modifier ton programme après avoir cliquer sur « Rendre ».
id: Pastikan Anda sudah selesai! Anda tidak akan dapat mengubah program Anda lagi setelah Anda mengklik "Serahkan".
ko: 완료했는지 확인하세요! "핸드 인(Hand in)"을 클릭한 후에는 프로그램을 더 이상 변경할 수 없습니다.
nl: Zorg dat je klaar bent! Je kunt je programma niet meer aanpassen nadat je op Inleveren hebt geklikt.
pl: Upewnij się, że wszystko skończone! Po kliknięciu „Oddaj” nie będzie już można wprowadzać zmian w programie.
sr: Уверите се да сте завршили! Нећете моћи да мењате свој програм након што кликнете на "Предај".
ta: நீங்கள் முடித்துவிட்டீர்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்! நீங்கள் "ஏண்ட் இன்" என்பதைக் சொடுக்கு செய்த பிறகு இனி உங்கள் திட்டத்தை மாற்ற முடியாது.
tr: İşinizin tamamen bittiğinden emin olun! "Teslim Et" düğmesine tıkladıktan sonra artık programınızı değiştiremeyeceksiniz.
uk: Переконайтеся, що ви закінчили! Ви більше не зможете змінити свою програму після натискання «Здати».
zh_hans: 确保你完成了！单击“上交”后，你无法再更改程序。

source: Male
ar: ولد / ذكر
bg: Мъжки
ca: Home
cs: Muž
de: männlich
eo: Vira
es: Masculino
fr: Homme
fy: Jonge
hi: पुरुष
id: Laki-laki
ko: 남자
nl: Jongen
pl: Męska
sr: Мушки
sw: Mwanaume
ta: ஆண்
tr: Erkek
uk: Чоловік
zh_hans: 男

# mandatory_mode
source: Mandatory developer's mode
ca: Mode desenvolupador obligatori
de: Verpflichtender Entwicklermodus
fr: Mode dévelopeur obligatoire
id: Mode pengembang wajib
ko: 필수 개발자 모드
nl: Verplichte programmeursmodus
pl: Obowiązkowy tryb deweloperski
sr: Обавезан режим програмера
tr: Zorunlu geliştirici kipi
uk: Обов'язковий режим розробника
zh_hans: 强制开发者模式

# more_info
source: More information
ar: معلومات أكثر
ca: Més informació
es: Más información
kab: Ugar n telɣut
pl: Więcej informacji
sr: Више информација
ta: மேலும் செய்தி
uk: Більше інформації
zh_hans: 更多信息

source: More options
ar: إعدادات أكثر
ca: Més opcions
es: Más opciones
kab: Ugar n textiṛiyin
pl: Więcej opcji
sr: Више опција
ta: மேலும் விருப்பங்கள்
uk: Більше варіантів
zh_hans: 更多选项

# multiple_keywords_warning
source: You are trying to use the keyword {orig_keyword}, but this keyword might have several meanings. Please choose the one you're trying to use from this list and copy paste it in your code, curly braces included: {keyword_list}
ar: تحاول الآن استعمال الكلمة الرئيسة {orig_keyword}، لكن هذه الكلمة الرئيسة تحتمل أكثر من معنى. رجاء اختر المعنى الذي تقصده من هذه القائمة {keyword_list}، وانسخ الكلمة ثم لصقها إلى برنامجك، مع الأقواس المجعدة
ca: Estàs intentant utilitzar la paraula clau {orig_keyword}, però aquesta paraula clau pot tenir diversos significats. Si us plau, tria el que estàs intentant utilitzar d'aquesta llista i copia'l al teu codi, incloent les claus: {keyword_list}
es: Está intentando utilizar la palabra clave {orig_keyword}, pero esta palabra clave puede tener varios significados. Por favor, elija la que está intentando utilizar de esta lista y cópiela y péguela en su código, llaves incluidas: {keyword_list}
pl: Próbujesz użyć słowa kluczowego{orig_keyword}, ale to słowo kluczowe może mieć kilka znaczeń. Wybierz to, którego próbujesz użyć z tej listy i skopiuj a następnie wklej to słowo do kodu, w nawiasach klamrowych: {keyword_list}
sr: Покушавате да користите кључну реч {orig_keyword}, али ова кључна реч може имати неколико значења. Молимо вас да изаберете ону коју покушавате да користите са ове листе и копирате је у свој код, укључујући коврџаве заграде: {keyword_list}
ta: நீங்கள் {orig_keyword} முக்கிய சொல்லைப் பயன்படுத்த முயற்சிக்கிறீர்கள், ஆனால் இந்த முக்கிய சொல்லுக்குப் பல பொருள்கள் இருக்கலாம். தயவுசெய்து இந்தப் பட்டியலிலிருந்து நீங்கள் பயன்படுத்த முயற்சிக்கும் ஒன்றைத் தேர்ந்தெடுத்து அதை உங்கள் குறியீட்டில் ஒட்டவும், சுருள் அடைப்புகள் சேர்க்கப்பட்டுள்ளன: {keyword_list}
uk: Ви намагаєтеся використати ключове слово {orig_keyword}, але воно може мати кілька значень. Будь ласка, виберіть із цього списку той, який ви намагаєтеся використати, і скопіюйте, вставте його у свій код, включаючи фігурні дужки: {keyword_list}
zh_hans: 您正在尝试使用关键字 {orig_keyword}，但该关键字可能有多种含义。 请从此列表中选择您要使用的一个，然后将其复制粘贴到您的代码中，包括大括号：{keyword_list}

# multiple_levels_warning
source: We've noticed you have both selected several levels and included code snippets in your adventure, this might cause issues with the syntax highlighter and the automatic translation of keywords
ar: لقد لاحظنا أنك اخترت مراحل متعددة وأيضا ضمَّنت أجزاء من البرامج في مغامرتك، قد يسبب هذا مشاكل في أداة تمييز الأوامر البرمجية وأيضا في الترجمة التلقائية للكلمات الرئيسة
ca: Hem detectat que has seleccionat diversos nivells i has inclòs fragments de codi a la teva aventura, això podria causar problemes amb el ressaltat de sintaxi i la traducció automàtica de les comandes
es: Hemos observado que ha seleccionado varios niveles y ha incluido fragmentos de código en su aventura, lo que podría causar problemas con el resaltador de sintaxis y la traducción automática de palabras clave
pl: Zauważyliśmy, że oboje wybraliście kilka poziomów i włączyliście fragmenty kodu do swojej przygody, może to powodować problemy z podkreślaniem składni i automatycznym tłumaczeniem słów kluczowych
sr: Приметили смо да сте изабрали неколико нивоа и укључили исечке кода у своју авантуру, ово може изазвати проблеме са синтаксним осветљивачем и аутоматским преводом кључних речи
ta: நீங்கள் இருவரும் பல நிலைகளைத் தேர்ந்தெடுத்து, உங்கள் சாகசத்தில் குறியீடு துணுக்குகளைச் சேர்த்துள்ளதை நாங்கள் கவனித்திருக்கிறோம், இது தொடரியல் ஐலைட்டர் மற்றும் முக்கிய வார்த்தைகளின் தானியங்கி மொழிபெயர்ப்பு ஆகியவற்றுடன் சிக்கல்களை ஏற்படுத்தக்கூடும்
uk: Ми помітили, що ви вибрали кілька рівнів і включили у свою пригоду фрагменти коду, це може спричинити проблеми з підсвічуванням синтаксису та автоматичним перекладом ключових слів
zh_hans: 我们注意到您在冒险中选择了多个级别并包含代码片段，这可能会导致语法突出显示和关键字自动翻译出现问题

source: My account
ar: حسابي
ca: El meu compte
de: Mein Konto
eo: Mia konto
es: Mi cuenta
fr: Mon compte
fy: Myn profyl
hi: मेरा खाता
id: Profil saya
kab: Amiḍan-iw
ko: 내 계정
nl: Mijn account
pl: Moje konto
sr: Мој налог
sw: Wasifu wangu
ta: எனது கணக்கு
tr: Hesabım
uk: Мій рахунок
zh_hans: 我的账户

source: My adventures
ar: مغامراتي
ca: Les meves aventures
de: Meine Abenteuer
eo: Miaj aventuroj
es: Mis aventuras
fr: Mes aventures
hi: मेरे रोमांच
id: Petualanganku
kab: Tidyanin-inu
ko: 나의모험
nl: Mijn avonturen
pl: Moje przygody
sr: Моје авантуре
ta: எனது சாகசங்கள்
tr: Maceralarım
uk: Мої пригоди
zh_hans: 我的探险

source: My classes
ar: صفوفي
ca: Les meves classes
de: Meine Klassen
eo: Miaj klasoj
es: Mis clases
fr: Mes classes
fy: Myn lessen
hi: मेरी कक्षाएँ
id: Kelas-kelas saya
kab: Ismilen-inu
ko: 나의 수업
nl: Mijn klassen
pl: Moje klasy
sr: Моја одељења
ta: என் வகுப்புகள்
tr: Sınıflarım
uk: Мої заняття
zh_hans: 我的课室

source: My messages
ar: رسائلي
ca: Els meus missatges
de: Meine Nachrichten
eo: Miaj mesaĝoj
es: Mis mensajes
fr: Mes messages
hi: मेरे संदेश
id: Pesan saya
kab: Iznan-iw
ko: 나의 메세지
nl: Mijn berichten
pl: Moje wiadomości
sr: Моје поруке
ta: எனது செய்திகள்
tr: Mesajlarım
uk: Мої повідомлення
zh_hans: 我的信息

source: My public profile
ar: الواجهة العامة لملفي الشخصي
ca: El meu perfil públic
de: Mein öffentliches Profil
es: Mi perfil público
id: Profil publik saya
kab: Amaɣnu-inu azayaz
nl: Mijn openbare profiel
pl: Mój profil publiczny
sr: Мој јавни профил
ta: எனது பொது சுயவிவரம்
tr: Herkese açık profilim
uk: Мій публічний профіль
zh_hans: 我的公开个人资料

source: Name
ar: الاسم
ca: Nom
eo: Nomo
es: Nombre
fr: Nom
fy: Namme
hi: नाम
id: Nama
kab: Isem
ko: 이름.
nl: Naam
pl: Imię
sr: Име
ta: பெயர்
tr: İsim
uk: Ім'я
zh_hans: 名字

# nav_hedy
source: Hedy
ar: هيدي
bg: Хеди
sr: Хејди
ta: எடி
uk: Хеді
zh_hans: 海蒂

# nav_learn_more
source: Learn more
ar: المزيد من المعلومات
bg: Повече информация
ca: Aprèn més
cs: Zjisti víc
de: Mehr Infos
eo: Lerni plu
es: Aprende más
fr: En savoir plus
fy: Mear ynfo
id: Pelajari lebih jauh
kab: Issin ugar
ko: 더 배워보기
nl: Meer info
pl: Dowiedz się więcej
sr: Сазнајте више
sw: Jifunze zaidi
ta: மேலும் அறிக
tr: Daha fazla bilgi edinin
uk: Дізнатися більше
zh_hans: 学习更多

# nav_start
source: Home
ar: صفحة البدأ
bg: Главна
ca: Inici
cs: Domů
de: Willkommen
eo: Hejmo
es: Inicio
fr: Page principale
fy: Wolkom
id: Rumah
kab: Agejdan
pl: Dom
sr: Почетна
sw: Anza
ta: வீடு
tr: Ana sayfa
uk: Головна
zh_hans: 首页

source: New password
ar: كلمة مرور جديدة
bg: Нова парола
ca: Nova contrasenya
cs: Nové heslo
de: Neues Passwort
eo: Nova pasvorto
es: Nueva contraseña
fr: Nouveau mot de passe
fy: Nij wachtwurd
hi: नया सांकेतिक शब्द
id: Password baru
kab: Awal n uɛeddi amaynut
ko: 새비밀번호
nl: Nieuw wachtwoord
pl: Nowe hasło
sr: Нова лозинка
sw: Nenosiri mpya
ta: புதிய கடவுச்சொல்
tr: Yeni şifre
uk: Новий пароль
zh_hans: 新密码

# new_password_repeat
source: Repeat new password
ar: أعد كلمة المرور الجديدة
ca: Repeteix la nova contrasenya
de: Wiederhole das neue Passwort
es: Repite la nueva contraseña
hi: नए सांकेतिक शब्द को दोहराएं
id: Ulangi kata sandi baru
kab: Ales awal n uɛeddi amaynut
nl: Herhaal nieuw wachtwoord
pl: Powtórz nowe hasło
sr: Поновите нову лозинку
ta: புதிய கடவுச்சொல்லை மீண்டும் செய்யவும்
tr: Yeni şifreyi tekrarla
uk: Повторіть новий пароль
zh_hans: 重复新密码

# newline
source: a new line
ar: سطر جديد
bg: нов ред
ca: una nova línia
cs: nový řádek
de: eine neue Zeile
eo: linifino
es: un salto de línea
fr: une nouvelle ligne
fy: in enter
hi: एक नई पंक्ति
id: baris baru
kab: izirig amaynut
ko: 새 노선
nl: een enter
pl: nowa linia
sr: нови ред
sw: mstari mpya
ta: ஒரு புதிய வரி
tr: yeni bir satır
uk: нова лінія
zh_hans: 另起一行

source: Newsletter
ar: النشر الإخبارية
es: Boletín
nl: Nieuwsbrief
ta: செய்திமடல்
uk: Інформаційний бюлетень

source: Next adventure
ar: المغامرة التالية
ca: Següent aventura
es: Próxima aventura
kab: Tadyant tuḍfirt
sr: Следећа авантура
ta: அடுத்த துணிவு
uk: Наступна пригода
zh_hans: 下一个冒险

source: Next exercise
ca: Següent exercici
de: Nächste Übung
fr: Exercice suivant
id: Latihan selanjutnya
ko: 다음연습
nl: Volgende opdracht
pl: Następne ćwiczenie
sr: Следећа вежба
tr: Sonraki alıştırma
uk: Наступна вправа
zh_hans: 下一个练习

source: Next page
ar: الصفحة التالية
ca: Següent pàgina
de: Nächste Seite
es: Siguiente página
fr: Page suivante
id: Halaman selanjutnya
kab: Asebter uḍfir
ko: 다음페이지
nl: Volgende pagina
pl: Następna strona
sr: Следећа страница
ta: அடுத்த பக்கம்
tr: Sonraki sayfa
uk: Наступна сторінка
zh_hans: 下一页

source: Next student
ar: الطالب التالي
ca: Següent alumne
es: Siguiente alumno
kab: Anelmad uḍfir
sr: Следећи ученик
ta: அடுத்த மாணவர்
uk: Наступний учень
zh_hans: 下一个学生

source: No
ar: لا
bg: Не
cs: Ne
de: Nein
eo: Ne
fr: Non
fy: Nee
hi: नहीं
id: Tidak
kab: Uhu
ko: 아니요.
nl: Nee
pl: Nie
sr: Не
ta: இல்லை
tr: Hayır
uk: Ні
zh_hans: 不

source: No account?
ar: ليس لديك حساب؟
bg: Нямаш акаунт?
ca: No tens compte?
cs: Zatím nemáš svů účet?
de: Hast du noch kein Konto?
eo: Ĉu konto mankas?
es: ¿Todavía no tienes una cuenta?
fr: Pas encore de compte ?
fy: Noch gjin akkount?
hi: अभी तक कोई खाता नहीं?
id: Belum punya akun?
kab: Mazal ur tesɛiḍ ara amiḍan?
ko: 계정이 없으신가요?
nl: Nog geen account?
pl: Nie masz konta?
sr: Немате налог?
sw: Hakuna akaunti bado?
ta: கணக்கு இல்லையா?
tr: Hesabınız yok mu?
uk: Немає облікового запису?
zh_hans: 还没有账户？

# no_accounts
source: There are no accounts to create.
ar: لا يوجد حسابات ليتم انشاءها.
ca: No hi ha comptes per crear.
de: Es gibt keine Konten zu erstellen.
eo: Mankas kreotaj kontoj.
es: No hay cuentas por crear.
fr: Il n'y a pas de compte à créer.
id: Tidak ada akun untuk dibuat.
kab: Ulac amiḍan ara yettwarnun.
ko: 만들 계정이 없습니다.
nl: Er zijn geen accounts om aan te maken.
pl: Nie ma więcej kont do stworzenia.
sr: Нема налога за креирање.
ta: உருவாக்க கணக்குகள் எதுவும் இல்லை.
tr: Oluşturulacak hesap bulunamadı.
uk: Немає облікових записів для створення.
zh_hans: 没有账户需要创建。

# no_adventures_yet
source: There are on public adventures matching these criteria. Try searching for something else.
ar: لا توجد مغامرات عامة موافقة لتصنيفاتك. حاول البحث عن شيء آخر.
ca: No hi ha aventures públiques que compleixen aquests criteris. Intenta cercar una altra cosa.
es: No hay aventuras públicas que coincidan con tu búsqueda. Intenta buscar otra cosa.
nl: Er zijn geen publieke avonturen die voldoen aan deze criteria. Probeer ergens anders op te zoeken.
sr: Пронађене су јавне авантуре које одговарају овим критеријумима. Покушајте да претражите нешто друго.
ta: இந்த அளவுகோல்களுடன் பொருந்தக்கூடிய பொது சாகசங்கள் உள்ளன. வேறு ஏதாவது தேட முயற்சிக்கவும்.
uk: Є публічні пригоди, що відповідають цим критеріям. Спробуйте пошукати щось інше.

# no_more_flat_if
source: Starting in level 8, the code after `{if}` needs to be placed on the next line and start with 4 spaces.
ar: بداية من المستوى 8، أي أوامر برمجية بعد '{if}' يجب أن تُكتب في السطر الذي بعده وأن تبدأ ب4 مساحات.
ca: A partir del nivell 8, el codi posterior a `{if}` s'ha de col·locar a la línia següent i començar amb 4 espais.
de: Ab Level 8 muss die Zeile nach `{if}` mit 4 Leerzeichen beginnen.
es: A partir del nivel 8, el código tras `{if}` tiene que ponerse en la siguiente línea y debe empezar con 4 espacios.
fr: À partir du niveau 8, le code après `{if}` doit être placé sur une nouvelle ligne commençant avec 4 espaces.
id: Mulai dari level 8, kode setelah `{if}` perlu ditempatkan pada baris berikutnya dan dimulai dengan 4 spasi.
ko: 레벨 8부터 {if} 뒤의 코드를 다음 줄에 배치하고 공백 4개로 시작해야 합니다.
nl: Vanaf level 8 moet de code na `{if}` op de volgende regel komen en beginnen met 4 spaties.
pl: Zaczynając od poziomu 8, linia po instrukcji `{if}` musi zaczynać się od 4 spacji.
sr: Почевши од нивоа 8, код након `{if}` треба да буде постављен у следећи ред и да почне са 4 размака.
ta: நிலை 8 இல் தொடங்கி, `{if}` அடுத்த வரியில் வைக்கப்பட வேண்டும் மற்றும் 4 இடைவெளிகளுடன் தொடங்க வேண்டும்.
tr: 8. seviyeden itibaren, `{if}`'den sonraki kodun bir sonraki satıra yerleştirilmesi ve satırın 4 boşlukla başlaması gerekir.
uk: Починаючи з рівня 8, код після `{if}` має бути розміщений у наступному рядку та починатися з 4 пробілів.
zh_hans: 从第 8 级开始，`{if}` 之后的代码需要放在下一行，并以 4 个空格开头。

# no_programs
source: There are no programs.
ar: ليست هناك أي برامج.
ca: No hi ha programes.
es: No hay programas.
kab: Ulac ihalan.
ko: 아직 프로그램이 없습니다.
nl: Er zijn geen programma's.
pl: Nie ma żadnych programów.
sr: Нема програма.
ta: திட்டங்கள் எதுவும் இல்லை.
uk: Програм немає.
zh_hans: 还没有程序.

# no_shared_programs
source: has no shared programs...
ar: ليس لديه برامج تم مشاركتها...
ca: No hi ha programes compartits...
de: hat keine geteilten Programme...
es: no tiene programas compartidos...
fr: n'a pas de programmes partagés...
hi: कोई साझा प्रोग्राम नहीं है ...
id: tidak memiliki program bersama...
kab: ulac ihalan i yettwabḍan...
ko: 공유 프로그램이 없습니다...
nl: heeft geen gedeelde programma's...
pl: nie ma udostępnionych programów...
sr: нема дељених програма...
ta: பகிரப்பட்ட திட்டங்கள் இல்லை ...
tr: paylaşılan programı yok...
uk: не має спільних програм...
zh_hans: 没有共享程序...

# no_students
source: There are no students in this class
ar: لا يوجد طلاب في هذا الصف
ca: No hi ha cap alumne a la classe
es: No hay alumnos en esta clase
kab: Ulac inelmaden deg usmil-a
pl: W tej klasie nie ma uczniów
sr: У овој класи нема ученика
ta: இந்த வகுப்பில் மாணவர்கள் யாரும் இல்லை
uk: У цьому класі немає учнів
zh_hans: 此班级还没有学生

# no_such_adventure
source: This adventure doesn't exist!
ar: هذه المغامرة غير موجودة!
bg: Това приключение не съществува!
ca: Aquesta aventura no existeix!
cs: Toto dobrodružství neexistuje!
de: Dieses Abenteuer existiert nicht!
eo: Aventuro ne ekzistas!
es: ¡Esta aventura no existe!
fr: Cette aventure n’existe pas !
id: Petualangan ini tidak ada!
kab: Tadyant-a ulac-itt!
ko: 이 모험은 존재하지 않아!
nl: Dit avontuur bestaat niet!
pl: Ta przygoda nie istnieje!
sr: Ова авантура не постоји!
ta: இந்த துணிவு இல்லை!
tr: Böyle bir macera bulunmuyor!
uk: Така пригода не існує!
zh_hans: 这个探险不存在！

# no_such_class
source: No such Hedy class.
ar: لا وجود لهذا الصف في هيدي
ca: Aquesta classe Hedy no existeix.
de: Keine solche Hedy-Klasse.
eo: Klaso ne ekzistas.
es: No se encontró esa clase de Hedy.
fr: Pas de classe Hedy correspondante.
hi: ऐसी कोई हेडी कक्षा नहीं!
id: Tidak ada kelas Hedy seperti itu.
kab: Ulac asmil-a deg Hedy.
ko: 그런 Hedy 수업은 없다.
nl: Deze klas bestaat niet.
pl: Nie istnieje taka klasa Hedy.
sr: Такво Hedy одељење не постоји.
ta: அத்தகைய எடி வகுப்பு இல்லை.
tr: Böyle bir Hedy sınıfı yok.
uk: Немає такого класу Hedy.
zh_hans: 这个班级不存在。

# no_such_level
source: No such Hedy level!
ar: لا يوجد هذا المستوى في هيدي!
bg: Няма такова ниво в Хеди!
ca: No existeix aquest nivell d'Hedy!
cs: Neexistující úroveň jazyka Hedy!
de: Dieses Level existiert nicht!
eo: Nivelo ne ekzistas!
es: ¡No se encontró este nivel de Hedy!
fr: Ce niveau n'existe pas !
hi: ऐसा कोई हेडी स्तर नहीं!
id: Tidak ada level Hedy seperti itu!
kab: Ulac aswir-a deg Hedy!
ko: 그런 Hedy급은 없어!
nl: Dit level bestaat niet!
pl: Nie ma takiego poziomu!
sr: Не постоји такав Hedy ниво!
ta: அத்தகைய எடி நிலை இல்லை!
tr: Böyle bir Hedy seviyesi yok!
uk: Такого рівня Хеди не існує!
zh_hans: 这个海蒂关卡不存在！

# no_such_program
source: No such Hedy program!
ar: لا يوجد هذا البرنامج في هيدي!
bg: Няма такава Хеди програма!
ca: Aquest programa Hedy no existeix!
cs: Neexistující program jazyka Hedy!
de: Dieses Hedy Programm gibt es nicht!
eo: Programo ne ekzistas!
es: ¡No se encontró el programa de Hedy!
fr: Pas de tel programme Hedy !
hi: ऐसा कोई हेडी प्रोग्राम नहीं!
id: Tidak ada program Hedy seperti itu!
kab: Ulac ahil-a deg Hedy!
ko: 그런 Hedy 프로그램은 없어!
nl: Dit programma bestaat niet!
pl: Nie ma takiego programu!
sr: Не постоји такав Hedy програм!
ta: அத்தகைய எடி திட்டம் இல்லை!
tr: Böyle bir Hedy programı yok!
uk: Немає такої програми Hedy!
zh_hans: 这个海蒂程序不存在！

# no_tag
source: No tag provided!
ar: لم يتم تقديم أي علامة
ca: No s'ha proporcionat cap etiqueta!
de: Kein Tag angegeben!
es: ¡Sin etiqueta!
id: Tidak ada tag yang disediakan!
kab: Ulac tabzimt i yettwamudden!
nl: Geen kenmerk (tag) gegeven!
pl: Nie podano znacznika!
sr: Ознака није дата!
ta: குறிச்சொல் எதுவும் வழங்கப்படவில்லை!
uk: Тег не надано!
zh_hans: 没有提供标签！

# no_usernames_found
source: No users were found
ar: لا يوجد أي مستخدمون
ta: பயனர்கள் எதுவும் கண்டுபிடிக்கப்படவில்லை
uk: Користувачів не знайдено

# not_adventure_yet
source: You must fill in an adventure name first
ar: يجب عليك أن تسجل اسم للمغامرة أولا
ca: Has d'omplir el nom d'aventura primer
es: Primero debes rellenar un nombre para la aventura
pl: Najpierw musisz wypełnić nazwę przygody
sr: Морате прво унети име авантуре
ta: நீங்கள் முதலில் ஒரு சாகச பெயரை நிரப்ப வேண்டும்
uk: Спочатку потрібно ввести назву пригоди
zh_hans: 您必须先填写冒险名称
