Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# echo_out
source: Starting in level 2 `{echo}` is no longer needed. You can repeat an answer with `{ask}` and `{print}` now. Example: `name {is} {ask} What are you called? {print} hello name`
ar: لم نعد بحاجة الى الأمر '{echo}' ابتداء من المستوى الثاني. يمكنك أن تكرر إجابة سؤال ما من خلال استخدام الأمر '{ask}' والأمر '{print}'. مثال: 'الاسم {is} {ask} ما اسمك؟ '{print}' مرحبا الاسم'
ca: A partir del nivell 2 `{echo}` ja no serà necessari. Ara pots repetir la resposta amb `{ask}` i {print}. Exemple: `nom {is} {ask} Com et dius? {print} Hola nom`
de: Ab Level 2 wird `{echo}` nicht mehr gebraucht. Du kannst jetzt eine Antwort mit `{ask}` und `{print}` wiedergeben. Beispiel: Name `{is}` `{ask}` Wie heißt Du? `{print}` Hallo Name
es: A partir del nivel 2, `{echo}` ya no es necesario. Ahora puedes repetir una respuesta con `{ask}` y `{print}`. Ejemplo: `nombre {is} {ask} ¿Cómo te llamas? {print} hola nombre`
id: Memulai di level 2 `{echo}` tidak diperlukan lagi. Anda dapat mengulang jawaban dengan `{ask}` dan `{print}` sekarang. Contoh: `nama {is} {ask} Kamu dipanggil apa? {print} halo nama`
ko: 더 이상 레벨 2 {echo}에서 시작할 필요가 없습니다. 이제 {ask}과(와) {print}(으)로 응답을 반복할 수 있습니다. 예: 이름은 {ask}입니다. 무엇이라고 부르십니까? {print} hello name
nl: Vanaf level 2 heb je geen `{echo}` meer nodig! Je kunt een variabele gebruiken om iets te herhalen, met `{ask}` en `{print}`. Voorbeeld: naam `{is}` `{ask}` Hoe heet jij? `{print}` hallo naam
pl: Od poziomu 2, `{echo}` nie jest potrzebne. Teraz możesz powtarzać odpowiedź za pomocą `{ask}` oraz `{print}`. Przykład: imię {is}{ask} Jak się nazywasz? {print} Cześć imię
sr: Почевши од нивоа 2 `{echo}` више није потребан. Можете поновити одговор са `{ask}` и `{print}` сада. Пример: `име {is} {ask} Како се зовеш? {print} здраво име`
ta: நிலை 2 `{echo}` இல் தொடங்கி இனி தேவையில்லை. `{ask}` மற்றும் `{print}` இப்போது ஒரு பதிலை மீண்டும் செய்யலாம். எடுத்துக்காட்டு: `பெயர் {is} {ask} நீங்கள் என்ன அழைக்கப்படுகிறீர்கள்? {print} அலோ பெயர்`
tr: 2. seviyeden itibaren, `{echo}` artık gerekli değildir. Şimdi bir cevabı `{ask}` ve `{print}` kullanarak tekrarlayabilirsiniz. Örnek: `isim {is} {ask} Senin adın ne? {print} merhaba isim`
uk: Починати з рівня 2 `{echo}` більше не потрібно. Тепер ви можете повторити відповідь за допомогою `{ask}` і `{print}`. Приклад: `name {is} {ask} Як тебе звати? {print} привіт ім'я`
zh_hans: 从第二级起，你不再需要`{echo}`。你可以用`{ask}`和`{print}`来复述答案。比如：名字 `{is}` `{ask}` 你叫什么？`{print}` 你好，名字

source: Edit adventure
ar: عدّل المغامرة
ca: Edita l'aventura
de: Abenteuer bearbeiten
es: Editar la aventura
kab: Ẓreg tadyant
nl: Aanpassen adventure
pl: Edytuj przygodę
sr: Уреди авантуру
ta: சாகசத்தைத் திருத்து
uk: Редагувати пригоди
zh_hans: 编辑冒险

# edit_code_button
source: Edit code
ar: تعديل البرنامج
bg: Промени кода
ca: Edita el codi
cs: Upravit kód
de: Programm ändern
eo: Redakti kodon
es: Editar código
fr: Modifier le code
fy: Koade oanpasse
hi: कोड को संपादित करें
id: Ubah kode
kab: Ẓreg tangalt
ko: 코드편집
nl: Pas de code aan
pl: Edytuj kod
sr: Уреди код
ta: குறியீட்டைத் திருத்து
tr: Kodu düzenle
uk: Редагувати код
zh_hans: 编辑代码

source: Email
ar: البريد الإلكتروني
bg: Имейл адрес
ca: Correu electrònic
eo: Retpoŝta adreso
es: Correo electrónico
hi: ईमेल
kab: Imayl
ko: 이메일
sr: Емаил
sw: Barua pepe
ta: மின்னஞ்சல்
tr: E-posta
uk: Електронна пошта
zh_hans: 电子邮件

# email_invalid
source: Please enter a valid email.
ar: الرجاء ادخال بريد الكتروني صحيح.
bg: Валиден имейл.
ca: Si us plau, introdueix un correu electrònic vàlid.
cs: Prosím zadej platný email.
de: Bitte eine gültige E-Mail-Adresse eingeben.
eo: Bonvolu tajpi validan retpoŝtan adreson.
es: Por favor ingresa una dirección de correo electrónico válida.
fr: Veuillez entrer une adresse mail valide.
fy: Folje inn jildich emailadres yn.
hi: कृपया एक मान्य ईमेल डालें|
id: Silakan masukkan email yang valid.
kab: Ttxil-k sekcem imayl ameɣtu.
ko: 올바른 이 메일을 입력하십시오.
nl: Vul een geldig e-mailadres in.
pl: Proszę podać poprawny adres email.
sr: Молимо унесите важећу емаил адресу.
sw: Tafadhali ingiza barua pepe halali.
ta: சரியான மின்னஞ்சலை உள்ளிடவும்.
tr: Lütfen geçerli bir e-posta girin.
uk: Введіть дійсну адресу електронної пошти.
zh_hans: 请输入一个有效的电子邮件。

# end_quiz
source: Quiz end
ca: Fi del qüestionari
de: Quiz-Ende
fr: Fin du questionnaire
id: Kuis berakhir
ko: 퀴즈 끝
nl: Einde van de quiz
pl: Koniec quizu
sr: Крај квиза
tr: Sınav sonu
uk: Кінець вікторини
zh_hans: 测验结束

source: English
ar: الانجليزية
ca: Anglès
de: Englisch
es: Inglés
fr: Anglais
id: Bahasa inggris
kab: Taglizit
ko: 영어
nl: Engels
pl: Angielski
sr: Енглески
ta: ஆங்கிலம்
tr: İngilizce
uk: англійська
zh_hans: 英语

# enter_password
source: Enter a new password for
ar: أدخل كلمة سر جديدة ل
ca: Introdueix una nova contrasenya per
de: Gib ein neues Passwort ein für
eo: Tajpu novan pasvorton por
es: Introduce una nueva contraseña para
fr: Entrer un nouveau mot de passe pour
hi: एक नया सांकेतिक शब्द दर्ज करें इस के लिए
id: Masukkan kata sandi baru untuk
kab: Sekcem awal n uɛeddi i
ko: 에 대한 새 암호를 입력합니다
nl: Vul een nieuw wachtwoord in voor
pl: Wprowadź nowe hasło dla
sr: Унесите нову лозинку за
ta: புதிய கடவுச்சொல்லை உள்ளிடவும்
tr: Şunun için yeni bir şifre girin
uk: Введіть новий пароль для
zh_hans: 输入新的密码

# enter_text
source: Enter your answer here...
ar: أدخل الإجابة هنا...
bg: Въведи отговора си тук...
ca: Introdueix la teva resposta aquí...
cs: Zde napiš svou odpověď...
de: Gib deine Antwort hier ein...
eo: Tajpu vian respondon ĉi tie…
es: Ingresar tu respuesta aquí...
fr: Saisissez votre réponse ici...
fy: Folje hjir dyn antwurd...
hi: msgstr अपना उत्तर यहाँ दर्ज करें
id: Tuliskan jawaban kamu disini...
kab: Sekcem tiririt-ik da...
ko: 여기에 답을 입력하세요...
nl: Vul hier je antwoord in...
pl: Wprowadź swoją odpowiedź tutaj...
sr: Унесите ваш одговор овде...
sw: Ingiza jibu lako hapa...
ta: உங்கள் பதிலை இங்கே உள்ளிடவும் ...
tr: Cevabınızı buraya girin...
uk: Введіть свою відповідь тут...
zh_hans: 在这儿输入你的答案。。。

# error_logo_alt
source: Error logo
ar: علامة خطأ برمجي
ca: Logotip d'error
de: Fehler Logo
eo: Emblemo pri eraro
es: Logo de error
fr: Erreur logo
id: Logo kesalahan
kab: Tuccḍa deg ulugu
ko: 에러로고
pl: Logo błędu
sr: Лого грешке
ta: பிழை லோகோ
tr: Hata logosu
uk: логотип помилки
zh_hans: 错误徽标

source: Errors
ar: أخطاء
es: Errores
kab: Tuccḍiwin
pl: Błędy
sr: Грешке
ta: பிழைகள்
uk: Помилки
zh_hans: 错误

# exclamation mark
source: an exclamation mark
ar: علامة تعجب
bg: удивителен знак
ca: un signe d'exclamació
cs: vykřičník
de: ein Ausrufezeichen
eo: krisigno
es: un signo de exclamación
fr: un point d'exclamation
fy: in útropteken
hi: एक विस्मयादिबोधक चिह्न
id: tanda seru
kab: agaz n ubhat
ko: 느낌표
nl: een uitroepteken
pl: wykrzyknik
sr: узвичник
sw: alama ya mshangao
ta: ஒரு ஆச்சரியக் குறி
tr: bir ünlem işareti
uk: знак оклику
zh_hans: 感叹号

source: Exercise
ca: Exercici
de: Übung
fr: Exercice
id: Latihan
ko: 연습문제
nl: Opdracht
pl: Ćwiczenie
sr: Вежба
tr: Alıştırma
uk: вправи
zh_hans: 练习

# exercise_doesnt_exist
source: This exercise doesn't exist
ca: Aquest exercici no existeix
de: Diese Übung existiert nicht
fr: Cet exercice n'existe pas
id: Latihan ini tidak ada
ko: 이 연습문제는 존재하지 않습니다
nl: Deze opdracht bestaat niet
pl: Nie można znaleźć tego ćwiczenia
sr: Ова вежба не постоји
tr: Bu alıştırma mevcut değil
uk: Цієї вправи не існує
zh_hans: 此练习不存在

# exists_email
source: That email is already in use.
ar: البريد الاإلكتروني هذا قيد الإستخدام بالفعل.
ca: Aquest correu electrònic ja està en ús.
cs: Tento email už někdo používá.
de: Diese Email-Adresse wird bereits verwendet.
es: Esa dirección de correo electrónico ya está en uso.
fr: Cette adresse mail est déjà utilisée.
fy: Dat emailadres wurd al brûkt.
hi: वह ईमेल पहले से ही उपयोग में है|
id: Email ini sudah terpakai untuk akun lain.
kab: Imayl-a yettwaseqdac yakan.
ko: 이 이메일은 이미 사용 중입니다.
nl: Dit emailadres is al in gebruik.
pl: Ten email jest już w użyciu.
sr: Тај имејл је већ у употреби.
sw: Barua pepe hiyo tayari inatumika.
ta: அந்த மின்னஞ்சல் ஏற்கனவே பயன்பாட்டில் உள்ளது.
tr: Bu e-posta zaten kullanılıyor.
uk: Ця електронна адреса вже використовується.
zh_hans: 此电子邮件已被使用。

# exists_username
source: That username is already in use.
ar: اسم المستخدم هذا قيد الإستخدام بالفعل.
ca: Aquest usuari ja està en ús.
cs: Toto uživatelské jméno už někdo používá.
de: Dieser Benutzername wird bereits verwendet.
es: Ese nombre de usuario ya está en uso.
fr: Ce pseudo est déjà utilisé.
fy: Dy brûkersnamme hat in oar al.
hi: वह उपयोगकर्तानाम पहले से ही उपयोग में है|
id: Username ini sudah terpakai untuk akun lain.
kab: Isem-a n useqdac yettwaseqdac yakan.
ko: 이미 사용중인 사용자 이름입니다.
nl: Deze gebruikersnaam is al in gebruik.
pl: Ta nazwa użytkownika jest już w użyciu.
sr: То корисничко име је већ у употреби.
sw: Jina hilo la mtumiaji tayari linatumika.
ta: அந்த பயனர்பெயர் ஏற்கனவே பயன்பாட்டில் உள்ளது.
tr: Bu kullanıcı adı zaten kullanılıyor.
uk: Це ім’я користувача вже використовується.
zh_hans: 此用户名已被使用。

source: Exit preview mode
ar: اخرج من وضع المعاينة
ca: Surt de la previsualització
de: Vorschaumodus verlassen
es: Salir del modo vista previa
kab: Ffeɣ seg uskar n uskan
nl: Stop preview modus
pl: Wyjdź z trybu podglądu
sr: Изађите из режима прегледа
ta: முன்னோட்ட பயன்முறையிலிருந்து வெளியேறவும்
uk: Вийти з режиму попереднього перегляду
zh_hans: 退出预览模式

# experience_invalid
source: Please select a valid experience, choose (Yes, No).
ar: الرجاء اختيار الخبرة بشكل صحيح (نعم ، لا).
ca: Si us plau, selecciona una experiència vàlida, escull (Sí, No).
de: Bitte wähle eine gültige Erfahrung, nutze (Ja, Nein).
es: Por favor, selecciona una experiencia válida. Escoge (sí, no).
fr: Sélectionnez une expérience valide, choisissez (Oui, Non).
hi: कृपया एक मान्य अनुभव चुनें, चुनें (हां, नहीं)
id: Silakan pilih pengalaman yang valid, pilih (Ya, Tidak).
kab: Ttxil-k fren tirmit tameɣtut, fren (Ih, Ala).
ko: 올바른 경험을 선택하고 (예, 아니오)를 선택하십시오.
nl: Dit is geen geldige programmeerervaring, kies uit (Ja, Nee).
pl: Proszę wybrać poprawne doświadczenie, wybierz (Tak, Nie).
sr: Молимо вас да изаберете важеће искуство, изаберите (Да, Не).
ta: சரியான பட்டறிவைத் தேர்ந்தெடு, தேர்வு (ஆம், இல்லை).
tr: Lütfen geçerli bir deneyim seçin, (Evet, Hayır) seçeneğini işaretleyin.
uk: Виберіть дійсний досвід, виберіть (Так, Ні).
zh_hans: 请选择有效的经验，选择（是，否）。

source: Expiration date
ar: تاريخ انتهاء الصلاحية
ca: Data de caducitat
de: Ablaufdatum
eo: Dato de eksvalidiĝo
es: Fecha de expiración
fr: Date d'expiration
id: Tanggal habis tempo
kab: Azemz n keffu
ko: 만료기한
nl: Vervaldatum
pl: Data wygaśnięcia
sr: Датум истека
ta: காலாவதி தேதி
tr: Son kullanma tarihi
uk: Термін придатності
zh_hans: 过期日期

source: Favorite program
ar: برنامجك المفضل
ca: Programa preferit
de: Lieblingsprogramm
es: Programa favorito
id: Program favorit
kab: Ahil asmenyaf
ko: 좋아하는 프로그램
nl: Favoriete programma
pl: Ulubiony program
sr: Омиљени програм
ta: பிடித்த நிரல்
tr: Favori program
uk: Улюблена програма
zh_hans: 最喜欢的项目

# favourite_confirm
source: Are you sure you want to set this program as your favourite?
ar: هل أنت متأكد أنك تريد تحديد هذا البرنامج كبرنامج المفضل؟
ca: Segur que vols definir aquest programa com el teu preferit?
de: Bist du dir sicher, dieses Programm als Lieblingsprogramm einzustellen?
es: ¿Estás seguro de que quieres marcar este programa como favorito?
fr: Êtes-vous sûr de vouloir définir ce programme comme favori ?
hi: क्या आप वाकई इस प्रोग्राम को अपने पसंदीदा के रूप में सेट करना चाहते हैं?
id: Apakah Anda yakin ingin menjadikan program ini sebagai favorit Anda?
kab: D tidet tebɣiḍ ad tesbaduḍ ahil-a d asmenyaf-ik?
ko: 이 프로그램을 좋아하는 프로그램으로 설정하시겠습니까?
nl: Weet je zeker dat je dit programma wilt instellen als favoriet?
pl: Czy jesteś pewien, że chcesz ustawić ten program jako ulubiony?
sr: Да ли сте сигурни да желите да поставите овај програм као омиљени?
ta: இந்த திட்டத்தை உங்களுக்கு பிடித்ததாக அமைக்க விரும்புகிறீர்களா?
tr: Bu programı favori programınız olarak ayarlamak istediğinizden emin misiniz?
uk: Ви впевнені, що хочете встановити цю програму як свою улюблену?
zh_hans: 你确定要将此程序设置为你最喜爱的程序吗？

source: Favourite program
ar: البرامج المفضلة
ca: Programa preferit
de: Lieblingsprogramm
es: Programa favorito
fr: Programme favori
hi: पसंदीदा प्रोग्राम
id: Program favorit
kab: Ahil asmenyaf
ko: 좋아하는 프로그램
nl: Favoriete programma
pl: Ulubiony program
sr: Омиљени програм
ta: பிடித்த நிரல்
tr: Favori program
uk: Улюблена програма
zh_hans: 最喜欢的程序

# favourite_program_invalid
source: Your chosen favourite program is invalid.
ar: البرنامج المفضل الذي اخترته غير صالح.
ca: El programa preferit que has escollit és invàlid.
de: Dein gewähltes Lieblingsprogramm ist ungültig.
es: Tu programa favorito es inválido.
fr: Le programme favori que vous avez choisi n'est pas valide.
hi: आपका पसंदीदा प्रोग्राम अमान्य है
id: Program favorit yang Anda pilih tidak valid.
kab: Ahil asmenyaf i tferneḍ d arameɣtu.
ko: 선택한 즐겨찾기 프로그램이 잘못되었습니다.
nl: Jouw gekozen favoriete programma is ongeldig.
pl: Twój wybrany ulubiony program jest niewłaściwy.
sr: Ваш омиљени програм је неважећи.
ta: நீங்கள் தேர்ந்தெடுத்த பிடித்த நிரல் தவறானது.
tr: Seçtiğiniz favori program geçersiz.
uk: Обрана вами улюблена програма недійсна.
zh_hans: 你选择的最喜欢的程序是无效的。

# favourite_success
source: Your program is set as favourite.
ar: تم ضبط البرنامج كمفضل.
ca: El teu programa està configurat com a preferit.
de: Dein Programm wurde als Favorit gesetzt.
es: Tu programa se ha marcado como favorito.
fr: Programme mis en favori.
hi: आपका प्रोग्राम पसंदीदा के रूप में सेट है
id: Program Anda ditetapkan sebagai favorit.
kab: Ahil-ik yettusbadu d asmenyaf.
ko: 프로그램이 즐겨찾기로 설정되어 있습니다.
nl: Je programma is ingesteld als favoriet.
pl: Program został ustawiony jako ulubiony.
sr: Ваш програм је постављен као омиљен.
ta: உங்கள் நிரல் பிடித்ததாக அமைக்கப்பட்டுள்ளது.
tr: Programınız favori olarak ayarlanmıştır.
uk: Ваша програма встановлена як улюблена.
zh_hans: 你的程序被设定为最喜欢的程序。

# feedback_message_error
source: Something went wrong, please try again later.
ar: حصل خلل ما، رجاء حاول فيما بعد.
ca: Alguna cosa ha sortit malament, prova-ho més tard.
es: Algo salió mal, inténtalo de nuevo más tarde.
kab: Yella wayen ur nteddu ara, ttxil-k ɛreḍ ticki.
pl: Coś poszło nie tak, spróbuj ponownie później.
sr: Нешто је пошло наопако, молимо покушајте поново касније.
ta: ஏதோ தவறு நடந்தது, தயவுசெய்து பின்னர் மீண்டும் முயற்சிக்கவும்.
uk: Щось пішло не так, спробуйте пізніше.
zh_hans: 发生错误。请稍后再试。

source: Female
ar: بنت / أنثى
bg: Женски
ca: Dona
cs: Žena
de: weiblich
eo: Ina
es: Femenino
fr: Femme
fy: Famke
hi: महिला
id: Perempuan
ko: 여자
nl: Meisje
pl: Żeńska
sr: Женски
sw: Mwanamke
ta: பெண்
tr: Kadın
uk: Жінка
zh_hans: 女

# flag_adventure_prompt
source: Do you want to flag this adventure so that we check its appropriateness?
ar: هل ترغب في وضع علامة على هذه المغامرة لنتحقق أنها ملائمة؟
ca: Vols marcar aquesta aventura per a què comprovem la seva idoneïtat?
es: ¿Quieres marcar esta aventura para que podamos comprobar su idoneidad?
pl: Czy chcesz oznaczyć tę przygodę, abyśmy sprawdzili czy jest ona odpowiednia?
sr: Да ли желите да означите ову авантуру како бисмо проверили њену прикладност?
ta: இந்த சாகசத்தை நீங்கள் கொடியிட விரும்புகிறீர்களா?
uk: Хочете позначити цю пригоду, щоб ми перевірили її відповідність?
zh_hans: 您是否想标记此冒险以便我们检查其是否合适？

# float
source: a number
ar: رقم
ca: un número
de: eine gebrochene Zahl
eo: nombro
es: un número
fr: un nombre
hi: एक संख्या
id: sebuah angka
kab: aṭṭun
ko: 수
nl: een getal
pl: liczba
sr: број
ta: ஒரு எண்
tr: bir sayı
uk: число
zh_hans: 数字

source: For teachers
ar: للمعلمين
ca: Per al professorat
de: Für LehrerInnen
eo: Por instruistoj
es: Para profesores
fr: Pour les enseignants
hi: शिक्षकों के लिए
id: Untuk guru
kab: I yiselmaden
ko: 선생님용
nl: Voor leraren
pl: Dla nauczycieli
sr: За наставнике
ta: ஆசிரியர்களுக்கு
tr: Öğretmenler için
uk: Для вчителів
zh_hans: 教师专用

# forgot_password
source: Forgot your password?
ar: هل نسيت كلمة المرور؟
ca: Has oblidat la contrasenya?
cs: Zapomněl*a jsi heslo?
de: Passwort vergessen?
eo: Ĉu vi forgesis vian pasvorton?
es: ¿Olvidaste tu contraseña?
fr: Mot de passe oublié ?
fy: Bist dyn wachtwurd fergetten?
hi: आपका सांकेतिक शब्द भूल गए?
id: Lupa passowrd kamu?
kab: Tettuḍ awal-ik n uɛeddi?
ko: 비밀번호를 잊어버렸나요?
nl: Wachtwoord vergeten?
pl: Zapomniałeś hasła?
sr: Заборавили сте лозинку?
sw: Umesahau nenosiri yako?
ta: உங்கள் கடவுச்சொல்லை மறந்துவிட்டீர்களா?
tr: Şifrenizi mi unuttunuz?
uk: Забули пароль?
zh_hans: 忘记密码了吗？

source: From another teacher
ar: من معلم آخر
ca: D'un altre professor
de: Von einer anderen Lehrperson
es: De otro profesor
fr: D'un(e) autre professeur
id: Dari guru lain
kab: Sɣur uselmad niḍen
ko: 다른 선생님으로부터
nl: Van een andere leraar
pl: Od innego nauczyciela
sr: Од другог наставника
ta: மற்றொரு ஆசிரியரிடமிருந்து
tr: Başka bir öğretmenden
uk: Від іншої вчительки
zh_hans: 来自另一位老师

# from_magazine_website
source: From a magazine or website
ar: من مجلة أو موقع
ca: Des d'una revista o web
de: Von einer Zeitschrift oder Webseite
es: De una revista o página web
fr: D'un magazine ou d'un site internet
id: Dari majalah atau situs web
ko: 잡지나 웹사이트에서
nl: Van een tijdschrift of website
pl: Z gazety lub strony internetowej
sr: Из часописа или вебсајта
ta: ஒரு செய்தித் தாள் அல்லது வலைத்தளத்திலிருந்து
tr: Bir dergiden veya web sitesinden
uk: З журналу чи сайту
zh_hans: 来自杂志或网站

# from_video
source: From a video
ar: من مقطع فيديو
ca: Des d'un vídeo
de: Von einem Video
es: De un vídeo
fr: D'une vidéo
id: Dari sebuah video
kab: Seg tvidyut
ko: 비디오에서
nl: Van een video
pl: Z filmiku
sr: Из видеа
ta: ஒரு வீடியோவிலிருந்து
tr: Bir videodan
uk: З відео
zh_hans: 来自于视频

# fun_statistics_msg
source: Here are some fun statistics!
ca: Aquí teniu algunes estadístiques divertides!
de: Hier sind ein paar spaßige Statistiken!
fr: Voici quelques statistiques amusantes !
id: Berikut beberapa statistik menyenangkan!
ko: 여기에는 재미있는 통계들이 있습니다!
nl: Hier zijn wat leuke getallen!
pl: Trochę ciekawych statystyk!
sr: Ево неких забавних статистика!
tr: İşte bazı eğlenceli istatistikler!
uk: Ось трохи цікавої статистики!
zh_hans: 这儿有一些有趣的统计数据!

source: Gender
ar: الجنس
bg: Пол
ca: Gènere
cs: Pohlaví
de: Geschlecht
eo: Sekso
es: Género
fr: Genre
fy: Geslacht
hi: लिंग
id: Jenis kelamin
ko: 성별
nl: Geslacht
pl: Płeć
sr: Пол
sw: Jinsia
ta: பாலினம்
tr: Cinsiyet
uk: Стать
zh_hans: 性别

# gender_invalid
source: Please select a valid gender, choose (Female, Male, Other).
ar: الرجاء تحديد جنس صالح واختيار (أنثى ، ذكر ، أخرى).
ca: Si us plau, selecciona un gènere vàlid, tria (Dona, Home o Altre).
de: Bitte wähle ein gültiges Geschlecht, wähle (weiblich, männlich, divers).
eo: Bonvolu elekti validan sekson, unu el «Ina», «Vira», «Alia».
es: Por favor, selecciona un género válido. Escoge (mujer, hombre, otro).
fr: Veuillez sélectionner un genre valide, choisissez (Féminin, Masculin, Autre).
hi: कृपया एक मान्य लिंग चुनें, चुनें (महिला, पुरुष, अन्य)
id: Silakan pilih jenis kelamin yang valid, pilih (Wanita, Pria, Lainnya).
ko: 올바른 성별을 선택하고 (여성, 남성, 기타)를 선택하십시오.
nl: Dit gender is niet geldig, kies uit (Meisje, Jongen, Anders).
pl: Proszę wybrać poprawną płeć, wybierz (Żeńska, Męska, Inna).
sr: Молимо вас да изаберете важећи пол, изаберите (Женски, Мушки, Други).
ta: தயவுசெய்து செல்லுபடியாகும் பாலினத்தைத் தேர்ந்தெடுக்கவும், தேர்வு செய்யவும் (பெண், ஆண், மற்றவை).
tr: Lütfen geçerli bir cinsiyet seçin (Kadın, Erkek, Diğer).
uk: Будь ласка, виберіть дійсну стать, виберіть (Жінка, Чоловічий, Інше).
zh_hans: 请选择有效的性别，选择（女性、男性、其他）。

source: General settings
ar: اعدادات عامة
ca: Configuració general
de: Allgemeine Einstellungen
eo: Ĝeneralaj agordoj
es: Configuración general
fr: Configurations générales
hi: सामान्य सेटिंग्स
id: Pengaturan Umum
kab: Iɣewwaren imuta
ko: 일반설정
nl: Algemene instellingen
pl: Ustawienia ogólne
sr: Општа подешавања
ta: பொது அமைப்புகள்
tr: Genel ayarlar
uk: Загальні налаштування
zh_hans: 常规设置

# get_certificate
source: Get your certificate!
ca: Aconsegueix el teu certificat!
de: Hol dir dein Zertifikat!
fr: Obtenez votre certificat !
id: Dapatkan sertifikat Anda!
ko: 자격증을 따세요!
nl: Haal jouw certificaat!
pl: Otrzymaj certyfikat!
sr: Узми свој сертификат!
tr: Sertifikanızı alın!
uk: Отримай сертифікат!
zh_hans: 获取你的证书!

# give_link_to_teacher
source: Give the following link to your teacher:
ar: أعطِ هذا الرابط إلى معلمك:
ca: Fes arribar el següent enllaç al teu professor:
de: Gib den folgenden Link an deine Lehrerin oder deinen Lehrer weiter:
es: Dale a tu profesor el siguiente enlace:
fr: Donnez le lien suivant à l'enseignant(e) :
id: Berikan tautan berikut kepada guru Anda:
kab: Mudd-as aseɣwen-a i uselmad-ik:
ko: 선생님께 다음 링크를 드립니다:
nl: Geef de volgende link aan je leraar:
pl: Podaj ten link swojemu nauczycielowi:
sr: Дај следећу везу свом наставнику:
ta: உங்கள் ஆசிரியருக்கு பின்வரும் இணைப்பைக் கொடுங்கள்:
tr: Aşağıdaki bağlantıyı öğretmeninize verin:
uk: Дайте наступне посилання своєму вчителю:
zh_hans: 将以下链接提供给你的老师：

source: Go back
ar: للرجوع
ca: Ves enrere
es: Regresar
kab: Uɣal
nl: Ga terug
pl: Powróć
sr: Врати се назад
ta: திரும்பிச் செல்லுங்கள்
uk: Іди назад
zh_hans: 返回

# go_back_to_main
source: Go back to main page
ar: الرجوع الى الصفحة الرئيسية
ca: Torna a la pàgina principal
de: Zurück zur Hauptseite
eo: Reen al ĉefpaĝo
es: Volver a la página principal
fr: Retourner à la page principale
hi: मुख्य पृष्ठ पर वापस जाएं
id: Kembali ke halaman utama
kab: Uɣal ɣer usebter agejdan
ko: 메인 페이지로 돌아가기
nl: Ga terug naar de hoofdpagina
pl: Powróć do strony głównej
sr: Врати се на главну страницу
ta: முதன்மையான பக்கத்திற்குச் செல்லவும்
tr: Ana sayfaya geri dön
uk: Повернутися на головну сторінку
zh_hans: 返回主页

source: Go to question
ca: Ves a la pregunta
de: Gehe zur Frage
fr: Aller à la question
id: Pergi ke pertanyaan
ko: 다음 질문
nl: Ga naar vraag
pl: Przejdź do pytania
sr: Иди на питање
tr: Soruya git
uk: Перейти до запитання
zh_hans: 转到问题

source: Go to quiz result
ca: Ves al resultat del qüestionari
de: Gehe zum Quiz-Ergebnis
fr: Aller au résultat du questionnaire
id: Pergi ke hasil kuis
ko: 퀴즈 결과로 이동
nl: Ga naar de resultaten van de quiz
pl: Przejdź do wyników quizu
sr: Иди на резултат квиза
tr: Kısa sınav sonucuna git
uk: Перейти до результатів тесту
zh_hans: 转到测验结果

source: Go to your clone
ar: اذهب إلى النسخة
ca: Ves a la teva clonació
es: Ir a tu clon
nl: Ga naar je kloon
sr: Идите до вашег клона
ta: உங்கள் குளோனுக்குச் செல்லுங்கள்
uk: Йди до свого клону

# goto_profile
source: Go to my profile
ar: الذهاب الى ملفي الشخصي
ca: Ves al meu perfil
de: Mein Profil
eo: Al mia profilo
es: Ir a mi perfil
fr: Aller à mon profile
fy: Nei myn profyl
hi: मेरी प्रोफ़ाइल पर जाएँ
id: Ke profil saya
kab: Ddu ɣer umaɣnu
ko: 내 프로필로 이동
nl: Ga naar mijn profiel
pl: Przejdź do mój profil
sr: Иди на мој профил
ta: எனது சுயவிவரத்திற்குச் செல்லுங்கள்
tr: Profilime git
uk: Перейти до мого профілю
zh_hans: 转到我的个人资料

# graph_title
source: Errors per adventure completed on level {level}
ar: عدد الأخطاء حسب كل مستوى تم الانتهاء منه {level}
ca: Errors per aventura completada al nivell {level}
es: Errores por aventura completada en el nivel {level}
pl: Błędy na ukończone przygody na poziomie {level}
sr: Грешке по завршеној авантури на нивоу {level}
ta: ஒரு சாகசத்திற்கான பிழைகள் நிலை {level} இல் முடிக்கப்பட்டன
uk: Помилки в кожній пригоді, завершеній на рівні {level}
zh_hans: 在 {level} 级别完成的每次冒险的错误数

source: Hand in
ar: سَلِّم
ca: Entrega
de: Abgeben
es: Entregar
fr: Rendre
id: Menyerahkan
kab: Err
ko: 제출하다
nl: Inleveren
pl: Oddaj
sr: Предај
ta: கை
tr: Teslim et
uk: Здати
zh_hans: 上交

source: Hand in exercise
ar: سَلِّم التدريب
ca: Entrega l'exercici
de: Lösung abgeben
es: Ejercicio manual
fr: Rendre l'exercice
id: Latihan tangan
kab: Err alaɣmu
ko: 핸드 인 운동
nl: Opdracht inleveren
pl: Oddaj ćwiczenie
sr: Предај вежбу
ta: உடற்பயிற்சியில் கை
tr: Alıştırmayı teslim et
uk: Рука в вправі
zh_hans: 上交练习册
