Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# Non Decimal Variable
source: We detected that at line {line_number} you used a number Hedy does not support! Can you try a decimal number, like 2?
ar: لقد اكتشفنا أنك استخدمت في السطر رقم {line_number}، رقما لا تدعمه هيدي! هل بإمكانك محاولة استخدام رقم عشري مثل 0.2؟
ca: A la línia {line_number}, has utilitzat un número que a Hedy no funciona! Pots provar de canviar-lo a un nombre decimal, com el 2?
es: ¡Detectamos que en la línea {line_number} que utilizó un número Hedy no soporta! ¿Puede intentar un número decimal, como 2?
pl: Wykryliśmy, że w wierszu {line_number} użyłeś numeru, którego Hedy nie obsługuje! Czy możesz wypróbować liczbę dziesiętną, na przykład 2?
sr: Открили смо да на линији {line_number} користите број који Hedy не подржава! Можете ли покушати са децималним бројем, као што је 2?
ta: {line_number} என்ற வரியில் நீங்கள் ஒரு எண் பயன்படுத்தப்பட்டது எடி ஆதரிக்கவில்லை என்பதை நாங்கள் கண்டறிந்தோம்! 2 போன்ற தசம எண்ணை முயற்சிக்க முடியுமா?
tr: `{line_number}` numaralı satırda, Hedy'nin desteklemediği bir sayı kullandığınızı tespit ettik! Bir ondalıklı sayı kullanmayı deneyebilir misiniz?
uk: Ми виявили, що в рядку {line_number} ви використали номер, який Hedy не підтримує! Чи можете ви спробувати десяткове число, наприклад 2?
zh_hans: 我们检测到您在第 {line_number} 行使用了 Hedy 不支持的数字！可以尝试使用十进制数，例如 2 吗？

# Parse
source: We detected that `{character_found}` is being used on line {location[0]} which is not allowed. Can you try looking for a missing or an extra character on your code?
ar: لقد اكتشفنا أنك استخدمت {character_found} في السطر {location[0]}، وهذا غير مسموح. هل بإمكانك البحث عن حرف ناقص أو زائد في برنامجك؟
ca: Hem detectat que `{character_found}` s'està utilitzant a la línia {location[0]} que no està permès. Pots buscar quin caràcter falta o quin caràcter addicional hi ha al teu codi?
es: Detectamos que `{character_found}`se está utilizando en la línea {location[0]} que no está permitida. ¿Puedes intentar buscar un carácter extra o que falta en tu código?
fr: Le code que vous avez entré n'est pas un code Hedy valide. Il y a une erreur sur la ligne {location[0]}, à la position {location[1]}. Vous avez tapé `{character_found}`, mais ce n'est pas permis.
fy: De koade dysto skreaun hast is gjin jildige Hedy-koade. Der sit in flater op rigel {location[0]}. Do hast `{character_found}` typt, mar dat mei op dy plak net?
id: Kode yang kamu masukan bukan kode Hedy yang valid. Ada kesalahan pada baris {location[0]}, pada posisi {location[1]}. Kamu menuliskan `{character_found}`, tapi itu tidak diperbolehkan.
ko: 입력한 코드가 올바른 Hedy 코드가 아닙니다. {location[1]} 위치의 {location[0]} 행에 오류가 있습니다. {character_found}을(를) 입력했지만 이 코드는 허용되지 않습니다.
pl: Wykryliśmy, że {character_found} jest używany w linii {location[0]}, co jest niedozwolone. Czy możesz spróbować znaleźć brakujący lub dodatkowy znak w swoim kodzie?
sr: Открили смо да се `{character_found}` користи на линији {location[0]} што није дозвољено. Можете ли покушати да пронађете недостајући или вишак карактера у вашем коду?
ta: அனுமதிக்கப்படாத {location[0]} வரி இல் `{character_found}` பயன்படுத்தப்படுவதை நாங்கள் கண்டறிந்தோம். உங்கள் குறியீட்டில் காணாமல் போன அல்லது கூடுதல் எழுத்தைத் தேட முயற்சிக்கலாமா?
tr: `{location[0]}` numaralı satırda bir "`{character_found}`" karakterinin kullanıldığını tespit ettik, ama buna izin verilmez. Kodunuzda eksik veya fazlalık bir karakter aramayı deneyebilir misiniz?
uk: Ми виявили, що `{character_found}` використовується в рядку {location[0]}, що заборонено. Чи можете ви спробувати знайти відсутній або зайвий символ у своєму коді?
zh_hans: 我们检测到`{character_found}`在行 {location[0]} 上使用，这是不允许的。可以尝试在代码中查找缺失或多余的字符吗？

# Pressit Missing Else
source: We detected that the code is missing an `{else}` to handle other key presses. Can you try adding an `{else}` to your code?
ar: لقد اكتشفنا أن البرنامج يفتقد الأمر البرمجي {else} لكي يعالج ضغطات زر أخرى. هل بإمكانك إضافة {else} إلى برنامجك؟
ca: Hem detectat que al codi li falta un `{else}` per gestionar altres pulsacions de tecles. Pots provar d'afegir un `{else}` al teu codi?
es: Detectamos que el código carece de un {else}`para manejar otras pulsaciones de teclas. ¿Puede intentar agregar un ‘{else}`a su código?
fr: Tu as oublié d'ajouter ce qu'il se passe si tu presses une touche différente, ajouter un `{else}` à ton code
id: Anda lupa menambahkan apa yang terjadi bila Anda menekan tombol lain, tambahkan `{else}` ke kode Anda
ko: 다른 키를 누를 때 발생하는 작업을 코드에 {else}을(를) 추가하지 않았습니다
pl: Wykryliśmy, że w kodzie brakuje {else} do obsługi innych naciśnięć klawiszy. Czy możesz spróbować dodać {else} do swojego kodu?
sr: Открили смо да коду недостаје `{else}` за обраду других притисака тастера. Можете ли покушати да додате `{else}` у свој код?
ta: பிற முக்கிய அச்சகங்களைக் கையாள குறியீடு `{else}` காணவில்லை என்பதை நாங்கள் கண்டறிந்தோம். உங்கள் குறியீட்டில் `{else}` சேர்க்க முயற்சிக்கலாமா?
tr: Kodunuzda, diğer tuşlara basıldığında ne olacağını belirleyecek eksik bir "`{else}`" olduğunu tespit ettik. Kodunuza bir `{else}` eklemeyi deneyebilir misiniz?
uk: Ми виявили, що в коді відсутній `{else}` для обробки інших натискань клавіш. Чи можете ви спробувати додати `{else}` до свого коду?
zh_hans: 我们发现代码缺少 `{else}` 来处理其他按键。可以尝试在代码中添加 `{else}` 吗？

# Runtime Index Error
source: We detected that the list {name} is empty or its index is missing. Can you make sure that the list is not empty or try writing a number inside the `[]` for the missing index?
ar: لقد اكتشفنا أن القائمة {name} خالية أو أن مؤشرها مفقود. هل يمكنك التأكد أن القائمة ليست فارغة؟ أو هل بإمكانك محاولة كتابة رقم داخل العلامتين `[]` لتعويض المؤشر المفقود؟
ca: Hem detectat que la llista {name} està buida o li falta l'índex. Pots assegurar-te que la llista no estigui buida o provar d'escriure un número dins de `[]` per l'índex que falta?
es: Detectamos que la lista {name} está vacía o su índice está ausente. ¿Puede asegurarse de que la lista no esté vacía o intentar escribir un número dentro del `[]' para el índice que falta?
fr: Tu as essayé d'accéder à la liste {name} mais celle-ci est vide ou sans index.
id: Anda mencoba mengakses daftar {name} tetapi daftar itu kosong atau indeksnya tidak ada.
pl: Wykryliśmy, że lista {name} jest pusta lub brakuje jej indeksu. Czy możesz upewnić się, że lista nie jest pusta, lub spróbować zapisać numer w `[]` dla brakującego indeksu?
sr: Открили смо да је листа {name} празна или да недостаје индекс. Можете ли се уверити да листа није празна или покушати да напишете број унутар `[]` за недостајући индекс?
ta: பட்டியல் {name} காலியாக இருப்பதைக் கண்டறிந்தோம் அல்லது அதன் குறியீடு இல்லை. பட்டியல் காலியாக இல்லை என்பதை உறுதிப்படுத்த முடியுமா அல்லது காணாமல் போன குறியீட்டிற்கு `[]` க்குள் ஒரு எண்ணை எழுத முயற்சிக்கிறீர்களா?
tr: "`{name}`" listesi boş ya da indeksinin eksik olduğunu tespit ettik. Lütfen listenin boş olmadığından emin olun veya eksik indeks için "`[ ]`" içine bir sayı yazmayı deneyin?
uk: Ми виявили, що список {name} порожній або його індекс відсутній. Чи можете ви переконатися, що список не порожній, або спробувати ввести число всередині «[]» для відсутнього індексу?
zh_hans: 我们检测到列表 {name} 为空或其索引缺失。能确保列表不为空吗？或者尝试在 `[]` 中写入一个数字作为缺失的索引？

# Runtime Value Error
source: We detected that `{command}` received disallowed value `{value}`. {tip}.
ar: {tip}: لقد اكتشفنا أن الأمر البرمجي {command} لا يسمح بالقيمة {value}.
ca: Hem detectat que `{command}` ha rebut un valor no permès: `{value}`. {tip}.
es: Detectamos que `{command}` recibió valor no permitido `{value}`. {tip}.
pl: Wykryliśmy, że `{command}` otrzymało niedozwoloną wartość `{value}`. {tip}.
sr: Открили смо да је `{command}` примио недозвољену вредност `{value}`. {tip}.
ta: `{command}` அனுமதிக்கப்படாத மதிப்பு `{value}` பெறப்பட்டது என்று நாங்கள் கண்டறிந்தோம். {tip}.
tr: "`{command}`" komutunun izin verilmeyen bir "`{value}`" değerini aldığını tespit ettik. {tip}.
uk: Ми виявили, що `{command}` отримала заборонене значення `{value}`. {tip}.
zh_hans: 在运行程序时，命令`{command}`收到了不允许的值{value}。{tip}。

# Runtime Values Error
source: We detected that `{command}` received disallowed values `{value}` and `{value}`. {tip}.
ar: لقد اكتشفنا أن الأمر البرمجي {command} لا يسمح بالقيمتين {value} و {value}. ملاحظة مساعدة: {tip}.
ca: Hem detectat que `{command}` ha rebut valors no permesos: `{value}` i `{value}`. {tip}.
es: Detectamos que el `{command}` recibió valores no permitidos `{value}`y `{value}`. {tip}.
fr: While running your program the command `{command}` received the values `{value}` and `{value}` which are not allowed. {tip}.
id: While running your program the command `{command}` received the values `{value}` and `{value}` which are not allowed. {tip}.
pl: Wykryliśmy, że `{command}`otrzymało niedozwolone wartości`{value}` i `{value}`. {tip}.
sr: Открили смо да је `{command}` примио недозвољене вредности `{value}` и `{value}`. {tip}.
ta: `{command}` அனுமதிக்கப்படாத மதிப்புகள் `{value}` மற்றும் `{value}` பெறப்பட்டதைக் கண்டறிந்தோம். {tip}.
tr: "`{command}`" komutunun izin verilmeyen "`{value}`" ve "`{value}`" değerlerini aldığını tespit ettik. {tip}.
uk: Ми виявили, що `{command}` отримала заборонені значення `{value}` і `{value}`. {tip}.
zh_hans: 我们检测到 `{command}` 收到了不允许的值 `{value}` 和 `{value}`。{tip}。

source: Save Microbit code
bg: Изтегли код за Микробит
ca: Desa codi Microbit
es: Guardar código Microbit
pl: Zapisz kod Microbit
sr: Сачувај Microbit код
ta: நுண்ணுயிர் குறியீட்டை சேமிக்கவும்
tr: Microbit kodunu kaydet
uk: Збережіть код Microbit
zh_hans: 保存 Microbit 代码

# Too Big
source: We detected that the program has {lines_of_code} lines, but we can only process {max_lines} lines. Can you try to shorten your program?
ar: لقد اكتشفنا أن برنامجك يحتوي على {lines_of_code} سطر، لكن بإمكاننا معالجة {max_lines} سطر فقط. هل بإمكانك تقليل برنامجك؟
ca: Hem detectat que el programa té {lines_of_code} línies, però només podem processar {max_lines} línies. Pots provar d'escurçar el teu programa?
es: Detectamos que el programa tiene {lines_of_code} líneas, pero solo podemos procesar {max_lines} líneas. ¿Puede intentar acortar su programa?
fr: Waouh ! Ton programme a un nombre impressionnant de lignes de code : {lines_of_code} lignes ! Mais Hedy ne peut traiter que {max_lines} lignes à ce niveau. Rends ton programme plus court et ressaie.
id: Wow! Program Anda memiliki {lines_of_code} baris kode yang mengesankan! Namun kami hanya dapat memproses {max_lines} baris di level ini. Buat program Anda lebih kecil dan coba lagi.
ko: 와우! 당신의 프로그램은 인상적인 {lines_of_code}개의 코드 라인을 가지고 있습니다! 하지만 우리는 이 레벨에서 {max_lines}개의 라인만 처리할 수 있습니다. 당신의 프로그램을 더 작게 만들고 다시 시도해보세요.
pl: Wykryliśmy, że program ma linie {lines_of_code}, ale możemy przetwarzać tylko linie {max_lines} Czy możesz spróbować skrócić swój program?
sr: Открили смо да програм има {lines_of_code} линија, али можемо обрадити само {max_lines} линија. Можете ли покушати да скратите свој програм?
ta: நிரலில் {lines_of_code} கோடுகள் இருப்பதை நாங்கள் கண்டறிந்தோம், ஆனால் {max_lines} வரிகளை மட்டுமே செயலாக்க முடியும். உங்கள் நிரலை குறைக்க முயற்சிக்கலாமா?
tr: Bu programın `{lines_of_code}` satırdan oluştuğunu tespit ettik, ancak sadece `{max_lines}` kadar satır işleyebiliyoruz. Programınızı kısaltmayı deneyebilir misiniz?
uk: Ми виявили, що програма містить {lines_of_code} рядків, але ми можемо обробити лише {max_lines} рядків. Чи можете ви спробувати скоротити свою програму?
zh_hans: 我们检测到程序有 {lines_of_code} 行，但我们只能处理 {max_lines} 行。可以尝试缩短您的程序吗？

# Too Few Indents
source: We detected that line {line_number} has too few ({leading_spaces}) spaces. Can you try to add an extra space?
ar: لقد اكتشفنا أن السطر {line_number} لديه {leading_spaces} غير كافية. هل بإمكانك إضافة مسافة بداءة إضافية؟
ca: Hem detectat que la línia {line_number} té massa pocs ({leading_spaces}) espais. Pots provar d'afegir un espai extra?
es: Detectamos que la línea {line_number} tiene demasiados espacios ({leading_spaces}). ¿Puedes intentar agregar un espacio extra?
pl: Wykryliśmy, że linia {line_number} ma zbyt mało spacji ({leading_spaces}). Czy możesz spróbować dodać dodatkowe miejsce?
sr: Открили смо да линија {line_number} има премало ({leading_spaces}) размака. Можете ли покушати да додате додатни размак?
ta: {line_number} மிகக் குறைவான ({leading_spaces}) இடைவெளிகளைக் கொண்டிருப்பதை நாங்கள் கண்டறிந்தோம். கூடுதல் இடத்தை சேர்க்க முயற்சிக்கலாமா?
tr: `{line_number}` numaralı satırda çok az sayıda (`{leading_spaces}`) boşluk olduğunu tespit ettik. Fazladan bir boşluk eklemeyi deneyebilir misiniz?
uk: Ми виявили, що в рядку {line_number} замало ({leading_spaces}) пробілів. Чи можете ви спробувати додати додатковий простір?
zh_hans: 我们发现第 {line_number} 行空格太少只有（{leading_spaces}）。可以尝试添加一个额外的空格吗？

# Too Many Indents
source: We detected that line {line_number} has too many ({leading_spaces}) spaces. Can you try to remove the extra space?
ar: لقد اكتشفنا أن السطر {line_number} لديه {leading_spaces} فوق المطلوب. هل بإمكانك مسح مسافات البداءة الإضافية؟
ca: Hem detectat que la línia {line_number} té massa espais ({leading_spaces}). Pots provar d'eliminar l'espai extra?
es: Detectamos que la línea {line_number} tiene demasiados espacios ({leading_spaces}). ¿Puede intentar eliminar el espacio extra?
pl: Użyłeś zbyt wielu wiodących spacji w linii {line_number} ma zbyt wiele spacji ({leading_spaces}). Czy możesz spróbować usunąć dodatkowe spacje?
sr: Открили смо да линија {line_number} има превише ({leading_spaces}) размака. Можете ли покушати да уклоните додатни размак?
ta: {line_number} பல ({leading_spaces}) இடைவெளிகளைக் கொண்டுள்ளது. கூடுதல் இடத்தை அகற்ற முயற்சிக்கலாமா?
tr: `{line_number}` numaralı satırda çok fazla (`{leading_spaces}`) boşluk olduğunu tespit ettik. Fazlalık olan boşlukları kaldırmayı deneyebilir misiniz?
uk: Ми виявили, що в рядку {line_number} забагато ({leading_spaces}) пробілів. Чи можете ви спробувати прибрати зайве місце?
zh_hans: 我们检测到第 {line_number} 行有太多有 ({leading_spaces}) 个空格。可以尝试删除多余的空格吗？

# Unexpected Indentation
source: We detected that line {line_number} has too many ({leading_spaces}) spaces. Can you try adding {indent_size} more spaces per new block?
ar: لقد اكتشفنا أن السطر {line_number} لديه {leading_spaces} فوق المطلوب. هل بإمكانك إضافة {indent_size} مسافة لكل مجموعة؟
ca: Hem detectat que la línia {line_number} té massa espais ({leading_spaces}). Pots provar d'afegir {indent_size} espais més per a cada nou bloc?
es: Detectamos que la línea {line_number} tiene demasiados espacios ({leading_spaces}). ¿Puedes intentar agregar {indent_size} más espacios por nuevo bloque?
fr: Tu as utilisé trop d’espaces à la ligne {line_number}. Tu as utilisé {leading_spaces} espaces, ce qui est trop. Commence chaque bloc par {indent_size} espaces de plus qu’à la ligne précédente.
id: Anda menggunakan terlalu banyak spasi pada baris {line_number}. Anda menggunakan spasi {leading_spaces}, dan itu terlalu banyak. Mulailah setiap blok baru dengan spasi {indent_size} lebih banyak dari baris sebelumnya.
ko: {line_number} 행에 공백을 너무 많이 사용했습니다. {leading_spaces}개의 공백을 사용했는데 너무 많습니다. 새 블록을 모두 이전 행보다 {indent_size}개의 공백으로 시작하십시오.
pl: Wykryliśmy, że linia {line_number} ma zbyt wiele spacji ({leading_spaces}). Czy możesz spróbować dodać {indent_size} więcej spacji na nowy blok?
sr: Открили смо да линија {line_number} има превише ({leading_spaces}) размака. Можете ли покушати да додате {indent_size} више размака по новом блоку?
ta: {line_number} பல ({leading_spaces}) இடைவெளிகளைக் கொண்டுள்ளது. புதிய தொகுதிக்கு {indent_size} கூடுதல் இடங்களைச் சேர்க்க முயற்சிக்கலாமா?
tr: `{line_number}` numaralı satırda çok fazla (`{leading_spaces}`) boşluk olduğunu tespit ettik. Her yeni blok başına `{indent_size}` kadar daha fazla boşluk eklemeyi deneyebilir misiniz?
uk: Ми виявили, що в рядку {line_number} забагато ({leading_spaces}) пробілів. Чи можете ви спробувати додати ще {indent_size} пробілів на новий блок?
zh_hans: 我们检测到第 {line_number} 行有太多 ({leading_spaces}) 个空格。可以尝试在每个新块中添加 {indent_size} 个空格吗？

# Unquoted Assignment
source: We detected that the text to the right of the `{is}` is not written between quotes. This level requires you to start writing the text between quotes. Try doing that for the text {text}
ar: لقد اكتشفنا أن النص بيمين '{is}' ليس مكتوبا بين علامات الاقتباس. هذا المستوى يتطلب أن تكتب النصوص بين علامات الاقتباس. حاول فعل هذا مع النص {text}
ca: Hem detectat que el text a la dreta de `{is}` no està escrit entre cometes. Aquest nivell requereix que comencis a escriure el text entre cometes. Prova de fer-ho per al text {text}
es: Detectamos que el texto a la derecha del `{is}`no está escrito entre comillas. Este nivel requiere que usted comience a escribir el texto entre comillas. Intenta hacer eso para el texto {text}
id: Dari level ini, Anda perlu menempatkan teks di sebelah kanan `{is}` di antara tanda kutip. Anda lupa itu untuk teks {text}.
ko: 이 레벨에서 따옴표 사이 {is}의 오른쪽에 텍스트를 배치해야 합니다. {text} 텍스트의 경우 이를 잊어버린 것입니다.
pl: Wykryliśmy, że tekst po prawej stronie {is} nie jest zapisywany między cudzysłowami. Ten poziom wymaga rozpoczęcia pisania tekstu między cudzysłowami. Spróbuj to zrobić dla tekstu {text}
sr: Открили смо да текст десно од `{is}` није написан између наводника. Овај ниво захтева да почнете да пишете текст између наводника. Покушајте то за текст {text}
ta: `{is}` க்கு இன் வலது புறத்தில் உள்ள உரை மேற்கோள்களுக்கு இடையில் எழுதப்படவில்லை என்பதை நாங்கள் கண்டறிந்தோம். இந்த நிலை நீங்கள் மேற்கோள்களுக்கு இடையில் உரையை எழுதத் தொடங்க வேண்டும். {text} உரைக்கு அதைச் செய்ய முயற்சி
tr: `{is}` komutunun sağındaki metnin tırnaklar arasına yazılmadığını tespit ettik. Bu seviyede, metni tırnak işaretleri arasında yazmaya başlamanız gerekir. Bunu "`{text}`" metni için yapmayı deneyin
uk: Ми виявили, що текст праворуч від `{is}` не написаний у лапках. Цей рівень вимагає, щоб ви почали писати текст між лапками. Спробуйте зробити це для тексту {text}
zh_hans: 我们检测到`{is}`右侧的文本未写在引号之间。此级别要求您开始在引号之间写文本。尝试对文本 {text} 执行此操作

# Unquoted Equality Check
source: We detected that the code is trying to check if a variable equals multiple words. Can you try using quotation marks for the words you want to check?
ar: لقد اكتشفنا أن البرنامج يريد فحص إذا ما كان المتغير مساويا لنص من عدة كلمات. هل بإمكانك استخدام علامات الاقتباس للكلمات التي تريد فحصها؟
ca: Hem detectat que el codi està intentant comprovar si una variable és igual a diverses paraules. Pots provar d'utilitzar cometes per a les paraules que vols comprovar?
es: Detectamos que el código está tratando de comprobar si una variable equivale a varias palabras. ¿Puede intentar usar comillas para las palabras que desea comprobar?
fr: Lorsque tu veux vérifier si une variable correspond à plusieurs mots, ces mots doivent être mis entre guillemets !
id: Jika Anda ingin memeriksa apakah suatu variabel sama dengan beberapa kata, kata-kata tersebut harus diapit oleh tanda kutip!
ko: 변수가 여러 단어와 같은지 확인하려면 단어를 따옴표로 둘러싸야 합니다!
pl: Wykryliśmy, że kod próbuje sprawdzić, czy zmienna jest równa wielu słowom. Czy możesz spróbować użyć cudzysłowu dla słów, które chcesz sprawdzić?
sr: Открили смо да код покушава да провери да ли је променљива једнака више речи. Можете ли покушати да користите наводнике за речи које желите да проверите?
ta: ஒரு மாறி பல சொற்களுக்கு சமமாக இருக்கிறதா என்று சரிபார்க்க குறியீடு முயற்சிக்கிறது என்பதை நாங்கள் கண்டறிந்தோம். நீங்கள் சரிபார்க்க விரும்பும் சொற்களுக்கு மேற்கோள் மதிப்பெண்களைப் பயன்படுத்த முயற்சிக்கலாமா?
tr: Kodun, bir değişkenin birden fazla kelimeye eşit olup olmadığını kontrol etmeye çalıştığını tespit ettik. Kontrol etmek istediğiniz kelimeler için tırnak işareti kullanmayı deneyebilir misiniz?
uk: Ми виявили, що код намагається перевірити, чи дорівнює змінна кільком словам. Чи можете ви спробувати взяти в лапки слова, які ви хочете перевірити?
zh_hans: 我们检测到代码正在尝试检查一个变量是否等于多个单词。可以尝试对要检查的单词使用引号吗？

# Unquoted Text
source: We detected that text for `{ask}` or `{print}` seems to be missing their quotation marks. Can you try adding quotes for {unquotedtext}?
ar: لقد اكتشفنا أن النصوص التي تريد استخدامها للأمر البرمجي '{ask}' أو '{print}' فاقدة لعلامات الاقتباس. هل بإمكانك أن تحيط هذا النص: {unquotedtext} بعلامات الاقتباس؟
ca: Hem detectat que el text després de {ask} o {print} potser li falten cometes. Pots provar d'afegir-les al text {unquotedtext}?
es: Detectamos que el texto de `{ask}`' o `{print}`' parece estar faltando sus comillas. ¿Puede intentar agregar comillas para {unquotedtext}?
id: Hati-hati. Jika Anda `{ask}` atau `{print}` sesuatu, teks harus diawali dan diakhiri dengan tanda kutip. Anda lupa untuk teks {unquotedtext}.
kab: Nufa-d aḍris-a i `{ask}` neɣ `{print}` yettban ixuṣṣ ticraḍ n usigez. Tzemreḍ ad tɛerḍeḍ ad tent-ternuḍ i {unquotedtext}?
ko: 주의하십시오. {ask} 또는 {print} 작업을 수행할 경우 텍스트는 따옴표로 시작하고 끝을 맺어야 합니다. {unquotedtext} 텍스트에 대해 잊어버린 것입니다.
pl: Wykryliśmy, że w tekście {ask} lub {print} wydaje się brakować ich cudzysłowu. Czy możesz spróbować dodać cudzysłowy dla {unquotedtext}?
sr: Открили смо да текст за `{ask}` или `{print}` изгледа да недостају наводници. Можете ли покушати да додате наводнике за {unquotedtext}?
ta: `{ask}` அல்லது `{print}` க்கான அந்த உரையை நாங்கள் கண்டறிந்தோம். {unquotedtext} க்கான மேற்கோள்களைச் சேர்க்க முயற்சிக்கலாமா?
tr: "'{ask}`" veya "`{print}`" için tırnak işaretlerinin eksik olduğunu tespit ettik. "`{unquotedtext}`" için tırnak işareti eklemeyi deneyebilir misiniz?
uk: Ми виявили, що в тексті для `{ask}` або `{print}`, схоже, відсутні лапки. Чи можете ви спробувати додати цитати для {unquotedtext}?
zh_hans: 我们发现`{ask}`或`{print}`的文本似乎缺少引号。可以尝试为{unquotedtext}添加引号吗？

# Unsupported Float
source: We detected that the code uses non-integer numbers which are not supported yet. Can you try changing `{value}` to an integer?
ar: لقد اكتشفنا أن برنامجك يستخدم أرقاما غير صحيحة (أرقاما عشرية)، وهذه لا تدعمها هيدي الآن (ولكن بعد عدة مستويات). في الوقت الحالي، هل بإمكانك تغيير `{value}` إلى رقم صحيح؟
ca: Hem detectat que el codi utilitza números no enters que encara no són compatibles. Pots provar de canviar `{value}` per un enter?
es: Detectamos que el código usa números no enteros que aún no son compatibles. ¿Puede intentar cambiar `{value}`a un entero?
fr: Les nombres non-entiers ne sont pas encore disponible, mais ils le seront dans quelques niveaux. Pour l'instant, change `{value}` en un entier.
id: Angka non-integer belum didukung namun akan ada dalam beberapa level. Untuk saat ini ubah `{value}` menjadi bilangan bulat.
ko: 정수가 아닌 숫자는 아직 지원되지 않지만 몇 가지 레벨이 될 것입니다. 지금은 {value}을(를) 정수로 변경하십시오.
pl: Wykryliśmy, że kod używa liczb innych niż liczby całkowite, które nie są jeszcze obsługiwane. Czy możesz spróbować zmienić {value} na liczbę całkowitą?
sr: Открили смо да код користи нецелобројне бројеве који још нису подржани. Можете ли покушати да промените `{value}` у целобројни број?
ta: குறியீடு இன்னும் ஆதரிக்கப்படாத முழு எண் அல்லாத எண்களைப் பயன்படுத்துகிறது என்பதை நாங்கள் கண்டறிந்தோம். `{value}` ஒரு முழு எண்ணாக மாற்ற முயற்சிக்கலாமா?
tr: Bu kodun, tamsayılar dışında henüz desteklenmeyen sayıları kullandığını tespit ettik. "`{value}`" değerini bir tamsayı olarak değiştirmeyi deneyebilir misiniz?
uk: Ми виявили, що код використовує нецілі числа, які ще не підтримуються. Чи можете ви спробувати змінити `{value}` на ціле число?
zh_hans: 我们检测到代码使用了尚不支持的非整数。可以尝试将`{value}`更改为整数吗？
