Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# Invalid Space
source: We detected that line {line_number} started with a space. Can you try removing the space?
ar: يوجد مسافة زائدة في بداية السطر رقم {line_number}، هل باستطاعتك أن تمسحها؟
ca: Hem detectat que a la línia {line_number} comença amb espai. Pots eliminar-lo?
da: Vi fandt denne linje {line_number} startede med et mellemrum. Kan du prøve at fjerne mellemrummet?
de: Wir haben festgestellt, dass die Zeile {line_number} mit einem Leerzeichen begonnen hat. Kannst du versuchen das Leerzeichen zu entfernen?
es: Detectamos que la línea {line_number} comenzó con un espacio. ¿Puedes intentar eliminar el espacio?
fr: Oups ! Tu as commencé une ligne par une espace à la ligne {line_number}. Les espaces en début de ligne rendent les ordinateurs perplexes, peux-tu le supprimer ?
id: Ups! kamu memulai baris dengan sebuah spasi pada baris {line_number}. Spasi membingungkan komputer, dapatkah kamu membuangnya?
ko: 이런! 행 {line_number}에 공백이 있는 행을 시작했습니다. 공백이 컴퓨터를 혼란스럽게 하는데, 제거할 수 있나요?
pl: Wykryliśmy, że linia {line_number} zaczyna się od spacji. Czy możesz spróbować usunąć miejsce?
sr: Открили смо да линија {line_number} почиње са размаком. Можете ли покушати да уклоните размак?
ta: அந்த வரியை {line_number} ஒரு இடத்துடன் தொடங்கியதைக் கண்டறிந்தோம். இடத்தை அகற்ற முயற்சிக்கலாமா?
tr: "`{line_number}`" numaralı satırın başında boşlukla başladığını tespit ettik. Boşluğu kaldırmayı deneyebilir misiniz?
uk: Ми виявили, що рядок {line_number} починається з пробілу. Чи можете ви спробувати видалити пробіл?
zh_hans: 我们检测到第 {line_number} 行以空格开头。你可以尝试删除该空格？

# Invalid Type Combination
source: We detected that `{invalid_argument}` and `{invalid_argument_2}` cannot be used with `{command}` because one is {invalid_type} and the other is {invalid_type_2}. Can you try changing `{invalid_argument}` to {invalid_type_2} or `{invalid_argument_2}` to {invalid_type}?
ar: لا يمكن استعمال `{invalid_argument}` و`{invalid_argument_2}` مع الأمر `{command}` وذلك بسبب كون الأول{invalid_type} وكون الآخر {invalid_type_2}. هل بإمكانك تغيير `{invalid_argument}` الى {invalid_type_2} أو `{invalid_argument_2}` الى {invalid_type}؟
ca: Hem detectat que `{invalid_argument}` i`{invalid_argument_2}` no es poden fer servir amb `{command}`, ja que un és {invalid_type} i l'altre és {invalid_type_2}. Pots provar de canviar `{invalid_argument}` a {invalid_type_2} o `{invalid_argument_2}` a {invalid_type}?
da: Vi fandt, at `{invalid_argument}` og `{invalid_argument_2}` ikke kan anvendes med `{command}` fordi den ene er {invalid_type} og den anden er {invalid_type_2}. Kan du prøve at ændre `{invalid_argument}` til {invalid_type_2} eller `{invalid_argument_2}` til {invalid_type}?
es: Hemos detectado que el `{invalid_argument}`y el `{invalid_argument_2}`no se pueden utilizar con el `{command}`, porque uno es {invalid_type} y el otro es {invalid_type_2}. ¿Puede intentar cambiar el `{invalid_argument}` a {invalid_type_2} o el ’{invalid_argument_2}`a {invalid_type}?
fr: Tu ne peux pas utiliser `{invalid_argument}` et `{invalid_argument_2}` avec `{command}` car l'un est {invalid_type} et l'autre est {invalid_type_2}. Essaye de changer `{invalid_argument}` en {invalid_type_2} ou `{invalid_argument_2}` en {invalid_type}.
id: Anda tidak dapat menggunakan `{invalid_argument}` dan `{invalid_argument_2}` dengan `{command}` karena yang satu adalah {invalid_type} dan yang lainnya adalah {invalid_type_2}. Coba ubah `{invalid_argument}` menjadi {invalid_type_2} atau `{invalid_argument_2}` menjadi {invalid_type}.
ko: 하나는 {invalid_type}이고 다른 하나는 {invalid_type_2}이므로 {invalid_argument} 및 {invalid_argument_2}을(를) {command}에 사용할 수 없습니다. {invalid_argument}을(를) {invalid_type_2} 또는 {invalid_argument_2}을(를) {invalid_type}으로 변경해 보십시오.
pl: Wykryliśmy, że `{invalid_argument}` i `{invalid_argument_2}` nie mogą być używane z `{command}`, ponieważ jeden jest{invalid_type}a drugi to {invalid_type_2}. Czy możesz spróbować zmienić `{invalid_argument}` na {invalid_type_2} lub `{invalid_argument_2}` na {invalid_type}?
sr: Открили смо да `{invalid_argument}` и `{invalid_argument_2}` не могу бити коришћени са `{command}` јер је један {invalid_type} а други је {invalid_type_2}. Можете ли покушати да промените `{invalid_argument}` у {invalid_type_2} или `{invalid_argument_2}` у {invalid_type}?
ta: `{invalid_argument}` மற்றும் `{invalid_argument_2}` {command} `உடன் பயன்படுத்த முடியாது, ஏனெனில் ஒன்று {invalid_type}, மற்றொன்று {invalid_type_2}. `{invalid_argument}` {invalid_type_2} அல்லது `{invalid_argument_2}` {invalid_type} க்கு மாற்ற முயற்சிக்கலாமா?
tr: "`{invalid_argument}`" ve "`{invalid_argument_2}`" argümanlarının "`{command}`" ile kullanılamayacağını tespit ettik, çünkü biri bir "`{invalid_type}`" ve diğeri bir "` {invalid_type_2}`". "`{invalid_argument}`" için "`{invalid_type_2}`" veya "`{invalid_argument_2}`" için "`{invalid_type}`" tür değişimi yapmayı deneyebilir misiniz?
uk: Ми виявили, що `{invalid_argument}` і `{invalid_argument_2}` не можна використовувати з `{command}`, оскільки один — {invalid_type}, а інший — {invalid_type_2}. Чи можете ви спробувати змінити `{invalid_argument}` на {invalid_type_2} або `{invalid_argument_2}` на {invalid_type}?
zh_hans: 我们检测到 `{invalid_argument}`和`{invalid_argument_2}`不能与 `{command}` 一起使用，因为一个是{invalid_type}，另一个是{invalid_type_2}。你可以尝试将`{invalid_argument}`更改为{invalid_type_2}或将`{invalid_argument_2}`更改为{invalid_type} ？

# Lonely Echo
source: We detected that an `{echo}` is being used before or without using an `{ask}`. Can you try writing an `{ask}` before the `{echo}`?
ar: لقد استعملت الأمر '{echo}' قبل أو دون الأمر '{ask}'. هل بإمكانك استعمال الأمر '{ask}' للحصول على إجابة أولاً ثم استعمال الأمر '{echo}'؟
ca: Hem detectat que un `{echo}` s'ha utilitzat abans o sense fer servir `{ask}`. Pots provar d'escriure un`{ask}` abans d'`{echo}`?
da: Vi fandt, at en `{echo}` bruges før eller uden brug af en `{ask}`. Kan du prøve at skrive en `{ask}` før `{echo}`?
es: Detectamos que se está utilizando un `{echo}`antes o sin utilizar un `{ask}`. ¿Puede intentar escribir un `{ask}`antes del `{echo}`?
id: Anda menggunakan `{echo}` sebelum `{ask}`, atau `{echo}` tanpa `{ask}`. Tempatkan `{ask}` sebelum `{echo}`.
kab: Nufa-d belli `{echo}`tettwaseqdac send neɣ ar `{ask}`. Tzemreḍ ad tɛerḍeḍ tira n `{ask}`send `{echo}`?
ko: {ask} 이전에 {echo}을(를) 사용했거나 {ask}이(가) 없는 {echo}을(를) 사용했습니다. {echo} 앞에 {ask}을(를) 배치하십시오.
pl: Wykryliśmy, że {echo} jest używane przed lub bez użycia {ask}. Czy możesz spróbować napisać {ask} przed {echo}?
sr: Открили смо да се `{echo}` користи пре или без коришћења `{ask}`. Можете ли покушати да напишете `{ask}` пре `{echo}`?
ta: ஒரு `{ask}` பயன்படுத்தாமல் ஒரு `{echo}` பயன்படுத்தப்படுவதை நாங்கள் கண்டறிந்தோம். `{echo}` க்கு முன் `{ask}`எழுத முயற்சிக்கலாமா?
tr: Bir "`{echo}`" ifadesinin bir "`{ask}`" kullanılmadan önce ya da hiç olmadan kullanıldığını tespit ettik. "`{echo}`" komutundan önce bir "`{ask}`" yazmayı deneyebilir misiniz?
uk: Ми виявили, що `{echo}` використовується перед використанням `{ask}` або без нього. Чи можете ви спробувати написати `{ask}` перед `{echo}`?
zh_hans: 我们检测到在 `{echo}` 之前或未使用 `{ask}` 的情况下使用了它。您可以尝试在 `{echo}` 之前写入 `{ask}` 吗？

# Lonely Text
source: We detected that the code seems to be missing a command with the text that was used in line {line_number}. Can you try writing the needed command with the text
ar: لقد اكتشفنا أن السطر {line_number} يفتقر إلى أمر برمجي. هل بإمكانك إدخال الأمر البرمجي المطلوب مع النص؟
ca: Hem detectat al codi que fa falta una comanda dins el text de la línia {line_number}. Pots provar d'escriure dins el text la comanda que hi falta
es: Detectamos que el código parece estar faltando un comando con el texto que se utilizó en la línea {line_number}. Puedes intentar escribir el comando necesario con el texto
fr: Il semble que tu as oublié de mettre une commande avec le texte de la ligne {line_number}
id: Sepertinya Anda lupa menggunakan perintah dengan teks yang Anda gunakan di baris {line_number}
ko: {line_number} 행에서 사용한 텍스트에 명령을 사용하지 않은 것 같습니다
pl: Wykryliśmy, że w kodzie brakuje polecenia z tekstem użytym w wierszu {line_number}. Czy możesz spróbować napisać potrzebne polecenie z tekstem
sr: Открили смо да код изгледа да недостаје команда са текстом који је коришћен у линији {line_number}. Можете ли покушати да напишете потребну команду са текстом
ta: {line_number} வரியில் பயன்படுத்தப்பட்ட உரையுடன் ஒரு கட்டளையைக் குறியீடு காணவில்லை என்று நாங்கள் கண்டறிந்தோம். தேவையான கட்டளையை உரையுடன் எழுத முயற்சிக்கலாமா
tr: Kodun, `{line_number}` numaralı satırda kullanılan metinle ilgili bir komutunun eksik olduğunu tespit ettik. Gerekli komutu metinle birlikte yazmayı deneyebilir misiniz?
uk: Ми виявили, що в коді, здається, відсутня команда з текстом, який використовувався в рядку {line_number}. Чи можете ви спробувати написати потрібну команду з текстом
zh_hans: 我们检测到代码中似乎缺少一个包含第 {line_number} 行所用文本的命令。你能否尝试使用文本编写所需的命令

# Missing Additional Command
source: We detected that the command `{command}` on line {line_number} is missing something. Can you try using `{missing_command}` in your code?
ar: لقد اكتشفنا أن الأمر البرمجي '{command}' في السطر {line_number} يفتقد شيئا. هل بإمكانك استخدام '{missing_command}' في برنامجك؟
ca: Hem detectat que a la comanda `{command}` de la línia {line_number} li falta alguna cosa. Pots provar d'utilitzar `{missing_command}` al teu codi?
da: Vi fandt, at kommandoen `{command}` på linje {line_number} mangler noget. Kan du prøve at bruge `{missing_command}` i din kode?
es: Detectamos que el comando `{command}` en la línea {line_number} le falta algo. ¿Puede intentar usar `{missing_command}`en su código?
sr: Детектовали смо да команда `{command}` на линији {line_number} недостаје. Можете ли покушати да користите `{missing_command}` у вашем коду?
ta: {line_number} வரியில் `{command}` கட்டளை எதையாவது காணவில்லை என்பதை நாங்கள் கண்டறிந்தோம். உங்கள் குறியீட்டில் `{missing_command}` பயன்படுத்த முயற்சிக்கலாமா?
tr: `{line_number}` numaralı satırdaki "`{command}`" komutunda bir şeyin eksik olduğunu tespit ettik. Kodunuzda bir "`{missing_command}`" kullanmayı deneyebilir misiniz?
uk: Ми виявили, що в команді `{command}` у рядку {line_number} чогось не вистачає. Чи можете ви спробувати використати `{missing_command}` у своєму коді?
zh_hans: 我们检测到第 {line_number} 行上的命令 `{command}` 缺少某些内容。您可以尝试在代码中使用 `{missing_command}` 吗？

# Missing Colon Error
source: We detected that `{command}` needs a `:` at the end of line {line_number}. Starting from level 17, can you start adding a `:` at the end of line with commands?
ar: لقد اكتشفنا أن '{command}' تحتاج إلى ':' في بداية السطر {line_number}. بداءة من المستوى 17، هل بإمكانك إضافة ':' في نهاية مثل هذا السطر؟
ca: Hem detectat que `{command}` necessita dos punts (`:`) al final de la línia {line_number}. A partir del nivell 17, recordareu d'afegir `:` als finals de línies amb comandes?
da: Vi fandt, at `{command}` har brug for en `:` i slutningen af linjen {line_number}. Startende fra niveau 17, kan du begynde at tilføje en `:`i slutningen af linjen med kommandoer?
es: Detectamos que `{command}`necesita un `:`al final de la línea {line_number}. A partir del nivel 17, ¿puedes empezar a añadir un «:» al final de la línea con comandos?
pl: Wykryliśmy, że {command} potrzebuje `:` na końcu wiersza {line_number}. Zaczynając od poziomu 17, czy możesz zacząć dodawać `:` na końcu wiersza za pomocą poleceń?
sr: Открили смо да `{command}` треба `:` на крају линије {line_number}. Почевши од нивоа 17, можете ли почети да додајете `:` на крају линије са командама?
ta: `{command}`க்கு {line_number} வரியின் முடிவில் ஒரு `:` தேவை என்பதை நாங்கள் கண்டறிந்தோம். நிலை 17 முதல் தொடங்கி, கட்டளைகளுடன் வரிசையின் முடிவில் `:` சேர்க்கத் தொடங்க முடியுமா?
tr: "`{command}`" ifadesi için `{line_number}` numaralı satırın sonunda bir "`:`" işaretine ihtiyaç olduğunu tespit ettik. Seviye 17'den itibaren komutların sonuna `:` eklemeye başlayabilir misiniz?
uk: Ми виявили, що {command} потребує : у кінці рядка {line_number}. Починаючи з рівня 17, чи можете ви почати додавати : в кінці рядка з командами?
zh_hans: 我们检测到 `{command}` 在第 {line_number} 行末尾需要一个 `:`。从第 17 级开始，你可以在命令行末尾添加 `:` ？

# Missing Command
source: We detected that the code seems to be missing a command on line {line_number}. Can you try looking at the exercise section to find which command to use?
ar: لقد اكتشفنا أنك نسيت استخدام أمر برمجي في السطر رقم {line_number}. هل بإمكانك البحث في قسم التمارين عن أية أوامر برمجية لاستخدامها؟
ca: Hem detectat al codi que li falta una ordre a la línia {line_number}. Has revisat a la secció d'exercicis per trobar quina comanda utilitzar?
es: Detectamos que el código parece estar faltando un comando en la línea {line_number}. ¿Puedes intentar mirar la sección de ejercicios para encontrar qué comando usar?
fr: Il semble que vous avez oublié d'utiliser une commande à la ligne {line_number}.
id: Sepertinya Anda lupa menggunakan perintah pada baris {line_number}.
ko: {line_number} 라인에서 명령을 사용하는 것을 잊어버린 것 같습니다.
pl: Wykryliśmy, że w kodzie brakuje polecenia w wierszu {line_number}. Czy możesz spróbować spojrzeć na sekcję ćwiczeń, aby znaleźć polecenie, którego chcesz użyć?
sr: Открили смо да код изгледа да недостаје команда на линији {line_number}. Можете ли покушати да погледате одељак вежбе да пронађете коју команду да користите?
ta: குறியீடு {line_number} வரியில் ஒரு கட்டளையைக் காணவில்லை என்று நாங்கள் கண்டறிந்தோம். எந்தக் கட்டளையைப் பயன்படுத்த வேண்டும் என்பதைக் கண்டுபிடிக்க உடற்பயிற்சி பகுதியைப் பார்க்க முயற்சிக்கலாமா?
tr: Kodun, `{line_number}` numaralı satırda bir komutunun eksik göründüğünü tespit ettik. Hangi komutu kullanmanız gerektiğini bulmak için alıştırma bölümüne göz atmayı deneyebilir misiniz?
uk: Ми виявили, що в коді, схоже, відсутня команда в рядку {line_number}. Чи можете ви спробувати переглянути розділ вправ, щоб знайти, яку команду використовувати?
zh_hans: 我们发现代码第 {line_number} 行似乎缺少一个命令。你可以尝试查看练习部分以找出要使用的命令？

# Missing Inner Command
source: We detected that the code seems to be missing a command for the `{command}` statement on line {line_number}. Can you try looking at the exercise section to find which command to use?
ar: يبدو أنك نسيت استخدام أمر برمجي مع الجملة `{command}` التي استعملتها في السطر رقم {line_number}. هل بإمكانك البحث في قسم التمارين لمعرفة الأوامر البرمجية المطلوبة؟
ca: Hem detectat al codi que fa falta una comanda per a la instrucció `{command}` a la línia {line_number}. Has revisat la secció d'exercicis per trobar quina comanda fa falta?
da: Vi fandt, at koden ser ud til at mangle en kommando for `{command}` tilstand i linje {line_number}. Kan du prøve at kigge på træningssektionen for at finde, hvilken kommando du skal bruge?
es: Detectamos que el código parece estar faltando un comando para la sentencia `{command}' en la línea {line_number}. ¿Puedes intentar mirar la sección de ejercicios para encontrar qué comando usar?
fr: Il semble que tu as oublié d'utiliser une commande avec la déclaration `{command}` que tu as utilisé à la ligne {line_number}.
id: Sepertinya Anda lupa menggunakan perintah dengan pernyataan `{command}` yang Anda gunakan pada baris {line_number}.
ko: {line_number} 라인에서 사용한 {command} 문에 명령을 사용하지 않은 것 같습니다.
pl: Wykryliśmy, że w kodzie brakuje polecenia dla polecenia {command} w wierszu {line_number}. Czy możesz spróbować spojrzeć na sekcję ćwiczeń, aby znaleźć polecenie, którego chcesz użyć?
sr: Открили смо да код изгледа да недостаје команда за изјаву `{command}` на линији {line_number}. Можете ли покушати да погледате одељак вежбе да пронађете коју команду да користите?
ta: குறியீடு {line_number} இல் உள்ள `{command}`அறிக்கைக்கான கட்டளையைக் காணவில்லை என்று நாங்கள் கண்டறிந்தோம். எந்தக் கட்டளையைப் பயன்படுத்த வேண்டும் என்பதைக் கண்டுபிடிக்க உடற்பயிற்சி பகுதியைப் பார்க்க முயற்சிக்கலாமா?
tr: `{line_number}` numaralı satırdaki kodun,"`{command}`" için bir komutunun eksik olduğunu tespit ettik. Hangi komutun kullanılacağını bulmak için alıştırma bölümüne bakmayı deneyebilir misiniz?
uk: Ми виявили, що в коді, схоже, відсутня команда для оператора {command} у рядку {line_number}. Чи можете ви спробувати переглянути розділ вправ, щоб знайти, яку команду використовувати?
zh_hans: 我们发现代码中第 {line_number} 行的 `{command}` 语句似乎缺少一个命令。你可以尝试查看练习部分以找出要使用的命令？

# Missing Square Brackets
source: We detected that the list you created on line {line_number} is missing square brackets `[]`. Can you try adding square brackets around `[]` the list?
ar: لقد اكتشفنا أن القائمة التي أنشأتها في السطر {line_number} تفتقد إلى قوسين مربعين '[]'. هل بإمكانك إدخال القوسين المربعين '[]' حول القائمة؟
ca: Hem detectat que a la llista que heu creat a la línia {line_number} li falten claudàtors `[]`. Pots provar d'afegir claudàtors `[]` al voltant de la llista?
es: Hemos detectado que a la lista que ha creado en la línea {line_number} le faltan los corchetes `[]`. ¿Puede intentar añadir corchetes alrededor de `[]` a la lista?
fr: It looks like you forgot to use square brackets `[]` around the list you were creating on line {line_number}.
id: It looks like you forgot to use square brackets `[]` around the list you were creating on line {line_number}.
pl: Wykryliśmy, że na liście utworzonej w wierszu {line_number} brakuje nawiasów kwadratowych `[]`. Czy możesz spróbować dodać nawiasy kwadratowe wokół listy `[]`?
sr: Открили смо да листа коју сте креирали на линији {line_number} недостаје квадратне заграде `[]`. Можете ли покушати да додате квадратне заграде око `[]` листе?
ta: {line_number} இல் நீங்கள் உருவாக்கிய பட்டியல் சதுர அடைப்புக்குறிகளை `[]` காணவில்லை என்பதை நாங்கள் கண்டறிந்தோம். `[]` பட்டியலைச் சுற்றி சதுர அடைப்புக்குறிகளைச் சேர்க்க முயற்சிக்கலாமா?
tr: `{line_number}` numaralı satırda oluşturduğunuz listede köşeli parantezlerin, "`[ ]`", eksik olduğunu tespit ettik. Listesinin etrafına köşeli parantezleri, `[ ]`, eklemeyi deneyebilir misiniz?
uk: Ми виявили, що у списку, який ви створили в рядку {line_number}, відсутні квадратні дужки `[]`. Чи можете ви спробувати додати квадратні дужки навколо `[]` списку?
vi: Chúng tôi phát hiện danh sách được tạo trên dòng {line_number} đang thiếu dấu ngoặc vuông `[]`. Bạn có thể bổ sung ngoặc vuông `[]` xung quanh danh sách được không?
zh_hans: 我们检测到您在第 {line_number} 行创建的列表缺少方括号 `[]`。你可以尝试在列表的 `[]` 两边添加方括号吗？

# Missing Variable
source: We detected that `{command}` is missing a variable at the start of the line. Can you try writing the variable before the `{command}?`
ar: لقد لاحظنا أن الأمر البرمجي `{command}` يفتقر إلى متغير في بداية السطر. هل يمكنك تعريف المتغير قبل الأمر البرمجي `{command}`؟
ca: Hem detectat que a la vostra `{command}` li falta una variable a l'inici de la línia. Pots provar d'escriure la variable abans de `{command}`?
es: Detectamos que a `{command}` falta una variable al principio de la línea. ¿Puede intentar escribir la variable antes del `{command}`?
pl: Wykryliśmy, że w poleceniu {command} brakuje zmiennej na początku linii. Czy możesz spróbować napisać zmienną przed poleceniem {command}
sr: Открили смо да `{command}` недостаје променљива на почетку линије. Можете ли покушати да напишете променљиву пре `{command}?`
ta: `{command}` `வரியின் தொடக்கத்தில் ஒரு மாறியைக் காணவில்லை என்பதை நாங்கள் கண்டறிந்தோம். `{command}?` க்கு முன் மாறியை எழுத முயற்சிக்கலாமா
tr: "`{command}`" için satırın başında bir değişkenin eksik olduğunu tespit ettik. Değişkeni "`{command}`" komutundan önce yazmayı deneyebilir misiniz?``
uk: Ми виявили, що в `{command}` відсутня змінна на початку рядка. Чи можете ви спробувати записати змінну перед `{command}?`
zh_hans: 我们检测到 `{command}` 在行首缺少一个变量。您可以尝试在 `{command}` 之前写入该变量吗?

# Misspelled At Command
source: We detected that `{invalid_argument}` seems to have a spelling mistake on line {line_number}. Can you try writing `{command}` instead.
ar: لقد لاحظنا أن المدخل `{invalid_argument}` فيه وجود خطأ إملائي في السطر {line_number}. هل يمكنك تجربة كتابة `{command}` بدلاً من ذلك.
ca: Hem detectat que `{invalid_argument}` sembla tenir un error ortogràfic a la línia {line_number}. Pots provar d'escriure `{command}` al seu lloc.
es: Detectamos que `{invalid_argument}` parece tener un error ortográfico en la línea {line_number}. Puedes intentar escribir `{command}`en su lugar.
pl: Wykryliśmy, że {invalid_argument} wydaje się mieć błąd w pisowni w wierszu{line_number}. Czy możesz zamiast tego napisać polecenie {command}.
sr: Открили смо да `{invalid_argument}` изгледа има правописну грешку на линији {line_number}. Можете ли покушати да напишете `{command}` уместо тога.
ta: `{invalid_argument}` {line_number} என்ற வரியில் எழுத்துப்பிழை தவறு இருப்பதாகத் தெரிகிறது. அதற்குப் பதிலாக `{command}` எழுத முயற்சிக்கலாமா.
tr: "`{invalid_argument}`" argümanının, `{line_number}` numaralı satırda bir yazım hatası olduğunu tespit ettik. Bunun yerine "`{command}`" yazmayı deneyebilir misiniz?.
uk: Ми виявили, що `{invalid_argument}` містить орфографічну помилку в рядку {line_number}. Чи можете ви замість цього спробувати написати `{command}`.
zh_hans: 看来您可能拼错了 `{command}` 命令，而是在第 {line_number} 行中写了 `{invalid_argument}`。

# No Indentation
source: We detected that there seems to be too few {leading_spaces} spaces used on line {line_number}. Can you try increasing indentation by {indent_size} for each new block.
ar: لقد استخدمت عدداً غير كاف من فراغات {leading_spaces} على سطر {line_number}. هل بإمكانك إضافة مسافات بادئة بعدد {indent_size}؟
ca: Hem detectat que sembla que hi ha massa pocs {leading_spaces} espais utilitzats a la línia {line_number}. Pots provar d'augmentar el sagnat {indent_size} per a cada bloc nou.
es: Detectamos que parece haber demasiados espacios {leading_spaces} utilizados en la línea {line_number}. Puedes intentar aumentar el sangrado por {indent_size} para cada nuevo bloque.
fr: Tu as utilisé trop peu d’espaces à la ligne {line_number}. Tu as utilisé {leading_spaces} espaces, ce qui n’est pas assez. Commence chaque bloc par {indent_size} espaces de plus qu’à la ligne précédente.
id: Anda menggunakan terlalu sedikit spasi pada baris {line_number}. Anda menggunakan {leading_spaces} spasi, dan itu tidak cukup. Mulailah setiap blok baru dengan spasi {indent_size} lebih banyak dari baris sebelumnya.
ko: {line_number} 행에 사용한 공백이 너무 적습니다. {leading_spaces}개의 공백을 사용했지만 충분하지 않습니다. 이전 행보다 {indent_size}개의 공백이 더 많은 새 블록을 모두 시작하십시오.
pl: Wykryliśmy, że wydaje się, że jest zbyt mało spacji {leading_spaces} używanych w linii {line_number}. Czy możesz spróbować zwiększyć wcięcie o {indent_size} dla każdego nowego bloku.
sr: Открили смо да изгледа да има премало {leading_spaces} размака на линији {line_number}. Можете ли покушати да повећате увлачење за {indent_size} у сваком новом блоку.
ta: {leading_spaces} இடைவெளிகள் {line_number} இல் பயன்படுத்தப்படுவதைக் குறைத்ததாக நாங்கள் கண்டறிந்தோம். ஒவ்வொரு புதிய தொகுதிக்கும் {indent_size} மூலம் உள்தள்ளலை அதிகரிக்க முயற்சிக்க முடியுமா.
tr: `{line_number}` numaralı satırda, girinti için çok az sayıda (`{leading_spaces}`) boşluk kullanılmış gibi göründüğünü tespit ettik. Her yeni blok için girintiyi `{indent_size}` kadar arttırmayı deneyebilir misiniz?.
uk: Ми виявили, що в рядку {line_number} замало {leading_spaces} пробілів. Чи можете ви спробувати збільшити відступ на {indent_size} для кожного нового блоку.
zh_hans: 我们发现第 {line_number} 行使用的 {leading_spaces} 空格似乎太少。能否尝试将每个新块的缩进量增加 {indent_size}.
