Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

source: Personal text
ar: النص الشخصي
ca: Text personal
de: Persönlicher Text
eo: Persona teksto
es: Texto personal
fr: Texte personnel
hi: व्यक्तिगत पाठ
id: Teks pribadi
kab: Aḍris udmawan
ko: 개인 텍스트
nl: Persoonlijke tekst
pl: Opis
sr: Лични текст
ta: தனிப்பட்ட உரை
tr: Kişisel metin
uk: Особистий текст
zh_hans: 个人文本

# personal_text_invalid
source: Your personal text is invalid.
ar: النص الشخصي غير صالح.
ca: El teu text personal no és vàlid.
de: Dein persönlicher Text ist ungültig.
eo: Via persona teksto ne validas.
es: Tu texto personal es inválido.
fr: Votre texte personnel est invalide.
hi: आपका व्यक्तिगत पाठ अमान्य है
id: Teks pribadi Anda tidak valid.
kab: Aḍris-ik udmawan d arameɣtu.
ko: 개인 텍스트가 올바르지 않습니다.
nl: Jouw persoonlijke tekst is ongeldig.
pl: Twój opis jest nieprawidłowy.
sr: Ваш лични текст је неважећи.
ta: உங்கள் தனிப்பட்ட உரை தவறானது.
tr: Kişisel metniniz geçersizdir.
uk: Ваш особистий текст недійсний.
zh_hans: 你的个人信息是无效的。

source: Phone number
ar: رقم الهاتف
ca: Número de telèfon
es: Número de teléfono
kab: Uṭṭun n tiliɣri
pl: Numer telefonu
sr: Број телефона
ta: தொலைபேசி எண்
uk: Номер телефону
zh_hans: 电话号码

source: Preferred keyword language
ar: اللغة المفضلة للأوامر البرمجية
ca: Llengua per a les comandes
de: Bevorzugte Schlüsselwortsprache
eo: Preferata lingvo de la ŝlosilvortoj
es: Idioma preferido para las palabras clave
fr: Langue préférée pour les mots-clés
id: Bahasa kata kunci pilihan
ko: 선호하는 키워드 언어
nl: Commando voorkeurstaal
pl: Preferowany język słów kluczowych
sr: Преферирани језик кључних речи
ta: விருப்பமான முக்கிய மொழி
tr: Tercih edilen anahtar kelime dili
uk: Бажана мова ключових слів
zh_hans: 首选关键字语言

source: Preferred language
ar: اللغة المفضلة
ca: Llengua per a mostrar
de: Bevorzugte Sprache
eo: Preferata lingvo
es: Lenguaje favorito
fr: Langue préferée
hi: पसंदीदा भाषा
id: Bahasa pilihan
kab: Tutlayt tufrint
ko: 선호하는 언어
nl: Voorkeurstaal
pl: Preferowany język
sr: Преферирани језик
ta: விருப்பமான மொழி
tr: Tercih edilen dil
uk: Бажана мова
zh_hans: 首选语言

source: Preview
ar: معاينة
ca: Vista prèvia
de: Vorschau
eo: Antaŭrigardi
es: Previsualizar
fr: Aperçu
hi: पूर्वावलोकन
id: Pratinjau
kab: Taskant
ko: 미리보기
nl: Voorbeeld
pl: Podgląd
sr: Преглед
ta: முன்னோட்டம்
tr: Önizleme
uk: Переглянути
zh_hans: 预览

# preview_teacher_mode
source: This account is for you to try out Hedy, note that you need to sign out and create an actual account to save your progress.
ar: هذا الحساب لك كي تجرب هيدي، في حال تريد أن تحفظ تقدمك في هيدي، اعلم أنك تحتاج أن تخرج من الحساب.
ca: Aquest compte és per a provar Hedy, tingues en compte que caldrà tancar la sessió i crear un compte real per desar el teu progrés.
es: Esta cuenta es para que pruebes Hedy, ten en cuenta que necesitas cerrar sesión y crear una cuenta real para guardar tu progreso.
kab: Amiḍan-a inek i wakken ad tɛerḍeḍ Hedy, ẓer belli ilaq-ak ad teffɣeḍ syen ad tesnulfuḍ amiḍan n tidet i usekles n ukala-k.
pl: To konto jest dla ciebie, abyś mógł wypróbować Hedy. Pamiętaj, że musisz się wylogować i utworzyć rzeczywiste konto, aby zapisać swoje postępy.
sr: Овај налог је за вас да испробате Хеди, имајте на уму да морате да се одјавите и направите прави налог да бисте сачували свој напредак.
ta: இந்த கணக்கு நீங்கள் எடியை முயற்சிக்க வேண்டும், உங்கள் முன்னேற்றத்தை சேமிக்க நீங்கள் வெளியேற வேண்டும் மற்றும் உண்மையான கணக்கை உருவாக்க வேண்டும் என்பதை நினைவில் கொள்க.
uk: Цей обліковий запис призначений для того, щоб ви спробували Hedy, зверніть увагу, що вам потрібно вийти та створити справжній обліковий запис, щоб зберегти свій прогрес.
zh_hans: 此帐户供您试用 Hedy，请注意，您需要退出并创建一个真实帐户来保存您的进度。

source: Previewing adventure
ar: معاينة المغامرة قبل البدء بها
ca: Previsualitzant aventura
es: Previsualizar la aventura
kab: Asenqed n tedyant
nl: Preview avontuur
pl: Przeglądanie przygody
sr: Преглед авантуре
ta: சாகசத்தை முன்னோட்டமிடுதல்
uk: Попередній перегляд пригод
zh_hans: 预览挑战

# previewing_class
source: You are previewing class <em>{class_name}</em> as a teacher.
ar: أنت الآن تعاين الصف </em>{class_name}<em> كمعلم.
ca: Estàs previsualitzant la classe <em>{class_name}</em> com a professor.
es: Está previsualizando la clase <em>{class_name}</em> como profesor.
nl: Jij kijkt naar een preview van klas <em>{class_name}</em> als een leraar/lerares.
pl: Podglądasz klasę <em> {class_name}</em> jako nauczyciel.
sr: Прегледате одељење <em>{class_name}</em> као наставник.
ta: நீங்கள் ஒரு ஆசிரியராக வகுப்பு <em> {class_name} </em> ஐ முன்னோட்டமிடுகிறீர்கள்.
uk: Ви переглядаєте клас <em>{class_name}</em> як викладач.
zh_hans: 您正在以教师身份预习<em>{class_name}</em>课程。

# previous_campaigns
source: View previous campaigns
ar: عرض الحملات السابقة
ca: Veure campanyes anteriors
cs: Prohlédnout si zprávy z minulosti
de: Bisherige Newsletter anzeigen
es: Ver campañas anteriores
fr: Voir les précédentes nouvelles
id: Lihat kampanye-kampanye sebelumnya
ko: 이전 캠페인 보기
nl: Bekijk het nieuwsbrief archief
pl: Wyświetl poprzednie kampanie
sr: Погледајте претходне кампање
ta: முந்தைய பிரச்சாரங்களைக் காண்க
tr: Önceki bültenleri görüntüle
uk: Переглянути попередні кампанії
zh_hans: 查看之前的活动

source: Previous page
ar: الصفحة السابقة
ca: Pàgina anterior
es: Página anterior
kab: Asebter udfir
pl: Poprzednia strona
sr: Претходна страница
ta: முந்தைய பக்கம்
uk: Попередня сторінка
zh_hans: 上一页

# print_accounts
source: Print
ar: اطبع
ca: Imprimeix
es: Imprimir
kab: Siggez
sr: Штампај
ta: அச்சிடுக
uk: Роздрукувати
zh_hans: 打印

# print_accounts_title
source: Student accounts for hedy.org
ar: حسابات الطلاب لموقع hedy.org
ca: Comptes d'estudiant per hedy.org
es: Cuentas de alumno para hedy.org
kab: Imiḍanen n yinelmaden i hedy.ord
sr: Ученички налози за hedy.org
ta: Hedy.org க்கான மாணவர் கணக்குகள்
uk: Студентські акаунти для hedy.org
zh_hans: hedy.org 的学生账户

# print_logo
source: print
ar: اطبع
bg: принтирай
ca: imprimir
de: drucke
eo: presu
es: imprimir
fr: affiche
hi: प्रिंट
id: cetak
kab: siggez
pl: napisz
sr: штампај
ta: அச்சிடுக
tr: yazdır
uk: друкуй
vi: xuất
zh_hans: 打印

source: Privacy terms
ar: شروط الخصوصية
de: Privatsphäre
eo: kondiĉoj pri privateco
es: Protección de datos
fr: termes de confidentialité
id: Ketentuan privasi
kab: Tiwtilin n tbaḍnit
ko: 개인정보보호약관
nl: Privacyverklaring
pl: Polityka prywatności
sr: Услови приватности
ta: தனியுரிமை விதிமுறைகள்
tr: Gizlilik koşulları
uk: Політика конфіденційності
zh_hans: 隐私条款

source: Private
ar: خاص
ca: Privat
de: Privat
es: Privado
fr: Privé
id: Pribadi
kab: Uslig
ko: 사적인
nl: Privé
pl: Prywatne
sr: Приватно
ta: தனிப்பட்ட
tr: Özel
uk: Приватний
zh_hans: 私人的

# profile_logo_alt
source: Profile icon.
ar: علامة الحساب.
ca: Icona de perfil.
de: Profil-Symbol.
eo: Piktogramo de profilo.
es: Icono de perfil.
fr: Icône du profil.
id: Ikon profil.
kab: Tignit n umaɣnu.
ko: 프로필 아이콘.
nl: Profiel icoon.
pl: Ikona profilu.
sr: Икона профила.
ta: சுயவிவர படவுரு.
tr: Profil simgesi.
uk: Значок профілю.
zh_hans: 个人档案图标。

source: Profile picture
ar: صورة الحساب
ca: Foto de perfil
de: Profilbild
eo: Profilbildo
es: Imagen de perfil
fr: Image du profil
hi: प्रोफ़ाइल फोटो
id: Foto profil
kab: Tawlaft n umaɣnu
ko: 프로필 사진
nl: Profielfoto
pl: Obrazek profilowy
sr: Слика профила
ta: சுயவிவர படம்
tr: Profil resmi
uk: Фото профілю
zh_hans: 个人资料图片

source: Profile updated.
ar: تم تحديث الملف الشخصي.
ca: Perfil actualitzat.
cs: Profil byl upraven.
de: Das Profil wurde aktualisiert.
eo: Profilo modifiĝis.
es: Perfil actualizado.
fr: Profil mis à jour.
fy: Dyn profyl is oanpast.
hi: प्रोफ़ाइल अद्यतन की गई|
id: Profil berhasil diubah.
kab: Amaɣnu yettwaleqqem.
ko: 프로필이 업데이트 되었습니다.
nl: Je profiel is aangepast.
pl: Profil został zaktualizowany.
sr: Профил ажуриран.
sw: Wasifu umesasishwa.
ta: சுயவிவரம் புதுப்பிக்கப்பட்டது.
tr: Profil güncellendi.
uk: Профіль оновлено.
zh_hans: 个人资料已更新。

# profile_updated_reload
source: Profile updated, page will be re-loaded.
ar: تم تحديث الملف الشخصي، سيتم إعادة تحميل الصفحة.
ca: Perfil actualitzat, la pàgina es tornarà a carregar.
de: Profil geupdatet, Seite wird neu geladen.
es: Perfil actualizado, la página se recargará.
fr: Le profil a été mis a jour, la page sera rechargée.
id: Profil diperbarui, halaman akan dimuat ulang.
kab: Amaɣnu yettwaleqqem, asebter ad yales alluy.
ko: 프로필이 업데이트되었습니다. 페이지가 다시 로드됩니다.
nl: Je profiel is aangepast, pagina wordt herladen.
pl: Profil został zaktualizowany, strona zostanie ponownie załadowana.
sr: Профил ажуриран, страница ће бити поново учитана.
ta: சுயவிவரம் புதுப்பிக்கப்பட்டது, பக்கம் மீண்டும் ஏற்றப்படும்.
tr: Profil güncellendi, sayfa yeniden yüklenecek.
uk: Профіль оновлено, сторінка буде перезавантажена.
zh_hans: 个人资料已更新，页面将重新加载。

# program_contains_error
source: This program contains an error, are you sure you want to share it?
ar: هذا البرنامج يحتوي على خطأ، هل أنت متأكد من أنك تريد مشاركة البرنامج؟
bg: В тази програма има грешка, сигурни ли сте че искате да я споделите?
ca: Aquest programa conté un error, estàs segur que vols compartir-lo?
cs: Tento program obsahuje chybu, přesto jej chcete sdílet?
de: Dieses Programm enthält einen Fehler, bist du dir sicher, dass du es teilen möchtest?
eo: Ĉi tiu programo enhavas eraron. Ĉu vi certas, ke vi volas kunhavigi ĝin?
es: Este programa contiene un error, ¿está seguro de querer compartirlo?
fr: Ce programme contient une erreur, êtes-vous certain de vouloir le partager ?
id: Program ini berisi error, anda yakin ingin membagikannya?
kab: Ahil-a deg-s tuccḍa, d tidet tebɣiḍ ad t-tebḍuḍ?
ko: 이 프로그램에 오류가 있습니다. 공유하시겠습니까?
nl: Dit programma bevat een foutje, weet je zeker dat je hem wilt delen?
pl: Ten program zawiera błędy, czy na pewno chcesz go udostępnić?
sr: Овај програм садржи грешку, да ли сте сигурни да желите да га поделите?
ta: இந்த நிரலில் பிழை உள்ளது, நீங்கள் அதைப் பகிர விரும்புகிறீர்களா?
tr: Bu program bir hata içeriyor, paylaşmak istediğinizden emin misiniz?
uk: Ця програма містить помилку, ви дійсно хочете нею поділитися?
vi: Chương trình này có lỗi, bạn có chắc rằng bạn muốn chia sẻ nó chứ?
zh_hans: 这个程序包含一个错误，你确定要分享它吗？

# program_header
source: My programs
ar: برامجي
ca: Els meus programes
cs: Moje programy
de: Meine Programme
eo: Miaj programoj
es: Mis programas
fr: Mes programmes
fy: Myn programma's
hi: मेरे प्रोग्राम्स
id: Program-program saya
kab: Ihalan-iw
ko: 나의 프로그램들
nl: Mijn programma's
pl: Moje programy
sr: Моји програми
sw: Programu zangu
ta: எனது திட்டங்கள்
tr: Programlarım
uk: Мої програми
zh_hans: 我的程序

# program_too_large_exception
source: Programs too large
ar: البرامج كبيرة جدا
ca: Programes massa llargs
de: Programme zu groß
es: Programas demasiado extensos
id: Program terlalu besar
kab: Ihalan meqqren aṭas
ko: 프로그램이 너무 큼
nl: Programma is te lang
pl: Programy zbyt duże
sr: Програми су превелики
ta: நிரல்கள் மிகப் பெரியவை
tr: Programlar çok büyük
uk: Програми занадто великі
zh_hans: 程序太大

# programming_experience
source: Do you have programming experience?
ar: هل لديك خبرة سابقة في البرمجة؟
ca: Tens experiència en programació?
cs: Máš nějaké skušenosti s programováním?
de: Hast du schon mal programmiert?
es: Tienes experiencia con programación?
fr: Avez-vous de l'expérience en programmation ?
fy: Hasto al ris programmearre?
hi: क्या आपके पास प्रोग्रामिंग का अनुभव है?
id: Apakah kamu punya pengalaman menulis program?
kab: Ɣur-k tirmit deg usihel?
ko: 프로그래밍 경험이 있으신가요?
nl: Heb jij al eerder geprogrammeerd?
pl: Czy masz doświadczenie z programowaniem?
sr: Да ли имате искуства у програмирању?
ta: உங்களுக்கு நிரலாக்க பட்டறிவு உள்ளதா?
tr: Programlama deneyiminiz var mı?
uk: У вас є досвід програмування?
zh_hans: 你有编程经验吗？

# programming_invalid
source: Please select a valid programming language.
ar: الرجاء اختيار لغة برمجة بشكل صحيح.
ca: Si us plau, selecciona un llenguatge de programació vàlid.
de: Bitte nutze eine gültige Programmiersprache.
es: Por favor, selecciona un lenguaje de programación válido.
fr: Veuillez choisir un langage de programmation valide.
hi: कृपया एक मान्य प्रोग्रामिंग भाषा चुनें
id: Silakan pilih bahasa pemrograman yang valid.
kab: Ttxil-k fren tutlayt n usihel ameɣtu.
ko: 올바른 프로그래밍 언어를 선택하십시오.
nl: Dit is geen geldige programmeertaal, selecteer van de opties.
pl: Proszę wybrać poprawny język programowania.
sr: Молимо вас да изаберете важећи програмски језик.
ta: Please தேர்ந்தெடு a valid programming language.
tr: Lütfen geçerli bir programlama dili seçin.
uk: Виберіть дійсну мову програмування.
zh_hans: 请选择有效的编程语言。

source: Programs
ar: البرامج
ca: Programes
de: Programme
eo: Programoj
es: Programas
fr: Programmes
hi: प्रोग्राम्स
id: Program terakhir yang dibagikan
kab: Ihalan
ko: 프로그램
nl: Programma's
pl: Programy
sr: Програми
ta: திட்டங்கள்
tr: Programlar
uk: Програми
zh_hans: 程序

# prompt_join_class
source: Do you want to join this class?
ar: هل تريد الإنضمام الى هذا الصف؟
ca: Vols unir-te a aquesta classe?
de: Willst du dieser Klasse beitreten?
eo: Ĉu aliĝi al ĉi tiu klaso?
es: Deseas unirte a la clase?
fr: Veux tu rejoindre cette classe ?
fy: Wolst oan dizze klas meidwaan?
hi: क्या आप इस कक्षा में शामिल होना चाहते हैं?
id: Apakah kamu ingin bergabung dengan kelas ini?
kab: Tebɣiḍ ad ternuḍ ɣer usmel-a?
ko: 이 수업에 참여하고 싶으신가요?
nl: Wil jij je inschrijven voor deze klas?
pl: Czy chcesz dołączyć do tej klasy?
sr: Да ли желите да се придружите овом разреду?
ta: இந்த வகுப்பில் சேர விரும்புகிறீர்களா?
tr: Bu sınıfa katılmak istiyor musunuz?
uk: Бажаєте приєднатися до цього класу?
zh_hans: 你想参加这个课程吗？

# provided_username_duplicates
source: You supplied the following usernames more than once: {usernames}
ar: لقد زودت اسماء المستخدمين هذه أكثر من مرة: {usernames}
ca: Has proporcionat els següents noms d'usuari més d'una vegada: {usernames}
es: Ha proporcionado los siguientes nombres de usuario más de una vez: {usernames}
nl: Je hebt de volgende gebruikersnamen meer dan eens opgegeven: {usernames}
sr: Пружили сте следећа корисничка имена више од једном: {usernames}
uk: Ви вказали такі імена користувачів кілька разів: {usernames}
zh_hans: 您多次提供了以下用户名：{usernames}

source: Public
ar: للعامة
ca: Públic
de: Öffentlich
es: Público
id: Publik
kab: Azayaz
ko: 공용
nl: Openbaar
pl: Publiczne
sr: Јавно
tr: Herkese açık
uk: Громадський
zh_hans: 公开

# public_adventures
source: Browse public adventures
ar: تصفح المغامرات العامة
ca: Navega per les aventures públiques
es: Explorar las aventuras públicas
kab: Inig deg tedyanin tizayazin
nl: Bekijk alle publieke avonturen
pl: Przeglądaj publiczne przygody
sr: Прегледај јавне авантуре
ta: பொது சாகசங்களை உலாவுக
uk: Перегляньте публічні пригоди
zh_hans: 浏览公开冒险

source: Public content
ar: محتوى للعامة
ca: Contingut públic
es: Contenidos de dominio público
kab: Agbur azayaz
nl: Publieke inhoud
pl: Publiczne treści
sr: Јавни садржај
ta: பொது உள்ளடக்கம்
uk: Загальнодоступний контент
zh_hans: 发布内容

# public_content_info
source: Here you can find our public adventures. These are adventures made by other teachers from all over the world. Take a look and feel free to use adventures in your own lessons.
ar: بإمكانك أن تجد مغامرتنا العامة هنا. هذه مغامرات انشأها معلمون آخرون من كل أنحاء العالم. ألق نظرة وخذ راحتك في استخدام أي من المغامرات في دروسك.
ca: Aquí pots trobar les nostres aventures públiques. Aquestes són aventures creades per altres professors de tot el món. Passeja una mica i no dubtis a utilitzar-les per a les teves classes.
es: Aquí puedes encontrar nuestras aventuras públicas. Estas son aventuras hechas por otros profesores de todo el mundo. Eche un vistazo y siéntase libre de usar las aventuras en sus propias lecciones.
sr: Овде можете пронаћи наше јавне авантуре. Ово су авантуре које су направили други наставници из целог света. Погледајте и слободно користите авантуре у вашим часовима.
ta: Here you can கண்டுபிடி our public adventures. These அரே adventures made by மற்றொன்று teachers இருந்து அனைத்தும் வீச்சலகு the world. Take a look and feel free பெறுநர் use adventures in your own lessons.
uk: Тут ви можете знайти наші публічні пригоди. Це пригоди інших вчителів з усього світу. Подивіться і сміливо використовуйте пригоди на своїх уроках.
zh_hans: 您可以在这里找到我们的公开冒险故事。这些是来自世界各地的其他教师制作的冒险故事。请浏览并随意在自己的课程中使用冒险故事。

# public_invalid
source: This agreement selection is invalid
ar: اختيار الاتفاقية هذا غير صالح
ca: Aquesta selecció d'acord no és vàlida
de: Diese Einverständnisauswahl ist ungültig
es: La selección de conformidad no es correcta
fr: Cette sélection d'accord est invalide
hi: यह अनुबंध चयन अमान्य है
id: Pilihan perjanjian ini tidak valid
ko: 이 약정 선택이 잘못되었습니다
nl: Deze waarde voor het beschikbaar maken van je avontuur is ongeldig
pl: Niepoprawna wartość zgody
sr: Овај избор споразума је неважећи
ta: This ஒப்பந்தம் தேர்வு is செல்லுபடியாகாத
tr: Bu anlaşma seçimi geçersizdir
uk: Цей вибір угоди недійсний
zh_hans: 此协议选择无效

source: Public profile
ar: الملف العام
ca: Perfil públic
de: Öffentliches Profil
eo: Publika profilo
es: Perfil público
fr: Profil public
hi: सार्वजानिक पार्श्वचित्र
id: Profil publik
kab: Amaɣnu azayaz
ko: 공개 프로필
nl: Openbaar profiel
pl: Profil publiczny
sr: Јавни профил
ta: Public சுயவிவரம்
tr: Herkese açık profil
uk: Загальнодоступний профіль
zh_hans: 公开个人资料

# public_profile_info
source: By selecting this box I make my profile visible for everyone. Be careful not to share personal information like your name or home address, because everyone will be able to see it!
ar: بتحديد هذا الخانة أجعل ملفي الشخصي مرئيًا للجميع. انتبه على عدم مشاركة معلومات شخصية مثل اسمك أو عنوان منزلك ، لأن الجميع سيتمكن من رؤيتها!
ca: En seleccionar aquesta casella, faig que el meu perfil sigui visible per a tothom. Vigila no compartir informació personal com el teu nom o adreça, perquè tothom podrà veure-ho!
de: Wenn ich dieses Kästchen auswähle, mache ich mein Profil für alle sichtbar. Sei vorsichtig und teile keine persönlichen Informationen wie deinen Namen oder deine Adresse, weil jeder in der Lage ist, es zu sehen!
es: Al seleccionar esta casilla, hago que mi perfil sea visible para todos. Tenga cuidado de no compartir información personal como su nombre o dirección de su casa, ¡porque todos podrán verla!
fr: En cochant cette case, je rends mon profil visible pour tout le monde. Attention à ne pas partager d'informations personnelles comme votre nom ou votre adresse personnelle, car tout le monde pourra les voir !
hi: इस बॉक्स को चुनकर मैं अपनी प्रोफ़ाइल को सभी के लिए दृश्यमान बनाता हूं। अपना नाम या घर का पता जैसी व्यक्तिगत जानकारी साझा न करने के लिए सावधान रहें, क्योंकि हर कोई इसे देख सकेगा!
id: Dengan memilih kotak ini saya membuat profil saya terlihat oleh semua orang. Berhati-hatilah untuk tidak membagikan informasi pribadi seperti nama atau alamat rumah Anda, karena semua orang dapat melihatnya!
ko: 이 상자를 선택함으로써 저는 제 프로필을 모든 사람들에게 보여지게 합니다. 이름이나 집 주소 같은 개인 정보는 모두가 볼 수 있기 때문에 공유하지 않도록 주의하세요!
nl: Bij het selecteren van deze box maak je jouw profiel zichtbaar voor iedereen. Wees voorzichtig met het delen van persoonlijke informatie zoals je naam en adres, iedereen kan het zien!
pl: Poprzez zaznaczenie tego pola wyboru zgadzam się na zrobienie mojego profilu widocznym dla wszystkich użytkowników platformy. Uważaj, żeby nie udostępniać swoich danych osobowych jak swoje imię oraz adres domowy ponieważ wszyscy mogą to zobaczyć!
sr: Одабиром ове кутије чиним свој профил видљивим за све. Пазите да не делите личне информације као што су ваше име или кућна адреса, јер ће сви моћи да их виде!
ta: இந்த பெட்டியைத் தேர்ந்தெடுப்பதன் மூலம் எனது சுயவிவரத்தை அனைவருக்கும் தெரியும். உங்கள் பெயர் அல்லது வீட்டு முகவரி போன்ற தனிப்பட்ட தகவல்களைப் பகிர்ந்து கொள்ளாமல் கவனமாக இருங்கள், ஏனென்றால் எல்லோரும் அதைப் பார்க்க முடியும்!
tr: Bu kutuyu seçerek profilimi herkes için görünür hale getiriyorum. Adınız veya ev adresiniz gibi kişisel bilgilerinizi paylaşmamaya dikkat edin, çünkü bunları herkes görebilecektir!
uk: Вибравши цей прапорець, я зроблю свій профіль видимим для всіх. Будьте обережні, не повідомляйте особисту інформацію, як-от ваше ім’я чи домашню адресу, тому що кожен зможе її побачити!
zh_hans: 通过选择此框，我使我的个人资料对所有人可见。请注意不要分享你的姓名或家庭住址等个人信息，因为每个人都能看到这些信息！

# public_profile_updated
source: Public profile updated, page will be re-loaded.
ar: تم تحديث الملف الشخصي العام.
ca: S'ha actualitzat el perfil públic, la pàgina es tornarà a carregar.
de: Öffentliches Profil wurde aktualisiert. Die Seite wird neu geladen.
eo: Publika profilo modifiĝis.
es: Perfil público actualizado, la página se recargará.
fr: Profil public mis à jour.
hi: सार्वजनिक प्रोफ़ाइल अद्यतन की गई।
id: Profil publik diperbarui, halaman akan dimuat ulang.
kab: Amaɣnu azayaz yettwaleqqem, asebter ad yales alluy.
ko: 공개 프로필이 업데이트되었습니다. 페이지가 다시 로드됩니다.
nl: Je openbare profiel is aangepast, pagina wordt herladen..
pl: Profil publiczny został zaktualizowany, strona zastanie przeładowana.
sr: Јавни профил ажуриран, страница ће бити поново учитана.
ta: பொது சுயவிவரம் புதுப்பிக்கப்பட்டது, பக்கம் மீண்டும் ஏற்றப்படும்.
tr: Herkese açık profiliniz güncellendi, sayfa yeniden yüklenecek.
uk: Публічний профіль оновлено, сторінка буде перезавантажена.
zh_hans: 公开资料已更新。

# question mark
source: a question mark
ar: علامة سؤال
bg: въпросителен знак
ca: un símbol d'interrogació
cs: otazník
de: ein Fragezeichen
eo: demandosigno
es: un signo de interrogación
fr: un point d'interrogation
fy: in fraachteken
hi: एक प्रश्न चिह्न
id: tanda tanya
kab: agaz n ussesten
ko: 물음표
nl: een vraagteken
pl: znak zapytania
sr: упитник
sw: alama ya swali
ta: ஒரு கேள்விக்குறி
tr: bir soru işareti
uk: знак питання
zh_hans: 问号

# quiz_logo_alt
source: Quiz logo
ca: Logo del qüestionari
fr: Logo du questionnaire
id: Logo kuis
ko: 퀴즈로고
pl: Logo quizu
sr: Лого квиза
tr: Kısa sınav logosu
uk: Вікторина логотип
zh_hans: 测验标志

source: Quiz score
ca: Puntuació del qüestionari
de: Quiz-Punkte
fr: Note du questionnaire
id: Skor kuis
ko: 퀴즈점수
pl: Wynik quizu
sr: Резултат квиза
tr: Kısa sınav puanı
uk: Оцінка вікторини
zh_hans: 测验分数

# quiz_tab
source: Quiz
ca: Qüestionari
fr: Questionnaire
id: Kuis
ko: 퀴즈
sr: Квиз
tr: Kısa sınav
uk: Вікторина
zh_hans: 测试

# quiz_threshold_not_reached
source: Quiz threshold not reached to unlock this level
ca: No s'ha superat el llindar del qüestionari per a desbloquejar aquest nivell
de: Quiz-Anforderungen zum Freischalten dieses Levels nicht erfüllt
fr: Seuil de quiz pour débloquer ce niveau n'est pas atteint
id: Ambang batas kuis tidak tercapai untuk membuka level ini
ko: 이 레벨의 잠금을 해제할 수 있는 퀴즈 임계값에 도달하지 못했습니다
nl: Minimale quiz score niet gehaald om dit level vrij te spelen
pl: Nie wykonano quizu potrzebnego do odblokowania tego poziomu
sr: Праг за квиз није достигнут да би се откључао овај ниво
tr: Bu seviyenin kilidini açmak için gereken kısa sınav puan eşiğine ulaşılmadı
uk: Поріг проходження тестування не досягнуто, щоб розблокувати цей рівень
zh_hans: 没有达到解锁该关卡所需的问答数量要求

# read_code_label
source: Read aloud
ca: Llegeix en veu alta
de: Vorlesen
es: Leer en voz alta
fr: Lire à voix haute
id: Bacakan dengan nyaring
ko: 큰 소리로 읽다
nl: Lees voor
pl: Czytaj na głos
sr: Читај наглас
tr: Yüksek sesle oku
uk: Прочитайте вголос
zh_hans: 大声读出来

# recent
source: My recent programs
ar: برامجي الأخيرة
bg: Моите посленди програми
ca: Els meus programes recents
de: Zuletzt verwendete Programme
eo: Miaj lastatempaj programoj
es: Mis programas recientes
fr: Mes programmes récents
fy: Myn programma's
hi: मेरे हाल के प्रोग्राम्स
id: Program-program terbaru saya
kab: Ihalan-iw imiranen
ko: 나의 최근 프로그램들
nl: Mijn programma's
pl: Moje najnowsze programy
sr: Моји недавни програми
sw: Programu zangu za hivi karibuni
ta: எனது அண்மைக் கால திட்டங்கள்
tr: Son uğraştığım programlarım
uk: Мої останні програми
zh_hans: 我最近的程序
