Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# not_enrolled
source: Looks like you are not in this class!
ar: يبدو أنك لست في هذا الصف!
bg: Изжлежда, че не си в този клас!
ca: Fa pinta que no hi ets pas a la classe!
cs: Zdá se, že do této třídy nepatříte!
de: Du bist anscheinend nicht für diesen Unterricht angemeldet!
eo: Ŝajne vi ne apartenas al ĉi tiu klaso!
es: ¡Parece que no perteneces a esta clase!
fr: On dirait que vous n’êtes pas dans cette classe !
hi: ऐसा लगता है कि आप इस कक्षा में नहीं हैं!
id: Sepertinya anda tidak ada di kelas ini!
kab: Akka d-yettban ulac-ik deg usmil-a!
ko: 당신은 이 반에 없는 것 같네요!
nl: Jij zit niet in deze klas!
pl: Wygląda na to, że nie jesteś członkiem tej klasy!
sr: Изгледа да нисте у овом разреду!
ta: நீங்கள் இந்த வகுப்பில் இல்லை என்று தெரிகிறது!
tr: Görünüşe göre bu sınıfta değilsiniz!
uk: Схоже, що ви не з цього класу!
vi: Có vẻ như bạn không ở trong lớp này!
zh_hans: 看来你不在这个班上！

# not_in_class_no_handin
source: You are not in a class, so there's no need for you to hand in anything.
ar: لست في صف، فليست هناك حاجة أن تُسلِّمَ أي شيء.
ca: No pertanys a aquesta classe, així que no cal que lliuris res.
de: Du bist in keiner Klasse, also besteht keine Notwendigkeit etwas abgeben.
es: No estás en clase, así que no es necesario que entregues nada.
fr: Tu n'es pas dans une classe, pas besoin de rendre quoi que ce soit.
id: Anda tidak berada di kelas, jadi Anda tidak perlu menyerahkan apa pun.
ko: 당신은 수업을 듣는 것이 아니기 때문에, 아무것도 제출할 필요가 없습니다.
nl: Jij zit niet in een klas, dus je hoeft niks in te leveren.
pl: Nie jesteś w żadnych zajęciach, więc nie musisz niczego oddawać.
sr: Нисте у одељењу, тако да нема потребе да предајете било шта.
ta: நீங்கள் ஒரு வகுப்பில் இல்லை, எனவே நீங்கள் எதையும் ஒப்படைக்க வேண்டிய அவசியமில்லை.
tr: Bir sınıfta değilsiniz, bu yüzden herhangi bir şey teslim etmenize gerek yok.
uk: Ви не в класі, тому вам не потрібно нічого здавати.
zh_hans: 你不在一个班级，所以不需要交任何东西。

# not_logged_in_cantsave
source: Your program will not be saved.
ar: برنامجك لن يُحفظ.
ca: El teu programa no es guardarà.
de: Dein Programm wird nicht gespeichert.
es: Tu programa no se guardará.
fr: Ton programme ne sera pas sauvegardé.
id: Program Anda tidak akan disimpan.
kab: Ahil-ik ur yettwaseklas ara.
ko: 프로그램이 저장되지 않습니다.
nl: Let op! Je programma wordt nu niet opgeslagen.
pl: Program nie zostanie zapisany.
sr: Ваш програм неће бити сачуван.
ta: உங்கள் நிரல் சேமிக்கப்படாது.
tr: Programınız kaydedilmeyecektir.
uk: Ваша програма не буде збережена.
zh_hans: 您的程序将不会被保存。

# not_logged_in_handin
source: You must be logged in to hand in an assignment.
ar: يجب أن تعمل تسجيل دخول كي تُسَلِّمَ واجبك.
ca: Has de registrar-te primer per lliurar una tasca.
de: Du musst eingeloggt sein, um eine Lösung abzugeben.
es: Debe iniciar sesión para entregar un trabajo.
fr: Un compte est nécessaire pour rendre un devoir.
id: Anda harus login untuk menyerahkan tugas.
ko: 할당을 제출하려면 로그인해야 합니다.
nl: Je moet ingelogd zijn om een opdracht in te leveren.
pl: Musisz się zalogować by oddać zadanie.
sr: Морате бити пријављени да бисте предали задатак.
ta: நீங்கள் ஒரு வேலையில் கையால் உள்நுழைய வேண்டும்.
tr: Bir ödevi teslim etmek için oturum açmış olmanız gerekir.
uk: Ви повинні увійти в систему, щоб здати завдання.
zh_hans: 必须登录才能提交作业。

# not_teacher
source: Looks like you are not a teacher!
ar: يبدو أنك لست معلم أو معلمة!
bg: Изглежда, че ти не си учител!
ca: Fa pinta que no ets un professor!
cs: Zdá se, že nejste učitel!
de: Du bist anscheinend nicht die Lehrkraft!
eo: Ŝajne vi ne estas instruisto!
es: ¡Parece que no eres profesor!
fr: On dirait que vous n’êtes pas enseignant !
hi: लगता है आप शिक्षक नहीं हैं!
id: Sepertinya Anda bukan seorang guru!
kab: Akka d-yettban kečč mačči d aselmad!
ko: 당신은 선생님이 아닌 것 같네요!
nl: Jij bent geen leraar!
pl: Wygląda na to, że nie jesteś nauczycielem!
sr: Изгледа да нисте наставник!
ta: நீங்கள் ஒரு ஆசிரியர் அல்ல என்று தெரிகிறது!
tr: Görünüşe göre bir öğretmen değilsiniz!
uk: Схоже, ви не вчитель!
vi: Có vẻ như bạn không phải là giáo viên!
zh_hans: 看来你不是一个老师!

# number
source: a number
ar: رقم
ca: un nombre
de: eine Zahl
eo: nombro
es: un número
fr: un nombre
hi: एक संख्या
id: sebuah angka
kab: aṭṭun
ko: 수
nl: een getal
pl: liczba
sr: број
ta: ஒரு எண்
tr: bir sayı
uk: число
zh_hans: 数字

# number_lines
source: Number of lines
ar: عدد السطور
ca: Nombre de línies
de: Anzahl an Zeilen
es: Número de líneas
fr: Nombre de lignes
id: Jumlah baris
kab: Amḍan n yizirigen
ko: 선수
nl: Aantal regels
pl: Numer linii
sr: Број линија
ta: வரிகளின் எண்ணிக்கை
tr: Satırların sayısı
uk: Кількість ліній
zh_hans: 行数

# number_of_errors
source: Number of errors: {number_of_errors}
ar: عدد الأخطاء: {number_of_errors}
ca: Nombre d'errors: {number_of_errors}
es: Número de errores: {number_of_errors}
kab: Amḍan n tuccḍiwin: {number_of_errors}
pl: Liczba błędów: {number_of_errors}
sr: Број грешака: {number_of_errors}
ta: பிழைகளின் எண்ணிக்கை: {number_of_errors}
uk: Кількість помилок: {number_of_errors}
zh_hans: 错误数量：{number_of_errors}

# number_programs
source: Number of programs ran
ca: Nombre de programes executats
de: Anzahl von Programmen
fr: Nombre de programmes exécutés
id: Jumlah program
ko: 실행된 프로그램 수
nl: Aantal programma's
pl: Liczba uruchomionych programów
sr: Број покренутих програма
tr: Çalıştırılan programların sayısı
uk: Кількість запущених програм
zh_hans: 运行了的程序数量

# one_level_error
source: You need to select at least one level.
ar: عليك أن تختار على الأقل مستوى واحدا.
ca: Has de seleccionar almenys un nivell.
es: Debes seleccionar al menos un nivel.
kab: Tesriḍ ad tferneḍ xerṣum yiwen uswir.
pl: Musisz wybrać co najmniej jeden poziom.
sr: Морате изабрати бар један ниво.
ta: நீங்கள் குறைந்தது ஒரு நிலையைத் தேர்ந்தெடுக்க வேண்டும்.
uk: Потрібно вибрати хоча б один рівень.
zh_hans: 你需要至少选择一个级别。

# only_you_can_see
source: Only you can see this program.
ar: بإمكانك أنت فحسب أن ترى هذا البرنامج.
ca: Només tu pots veure aquest programa.
de: Nur du kannst dieses Programm sehen.
es: Sólo tú puedes ver este programa.
fr: Seulement toi peut voir ce programme.
id: Hanya Anda yang dapat melihat program ini.
kab: Ala kečč i izemren ad twaliḍ ahil-a.
ko: 이 프로그램은 너만 볼 수 있다.
nl: Alleen jij kunt dit programma zien.
pl: Tylko ty widzisz ten program.
sr: Само ви можете видети овај програм.
ta: இந்த திட்டத்தை நீங்கள் மட்டுமே பார்க்க முடியும்.
tr: Bu programı sadece siz görebilirsiniz.
uk: Тільки ви можете бачити цю програму.
zh_hans: 只有你可以看到该程序。

source: Open
ar: افتح
bg: Отвори
ca: Obre
de: Öffnen
eo: Malfermi
es: Abrir
fr: Ouvrir
fy: Iepenje
hi: खुला
id: Buka
kab: Ldi
ko: 열다.
nl: Openen
pl: Otwórz
sr: Отвори
sw: Fungua
ta: திற
tr: Aç
uk: ВІДЧИНЕНО
zh_hans: 打开

source: Opening date
ar: تاريخ الافتتاح
ca: Data d'obertura
de: Öffnungsdatum
eo: Dato de komenco
es: Fecha de apertura
fr: Date d'ouverture
id: Tanggal pembukaan
kab: Azemz n twaledyawt
ko: 개시일자
nl: Openingsdatum
pl: Data rozpoczęcia
sr: Датум отварања
ta: திறக்கும் தேதி
tr: Açılış tarihi
uk: Дата відкриття
zh_hans: 开放日期

source: Opening dates
ar: تواريخ الافتتاح
ca: Dates d'obertura
de: Level verwalten
eo: Datoj de komenco
es: Fechas de apertura
fr: Dates d'ouverture
id: Tanggal pembukaan
kab: Izemzan n twaledyawt
ko: 개시일
nl: Openingsdata
pl: Daty rozpoczęcia
sr: Датуми отварања
ta: திறக்கும் தேதிகள்
tr: Açılış tarihleri
uk: Дати відкриття
zh_hans: 开放日期

source: Option
ar: خيار
ca: Opció
eo: Opcio
es: Opción
id: Pilihan
kab: Tanefrunt
ko: 옵션
nl: Optie
pl: Opcja
sr: Опција
ta: சூதம்
tr: Seçenek
uk: Варіант
zh_hans: 选项

source: or
ar: أو
bg: или
ca: o
de: oder
eo: aŭ
es: o
fr: ou
hi: या
id: atau
kab: neɣ
nl: of
pl: lub
sr: или
ta: அல்லது
tr: veya
uk: або
zh_hans: 或

source: Other
ar: آخر
bg: Друг
ca: Altres
cs: Jiné
de: divers
eo: Alia
es: Otro
fr: Autre
fy: Oars
hi: अन्य
id: Lainnya
kab: Wayeḍ
nl: Anders
pl: Inna
sr: Други
sw: Nyingine
ta: மற்றொன்று
tr: Diğer
uk: інше
zh_hans: 其他

# other_block
source: Another block language
ar: لغة برمجة أخرى تستعمل اللبنات البرمجية
ca: Un altre llenguatge de blocs
cs: Jiný blokový jazyk
de: Andere visuelle Programmierumgebung
eo: Alia bloka lingvo
es: Otro lenguaje basado en bloques
fr: Un autre langage à blocs
fy: In oare blokkentaal
hi: एक और ब्लॉक भाषा
id: Bahasa blok lainnya
kab: Tutlayt n usihel tayeḍ n yiḥedran
ko: 다른 블록 언어
nl: Een andere blokkentaal
pl: Inny język blokowy
sr: Други блок језик
ta: மற்றொரு தொகுதி மொழி
tr: Başka bir blok programlama dili
uk: Ще одна блокова мова
zh_hans: 另一种模块语言

source: Other settings
ar: اعدادات أخرى
ca: Altres eines
de: Andere Einstellungen
eo: Aliaj agordoj
es: Otras configuraciones
fr: Autres configurations
id: Pengaturan lainnya
kab: Iɣewwaren niḍen
nl: Andere instellingen
pl: Inne ustawienia
sr: Остала подешавања
ta: பிற அமைப்புகள்
tr: Diğer ayarlar
uk: Інші налаштування
zh_hans: 其他设置

# other_source
source: Other
ar: أمور أخرى
ca: Altres
de: Andere
es: Otro
fr: Autre
id: Lainnya
kab: Wayeḍ
nl: Anders
pl: Inne
sr: Друго
ta: மற்றொன்று
tr: Diğer
uk: інше
zh_hans: 其它

# other_text
source: Another text language
ar: لغة برمجية نصّية أخرى
ca: Un altre llenguatge textual
cs: Jiný textový jazyk
de: Andere Programmierprache
eo: Alia teksta lingvo
es: Otro lenguaje basado en texto
fr: Un autre langage textuel
fy: In oare teksttaal
hi: एक और पाठ भाषा
id: Bahasa teks lainnya
kab: Tutlayt n usihel aḍrisan niḍen
ko: 다른 텍스트 언어
nl: Een andere teksttaal
pl: Inny język tekstowy
sr: Други текстуални језик
ta: மற்றொரு உரை மொழி
tr: Başka bir metin dili
uk: Інша мова тексту
zh_hans: 另一种文本语言

# overwrite_warning
source: You already have a program with this name, saving this program will replace the old one. Are you sure?
ar: لديك برنامج بهذا اإسم بالفعل، سيؤدي حفظ هذا البرنامج إلى استبدال البرنامج القديم. هل أنت متأكد؟
ca: Ja tens un programa amb aquest nom, guardar aquest programa substituirà l'anterior. Estàs segur?
de: Du hast bereits eine Programm mit diesem Namen, wenn du jetzt speicherst überschreibst du das Vorhandene. Bist du dir sicher?
es: Ya tienes un programa con este nombre, guardar este programa reemplazará al anterior. ¿Estás seguro/a?
fr: Tu as déjà un programme avec ce nom, sauvegarder celui en cours remplacera l'ancien. Confirmer ?
hi: आपके पास पहले से ही इस नाम का एक प्रोग्राम है, इस प्रोग्राम को सहेजने से पुराना प्रोग्राम अधिलेखित हो जाएगा। क्या आपको यकीन है?
id: Anda sudah mempunyai program dengan nama ini, menyimpan program ini akan menggantikan program lama. Apa kamu yakin?
ko: 이 이름의 프로그램이 이미 있습니다. 이 프로그램을 저장하면 이전 프로그램이 대체됩니다. 정말입니까?
nl: Je hebt al een programma met deze naam, opslaan met deze naam overschrijft het oude programma. Weet je het zeker?
pl: Już posiadasz zapisany program o tej samej nazwie. Zapisanie tego programu nadpisze poprzedni program. Czy chcesz kontynuować?
sr: Већ имате програм са овим именом, чување овог програма ће заменити стари. Да ли сте сигурни?
ta: உங்களிடம் ஏற்கனவே இந்த பெயருடன் ஒரு நிரல் உள்ளது, இந்த நிரலைச் சேமிப்பது பழையதை மாற்றும். நீங்கள் உறுதியாக இருக்கிறீர்களா?
tr: Bu isimde bir programınız zaten var, bu programı kaydederseniz eskisinin yerini alacaktır, ve eskisi silinecektir. Emin misiniz?
uk: У вас уже є програма з такою назвою, збереження цієї програми замінить стару. Ви впевнені?
zh_hans: 您已经有一个同名的程序，保存此程序将替换旧程序。你确定吗？

source: Owner
ar: المالك
ca: Propietari
es: Dueño
kab: Bab-is
nl: Eigenaar
pl: Właściciel
sr: Власник
ta: உரிமையாளர்
uk: Власник
zh_hans: 所有者

# page_not_found
source: We couldn't find that page!
ar: لم نستطع ايجاد تلك الصفحة!
bg: Не можахме да намерим тази страница!
ca: No hem pogut trobar aquesta pàgina!
cs: Tuto stránku nelze najít!
de: Die Seite konnte nicht gefunden werden!
eo: Paĝo ne ekzistas!
es: ¡No pudimos encontrar esta página!
fr: Nous n’avons pas pu trouver cette page !
hi: हमें वह पृष्ठ नहीं मिला!
id: Kami tidak dapat menemukan halaman itu!
kab: Negguma ad naf asebter-a!
ko: 이 페이지를 찾을 수가 없네요!
nl: We konden deze pagina niet vinden!
pl: Nie możemy odnaleźć tej strony!
sr: Нисмо могли да пронађемо ту страницу!
ta: அந்த பக்கத்தை எங்களால் கண்டுபிடிக்க முடியவில்லை!
tr: Aradığın sayfayı bulamadık!
uk: Ми не змогли знайти цю сторінку!
zh_hans: 无法找到该页面！

# pair_with_teacher
source: I would like to be paired with another teacher for help
ar: أرغب أن أُربطَ بمعلم آخر للمساعدة
ca: M'agradaria ser emparellat amb un altre professor per obtenir ajuda
es: Me gustaría que me emparejaran con otro maestro para que me ayude
nl: Breng mij in contact met een ervaren Hedy-leraar voor tips
pl: Chciałbym zostać sparowany z innym nauczycielem w celu uzyskania pomocy
sr: Желим да будем упарен са другим наставником за помоћ
ta: உதவிக்காக மற்றொரு ஆசிரியருடன் சோடியாக இருக்க விரும்புகிறேன்
uk: Я хотів би, щоб мене об’єднали з іншим учителем для допомоги
zh_hans: 我想和另一位老师结对帮手

# parsons_title
source: Puzzle
ca: Puzle
id: Teka-teki
ko: 퍼즐
nl: Slepen
pl: Łamigłówka
sr: Слагалица
tr: Yap-boz
uk: Головоломка
zh_hans: 谜

source: Password
ar: كلمة المرور
bg: Парола
ca: Contrasenya
cs: Heslo
de: Passwort
eo: Pasvorto
es: Contraseña
fr: Mot de passe
fy: Wachtwurd
hi: सांकेतिक शब्द
kab: Awal n uɛeddi
ko: 비밀번호
nl: Wachtwoord
pl: Hasło
sr: Лозинка
sw: Nenosiri
ta: கடவுச்சொல்
tr: Şifre
uk: Пароль
zh_hans: 密码

# password_change_not_allowed
source: You're not allowed to change the password of this user.
ar: لا يمكنك تغيير كلمة المرور لهذا المستخدم.
ca: No tens permís per canviar la contrasenya d'aquest usuari.
de: Du hast nicht die Erlaubnis das Passwort dieses Nutzers zu ändern.
es: No puedes cambiar la contraseña a este usuario.
fr: Vous n'avez pas l'autorisation de changer le mot de passe de ce compte.
hi: आपको इस उपयोगकर्ता का पासवर्ड बदलने की अनुमति नहीं है
id: Anda tidak diperbolehkan mengubah kata sandi pengguna ini.
ko: 이 사용자의 암호를 변경할 수 없습니다.
nl: Je hebt geen rechten op het wachtwoord van deze gebruiker te wijzigen.
pl: Nie możesz zmienić hasła tego użytkownika.
sr: Није вам дозвољено да промените лозинку овог корисника.
ta: இந்த பயனரின் கடவுச்சொல்லை மாற்ற உங்களுக்கு இசைவு இல்லை.
tr: Bu kullanıcının parolasını değiştirme izniniz yok.
uk: Вам заборонено змінювати пароль цього користувача.
zh_hans: 您无权更改此用户的密码。

# password_change_prompt
source: Are you sure you want to change this password?
ar: هل أنت متأكد أنك تريد تغيير كلمة المرور هذه؟
ca: Estàs segur que vols canviar aquesta contrasenya?
de: Bist Du sicher, dass Du dieses Passwort ändern willst?
eo: Ĉu vi certe volas ŝanĝi ĉi tiun pasvorton?
es: ¿Estás seguro de que quieres cambiar la contraseña?
fr: Es-tu sur de vouloir changer ce mot de passe ?
hi: क्या आप वाकई इस सांकेतिक शब्द को बदलना चाहते हैं?
id: Apakah Anda yakin ingin mengubah kata sandi ini?
kab: D tidet tebɣiḍ ad tesnefleḍ awal-a n uɛeddi?
ko: 이 암호를 변경하시겠습니까?
nl: Weet je zeker dat je dit wachtwoord wilt wijzigen?
pl: Jesteś pewien że chcesz zmienić hasło?
sr: Да ли сте сигурни да желите да промените ову лозинку?
ta: இந்த கடவுச்சொல்லை மாற்ற விரும்புகிறீர்களா?
tr: Bu şifreyi değiştirmek istediğinizden emin misiniz?
uk: Ви впевнені, що хочете змінити цей пароль?
zh_hans: 你确定要更改此密码吗？

# password_change_success
source: Password of your student is successfully changed.
ar: تم تغيير كلمة المرور للتلميذ الخاص بك بنجاح.
ca: La contrasenya del teu estudiant s'ha canviat correctament.
de: Das Passwort der Person wurde erfolgreich geändert.
es: Se ha cambiado la contraseña de tu alumno con éxito.
fr: Le mot de passe de votre élève a été modifié.
hi: आपके छात्र का पासवर्ड सफलतापूर्वक बदल दिया गया है
id: Kata sandi siswa Anda berhasil diubah.
kab: Awal n uɛeddi n unelmad-ik yettwasenfel akken iwata.
ko: 학생의 비밀번호가 성공적으로 변경되었습니다.
nl: Wachtwoord van jouw leerling is succesvol gewijzigd.
pl: Hasło twojego ucznia zostało zmienione.
sr: Лозинка вашег ученика је успешно промењена.
ta: உங்கள் மாணவரின் கடவுச்சொல் வெற்றிகரமாக மாற்றப்படுகிறது.
tr: Öğrencinizin şifresi başarıyla değiştirilmiştir.
uk: Пароль вашого студента успішно змінено.
zh_hans: 学生的密码已成功更改。

# password_invalid
source: Your password is invalid.
ar: كلمة المرور الخاصة بك غير صالحة.
ca: La teva contrasenya no és vàlida.
de: Dein Passwort ist ungültig.
eo: Via pasvorto ne validas.
es: Tu contraseña no es válida.
fr: Votre mot de passe n'est pas valide.
fy: Je wachtwoord is ongeldig
hi: आपका पासवर्ड अमान्य है
id: Kata sandi Anda tidak valid.
kab: Awal-ik n uɛeddi d arameɣtu.
ko: 암호가 올바르지 않습니다.
nl: Je wachtwoord is ongeldig.
pl: Twoje hasło jest niepoprawne.
sr: Ваша лозинка је неважећа.
ta: உங்கள் கடவுச்சொல் தவறானது.
tr: Şifreniz geçersiz.
uk: Ваш пароль недійсний.
zh_hans: 你的密码无效。

# password_repeat
source: Repeat password
ar: اعادة كلمة المرور
bg: Повтаряне на паролата
ca: Repeteix la contrasenya
cs: Zopakuj heslo
de: Wiederhole Passwort
eo: Retajpu pasvorton
es: Repetir contraseña
fr: Répéter le mot de passe
fy: Werhelje dyn wachtwurd
hi: सांकेतिक शब्द को दोहराएं
id: Ulangi password
kab: Ales i wawal n uɛeddi
ko: 비밀번호 재입력
nl: Herhaal je wachtwoord
pl: Powtórz hasło
sr: Понови лозинку
sw: Rudia nenosiri
ta: கடவுச்சொல்லை மீண்டும் செய்யவும்
tr: Şifreyi yinele
uk: Повторіть пароль
zh_hans: 重复输入密码

# password_resetted
source: Your password has been successfully reset. You are being redirected to the login page.
ar: تم إعادة ضبط كلمة المرور الخاصة بك بنجاح، سيتم إعادة تحويلك إلى صفحة تسجيل الدخول.
ca: La teva contrasenya s'ha restablert correctament. Seràs redirigit a la pàgina d'inici de sessió.
cs: Tvé heslo bylo úspěšně obnoveno. Prosím přihlaš se.
de: Dein Passwort ist erfolgreich zurückgesetzt worden. Bitte log dich ein.
es: Tu contraseña ha sido cambiada exitosamente. Ya puedes entrar nuevamente a tu cuenta usando la nueva contraseña.
fr: Ton mot de passe a été réinitialisé avec succès. Tu vas être redirigé vers la page de connexion.
fy: Dyn wachtwurd is reset. Kinst no ynlogge.
hi: आपका सांकेतिक शब्द सफलतापूर्वक कायम हो गया है| कृपया लॉगिन करें|
id: Password kamu sudah berhasil di-set ulang. Silakan login.
ko: 비밀번호가 리셋되었습니다. 로그인 페이지로 리디렉션됩니다.
nl: Je wachtwoord is gereset. Je wordt doorgestuurd naar de inlogpagina.
pl: Twoje hasło zostało zresetowane. Zostajesz przekierowany do strony logowania.
sr: Ваша лозинка је успешно ресетована. Бићете преусмерени на страницу за пријаву.
sw: Nenosiri lako limewekwa upya kwa mafanikio. Tafadhali login.
ta: உங்கள் கடவுச்சொல் வெற்றிகரமாக மீட்டமைக்கப்பட்டுள்ளது. நீங்கள் உள்நுழைவு பக்கத்திற்கு திருப்பி விடப்படுகிறீர்கள்.
tr: Şifreniz başarıyla sıfırlandı. Giriş sayfasına yönlendiriliyorsunuz.
uk: Ваш пароль успішно скинуто. Вас буде перенаправлено на сторінку входу.
zh_hans: 你的密码已成功重置。你将被重定向到登录页面。

# password_six
source: Your password must contain at least six characters.
ar: كلمة المرور المختارة يجب أن تتكون من ستة أحرف على الأقل.
ca: La teva contrasenya ha de contenir almenys sis caràcters.
cs: Heslo musí obsahovat alespoň šest znaků.
de: Dein Passwort muss mindestens sechs Zeichen enthalten.
es: La contraseña debe contener al menos seis caracteres.
fr: Votre mot de passe doit contenir au moins 6 caractères.
fy: Dyn wachtwurd moat teminsten 6 letters hawwe.
hi: सांकेतिक शब्द में कम से कम छह वर्ण होना चाहिए|
id: Kata sandi Anda harus mengandung setidaknya enam karakter.
ko: 비밀번호는 최소 6자 이상이어야 합니다.
nl: Je wachtwoord moet minstens 6 letters hebben.
pl: Twoje hasło musi zawierać co najmniej sześć znaków.
sr: Ваша лозинка мора садржати најмање шест карактера.
sw: Nenosiri lazima kiwe na angalau herufi sita.
ta: உங்கள் கடவுச்சொல்லில் குறைந்தது ஆறு எழுத்துக்கள் இருக்க வேண்டும்.
tr: Parolanız en az altı karakter içermelidir.
uk: Ваш пароль має містити не менше шести символів.
zh_hans: 你的密码必须至少包含六个字符。

source: Password updated.
ar: تم تحديث كلمة المرور.
ca: Contrasenya actualitzada.
cs: Heslo bylo změněno.
de: Das Passwort wurde aktualisiert.
eo: Pasvorto ŝanĝiĝis.
es: Contraseña actualizada.
fr: Mot de passe mis à jour.
fy: Dyn wachtwurd is oanpast.
hi: सांकेतिक शब्द अद्यतन किया गया|
id: Password berhasil diubah.
kab: Awal n uɛeddi yettwabeddel akken iwata.
ko: 암호가 업데이트되었습니다.
nl: Je wachtwoord is aangepast.
pl: Hasło zostało zaktualizowane.
sr: Лозинка ажурирана.
sw: Nenosiri umesasishwa.
ta: கடவுச்சொல் புதுப்பிக்கப்பட்டது.
tr: Şifre güncellendi.
uk: Пароль оновлено.
zh_hans: 密码已更新。

# passwords_six
source: All passwords need to be six characters or longer.
ar: كلمة المرور يجب أن تتكون من ستة أحرف أو أكثر.
bg: Паролата трябва да съдържа поне 6 символа.
ca: Totes les contrasenyes han de tenir sis caràcters o més.
de: Das Passwort muss aus mindestens sechs Zeichen bestehen.
es: Todas las contraseñas deben tener 6 carácteres o más.
fr: Tous les mots de passes doivent contenir au moins 6 caractères.
id: Semua kata sandi harus terdiri dari enam karakter atau lebih.
ko: 모든 비밀번호는 6자 이상이어야 합니다.
nl: Alle wachtwoorden moeten 6 of meer karakters zijn.
pl: Wszystkie hasła muszą mieć co najmniej sześć znaków.
sr: Све лозинке морају бити дуге најмање шест карактера.
ta: அனைத்து கடவுச்சொற்களும் ஆறு எழுத்துக்கள் அல்லது அதற்கு மேற்பட்டதாக இருக்க வேண்டும்.
tr: Tüm parolaların altı karakter veya daha uzun olması gerekir.
uk: Усі паролі мають містити не менше шести символів.
zh_hans: 所有的密码都至少需要六个字符或更长。

# passwords_too_short
source: Passwords must be at least 6 characters long. Correct the following passwords, so that they are at least 6 symbols: {passwords}
ar: كلمات المرور يجب أن تتكون على الأقل من 6 حروف. أصلح كلمات المرور هذه بحث تكون على الأقل من ستة حروف: {passwords}
ca: Les contrasenyes han de tenir almenys 6 caràcters. Corregeix les següents contrasenyes perquè tinguin almenys 6 caràcters: {passwords}
es: Las contraseñas deben tener al menos 6 caracteres. Corrige las siguientes contraseñas, de modo que sean al menos 6 símbolos: {passwords}
sr: Лозинке морају бити дуге најмање 6 карактера. Исправите следеће лозинке, тако да буду најмање 6 симбола: {passwords}
ta: கடவுச்சொற்கள் குறைந்தது 6 எழுத்துக்கள் நீளமாக இருக்க வேண்டும். பின்வரும் கடவுச்சொற்களை சரிசெய்யவும், இதனால் அவை குறைந்தது 6 சின்னங்களாக இருக்கும்: {passwords}
uk: Довжина паролів має бути не менше 6 символів. Виправте наступні паролі, щоб вони містили щонайменше 6 символів: {passwords}
zh_hans: 密码长度必须至少为 6 个字符。请更正以下密码，使其至少包含 6 个符号：{passwords}

source: Pending invites
ar: الدعوات قيد الإنتظار
ca: Invitacions pendents
de: Ausstehende Einladungen
es: Invitaciones pendientes
fr: Invitations en attente
hi: लंबित आमंत्रण
id: Undangan yang tertunda
kab: Tinubggiwin i yettwaɛelqen
ko: 초대 보류 중
nl: Openstaande uitnodigingen
pl: Oczekujące zaproszenia
sr: Позиви на чекању
ta: நிலுவையில் உள்ள அழைப்புகள்
tr: Bekleyen davetler
uk: Очікують запрошення
zh_hans: 等待邀请

# people_with_a_link
source: Other people with a link can see this program. It will also appear on your public profile page, if you have one.
ar: أي أناس آخرين بحوزتهم الرابط سيستطيعون رؤية هذا البرنامج. سيُعرض أيضا في صفحتك المعروضة للعامة، إن كانت لك صفحة للعامة.
de: Andere, die einen Link haben, können dieses Programm sehen. Es kann auch auf der Entdecke-Seite gefunden werden.
fr: D'autres personnes peuvent voir ce programme. Il est visible sur la page « Explorer ».
id: Orang lain yang memiliki tautan dapat melihat program ini. Itu juga dapat ditemukan di halaman "Jelajahi".
ko: 이 프로그램은 링크가 있는 다른 사람들도 볼 수 있으며, '탐색' 페이지에서도 볼 수 있다.
ta: இணைப்பு உள்ள மற்றவர்கள் இந்த திட்டத்தைக் காணலாம். உங்களிடம் ஒன்று இருந்தால் இது உங்கள் பொது சுயவிவரப் பக்கத்திலும் தோன்றும்.
uk: Інші люди, які мають посилання, можуть бачити цю програму. Він також з’явиться на сторінці загальнодоступного профілю, якщо він у вас є.
zh_hans: 有链接的其他人可以看到这个程序。也可以在“探索”页面上找到它。

source: percentage
ca: percentatge
de: Anteil
fr: pourcentage
id: persentase
ko: 백분율
nl: procent
pl: odsetek
sr: проценат
tr: yüzde
uk: відсоток
zh_hans: 百分比

# period
source: a period
ar: نقطة
bg: точка
ca: un període
cs: tečka
de: ein Punkt
eo: punkto
es: un punto
fr: un point
fy: in punt
hi: एक लाघव चिन्ह
id: titik
kab: tanzagt
ko: 마침표
nl: een punt
pl: kropka
sr: тачка
ta: ஒரு காலம்
tr: bir nokta
uk: період
zh_hans: 句号
