Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# update_adventure_prompt
source: Are you sure you want to update this adventure?
ar: هل أنت متأكد أنك تريد تعديل هذه المغامرة؟
ca: Estàs segur que vols actualitzar aquesta aventura?
de: Bist du sicher, dass du dieses Abenteuer updaten möchtest?
eo: Ĉu vi certas, ke vi volas modifi ĉi tiun aventuron?
es: ¿Estás seguro de que quieres actualizar esta aventura?
fr: Es-tu sur de vouloir mettre cette aventure à jour ?
hi: क्या आप वाकई इस adventure को अद्यतन करना चाहते हैं?
id: Apakah Anda yakin ingin memperbarui petualangan ini?
ko: 이 모험을 업데이트하시겠습니까?
nl: Weet je zeker dat je dit avontuur wilt bijwerken?
pl: Czy na pewno chcesz zaktualizować to wyzwanie?
sr: Да ли сте сигурни да желите да ажурирате ову авантуру?
ta: இந்த சாகசத்தை நீங்கள் புதுப்பிக்க விரும்புகிறீர்களா?
tr: Bu macerayı güncellemek istediğinize emin misiniz?
uk: Ви впевнені, що хочете оновити цю пригоду?
zh_hans: 你确定要更新这个探险活动吗？

# update_public
source: Update public profile
ar: تحديث الملف العام
ca: Actualitza el perfil públic
de: Öffentliches Profil-Update
eo: Ĝisdatigi publikan profilon
es: Actualizar perfil público
fr: Modifier le profil public
hi: सार्वजनिक प्रोफ़ाइल अद्यतन करें
id: Perbarui profil publik
kab: Leqqem amaɣnu azayaz
ko: 공개 프로필 업데이트
nl: Openbaar profiel opslaan
pl: Zaktualizuj profil publiczny
sr: Ажурирај јавни профил
ta: பொது சுயவிவரத்தைப் புதுப்பிக்கவும்
tr: Herkese açık profili güncelle
uk: Оновити публічний профіль
zh_hans: 更新公开的个人资料

# updating_indicator
source: Updating
ar: جاري التحديث
ca: Actualitzant
de: Updatet
es: Actualizando
fr: Mise à jour en cours
id: Memperbarui
ko: 업데이트 중
nl: Avonturen worden opgeslagen
pl: Aktualizowanie
sr: Ажурирање
ta: புதுப்பித்தல்
tr: Güncelleniyor
uk: Оновлення
zh_hans: 更新

# use_custom_passwords
source: Provide your own passwords
ar: زود كلمات المرور
ca: Proporciona les teves pròpies contrasenyes
es: Proporcione sus propias contraseñas
sr: Пружите своје лозинке
ta: உங்கள் சொந்த கடவுச்சொற்களை வழங்கவும்
uk: Введіть власні паролі
zh_hans: 提供您自己的密码

# use_generated_passwords
source: Auto generate passwords
ar: أنشأ كلمات المرور تلقائيا
ca: Generar contrasenyes automàticament
es: Generar automáticamente contraseñas
nl: Automatisch wachtwoorden genereren
sr: Аутоматски генеришите лозинке
ta: தானாக கடவுச்சொற்களை உருவாக்குங்கள்
uk: Автоматична генерація паролів
zh_hans: 自动生成密码

# use_of_blanks_exception
source: Use of blanks in programs
ar: استخدام الفراغات في البرامج
ca: Ús d'espais en blanc als programes
de: Nutzung von Leerzeichen in Programmen
es: Uso de espacios en blanco en los programas
id: Penggunaan spasi dalam program
ko: 프로그램에서 빈칸 사용
nl: Gebruik van spaties in programma's
pl: Wykorzystanie pustych miejsc w programach
sr: Употреба празнина у програмима
ta: நிரல்களில் வெற்றிடங்களைப் பயன்படுத்துதல்
tr: Programlarda boşlukların kullanılması
uk: Використання пробілів у програмах
zh_hans: 程序中空格的使用

# use_of_nested_functions_exception
source: Use of nested functions
ar: استخدام الدوال المتداخلة
ca: Ús de funcions imbricades
es: Uso de funciones anidadas
id: Penggunaan fungsi bersarang
ko: 중첩 함수 사용
nl: Gebruik van genestte functies
pl: Wykorzystanie zagnieżdżonych funkcji
sr: Употреба угнежђених функција
ta: உள்ளமைக்கப்பட்ட செயல்பாடுகளின் பயன்பாடு
tr: İç içe fonksiyonların kullanımı
uk: Використання вкладених функцій
zh_hans: 嵌套函数的使用

source: Used in:
ar: مُستخدم في:
ca: Utilitzat a:
es: Utilizado en:
nl: Gebruikt in:
pl: Wykorzystane w:
sr: Коришћено у:
ta: இதில் பயன்படுத்தப்படுகிறது:
uk: Використовується в:
zh_hans: 用于：

source: user
ar: مستخدم
ca: usuari
de: Nutzer
eo: uzanto
es: usuario
fr: personne
id: pengguna
ko: 사용자
nl: gebruiker
pl: Nazwa użytkownika
sr: корисник
ta: பயனர்
tr: kullanıcı
uk: користувача
zh_hans: 用户

# user_inexistent
source: This user doesn't exist
ca: Aquest usuari no existeix
de: Dieser Nutzer existiert nicht
fr: Cet utilisateur n'existe pas
id: Pengguna ini tidak ada
ko: 이 사용자는 존재하지 않습니다
nl: Deze gebruiker bestaat niet
pl: Ten użytkownik nie istnieje
sr: Овај корисник не постоји
tr: Bu kullanıcı mevcut değil
uk: Цього користувача не існує
zh_hans: 此用户不存在

# user_not_private
source: This user either doesn't exist or doesn't have a public profile
ar: هذا الحساب إما غير موجود أو لا يوجد لديه ملف شخصي عام
ca: Aquest usuari no existeix o no té perfil públic
de: Dieser Nutzer existiert nicht oder hat kein öffentliches Profil
es: Este usuario o bien no existe o no tiene un perfil público
fr: Cet utilisateur n’existe pas ou n’a pas de profil public
hi: यह उपयोगकर्ता मौजूद नहीं है या उसकी कोई सार्वजनिक प्रोफ़ाइल नहीं है
id: Pengguna ini tidak ada atau tidak memiliki profil publik
kab: Aseqdac-a ulac-it neɣ ur yesɛi ara amaɣnu azayaz
ko: 이 사용자가 존재하지 않거나 공용 프로필이 없습니다
nl: Deze gebruiker bestaat niet of heeft geen openbaar profiel
pl: Ten użytkownik nie istnieje lub nie posiada publicznego profilu
sr: Овај корисник или не постоји или нема јавни профил
ta: இந்த பயனருக்கு இல்லை அல்லது பொது சுயவிவரம் இல்லை
tr: Bu kullanıcı ya mevcut değil ya da herkese açık bir profili yok
uk: Цей користувач або не існує, або не має публічного профілю
zh_hans: 此用户不存在或没有公开个人资料

source: Username
ar: اسم المستخدم
bg: Потребителско име
ca: Nom d'usuari
cs: Uživatelské jméno
de: Benutzername
eo: Salutnomo
es: Usuario
fr: Nom d'utilisateur
fy: Brûkersnamme
hi: उपयोगकर्ता नाम
id: Nama Pengguna
kab: Isem n useqdac
ko: 사용자 이름
nl: Gebruikersnaam
pl: Nazwa użytkownika
sr: Корисничко име
sw: Jina la mtumiaji
ta: பயனர்பெயர்
tr: Kullanıcı Adı
uk: Ім'я користувача
zh_hans: 用户名

# username_contains_invalid_symbol
source: Usernames cannot contain the symbol ':' or '@'. Remove these symbols from following usernames: {usernames}
ar: لا يمكن أن تحتوي أسماء المستخدمين على العلامة ':' أو '@'. أزل أيا من العلامتين من أسماء المستخدمين هذه: {usernames}
ca: Els noms d'usuari no poden contenir els símbols ':' o '@'. Elimina aquests símbols dels següents noms d'usuari: {usernames}
es: Los nombres de usuario no pueden contener los símbolos ':' o '@'. Elimine estos símbolos de los siguientes nombres de usuario: {usernames}
nl: Gebruikersnamen mogen het symbool ':' of '@' niet bevatten. Verwijder deze symbolen uit de volgende gebruikersnamen: {usernames}
sr: Корисничка имена не могу садржати симбол ':' или '@'. Уклоните ове симболе из следећих корисничких имена: {usernames}
ta: பயனர்பெயர்கள் 'அல்லது'@'என்ற குறியீட்டைக் கொண்டிருக்க முடியாது. பயனர்பெயர்களைப் பின்பற்றுவதிலிருந்து இந்த சின்னங்களை அகற்றவும்: {usernames}
uk: Імена користувачів не можуть містити символ «:» або «@». Видаліть ці символи з таких імен користувачів: {usernames}
zh_hans: 用户名不能包含符号“:”或“@”。从以下用户名中删除这些符号：{usernames}

# username_contains_separator
source: Usernames cannot contain a semicolon. Perhaps you want to supply your own passwords? If so, click the passwords toggle and create the accounts again. If this is not the case, remove the semicolon from the following usernames: {usernames}
ar: لا يمكن أن تحتوي أسماء المستخدمين على فاصلة منقوطة. هل ترغب أن تستخدم كلمات مرور الخاصة؟ إذا كان الأمر كذلك، فاضغط على زر تبديل كلمات المرور وأعد إنشاء الحسابات. إذا لم يكن الأمر كذلك، فاحذف الفاصلة المنقوطة من أسماء المستخدمين التالية: {usernames}
ca: Els noms d'usuari no poden contenir un punt i coma. Potser estàs intentant proporcionar les teves pròpies contrasenyes? Si és així, fes clic al commutador de contrasenyes i crea els comptes de nou. Si no és el cas, elimina el punt i coma dels següents noms d'usuari: {usernames}
es: Los nombres de usuario no pueden contener un punto y coma. ¿Quizás quiera proporcionar sus propias contraseñas? Si es así, haga clic en el interruptor de contraseñas y cree las cuentas de nuevo. Si este no es el caso, elimine el punto y coma de los siguientes nombres de usuario: {usernames}
nl: Gebruikersnamen mogen geen puntkomma bevatten. Wil je misschien jouw eigen wachtwoorden opgeven? Klik dan op de wachtwoorden-schakelaar en maak de accounts opnieuw aan. Als dit niet het geval is, verwijder je de puntkomma uit de volgende gebruikersnamen: {usernames}
sr: Корисничка имена не могу садржати тачку зарез. Можда желите да пружите своје лозинке? Ако је тако, кликните на прекидач за лозинке и креирајте налоге поново. Ако то није случај, уклоните тачку зарез из следећих корисничких имена: {usernames}
ta: பயனர்பெயர்கள் அரைக்காற்புள்ளியைக் கொண்டிருக்க முடியாது. உங்கள் சொந்த கடவுச்சொற்களை வழங்க விரும்புகிறீர்களா? அப்படியானால், கடவுச்சொற்கள் மாறுவதைக் சொடுக்கு செய்து கணக்குகளை மீண்டும் உருவாக்கவும். இது அவ்வாறு இல்லையென்றால், பின்வரும் பயனர்பெயர்களிலிருந்து அரைக்காற்புள்ளியை அகற்றவும்: {usernames}
uk: Імена користувачів не можуть містити крапку з комою. Можливо, ви хочете надати власні паролі? Якщо так, натисніть перемикач паролів і створіть облікові записи знову. Якщо це не так, видаліть крапку з комою з таких імен користувачів: {usernames}
zh_hans: 用户名不能包含分号。也许您想提供自己的密码？如果是这样，请单击密码切换并重新创建帐户。如果不是这种情况，请从以下用户名中删除分号：{usernames}

# username_empty
source: You didn't enter an username!
ar: لم تدخل اسم المستخدم!
ca: No has introduït un nom d'usuari!
de: Du hast keinen Nutzernamen eingegeben!
eo: Vi ne tajpis salutnomon!
es: ¡No has introducido un nombre de usuario!
fr: Tu n'as pas entré de pseudo !
hi: आपने उपयोगकर्ता नाम दर्ज नहीं किया!
id: Anda tidak memasukkan nama pengguna!
ko: 사용자 이름을 입력하지 않았습니다!
nl: Je hebt geen gebruikersnaam ingevuld!
pl: Nie wpisałeś nazwy użytkownika!
sr: Нисте унели корисничко име!
ta: நீங்கள் ஒரு பயனர்பெயரை உள்ளிடவில்லை!
tr: Bir kullanıcı adı girmediniz!
uk: Ви не ввели ім'я користувача!
zh_hans: 你没有输入用户名！

# username_invalid
source: Your username is invalid.
ar: اسم المستخدم الخاص بك غير صالح.
ca: El teu nom d'usuari no és vàlid.
de: Dein Nutzername ist ungültig.
eo: Via salutnomo ne validas.
es: Tu nombre de usuario no es válido.
fr: Ton pseudo n'est pas valide.
fy: Je gebruikersnaam is ongeldig
hi: आपका उपयोगकर्ता नाम अमान्य है
id: Nama pengguna Anda tidak valid.
ko: 사용자 이름이 올바르지 않습니다.
nl: Je gebruikersnaam is ongeldig.
pl: Niepoprawna nazwa użytkownika.
sr: Ваше корисничко име је неважеће.
ta: உங்கள் பயனர்பெயர் தவறானது.
tr: Kullanıcı adınız geçersiz.
uk: Ваше ім'я користувача недійсне.
zh_hans: 你的用户名无效。

# username_special
source: Username cannot contain `:` or `@`.
ar: اسم المستخدم لا يمكن أن يتضمن `:` أو `@`.
bg: Символите `:` or `@` не са позволени.
ca: El nom d'usuari no pot contenir `:` or `@`.
cs: Uživatelské jméno nesmí obsahovat `:` a `@`.
de: Der Benutzername darf nicht `:` oder `@` enthalten.
eo: Salutnomo ne povas enhavi `:` aŭ `@`.
es: El nombre de usuario no puede contener los caracteres `:` o `@`.
fr: Le pseudo ne peut pas contenir `:` ou `@`.
fy: Der mei gjin `:` as`@` yn dyn brûkersnamme sitte.
hi: उपयोगकर्तानाम में `:` या `@` नहीं हो सकता|
id: Username tidak boleh berisi ':' atau '@'.
ko: 사용자 이름에는 ':' 또는 '@'을 사용할 수 없습니다.
nl: Er mag geen `:` of `@` in je gebruikersnaam zitten.
pl: Nazwa użytkownika nie może zawierać `:` lub `@`.
sr: Корисничко име не може садржати `:` или `@`.
sw: Jina la mtumiaji haiwezi kuwa na herufi hizi: `:` or `@`.
ta: பயனர்பெயரில் `:` அல்லது `@` இருக்க முடியாது.
tr: Kullanıcı adı `:` veya `@` içeremez.
uk: Ім’я користувача не може містити `:` або `@`.
zh_hans: 用户名不能包含`:`或`@`。

# username_three
source: Username must contain at least three characters.
ar: اسم المستخدم يجب أن يتكون من ثلاثة أحرف على الأقل.
bg: Потребителското име трябва да съдържа поне три символа.
ca: El nom d'usuari ha de contenir almenys tres caràcters.
cs: Uživatelské jméno musí obsahovat alespoň tři znaky.
de: Der Benutzername muss mindestens aus drei Zeichen bestehen.
es: El nombre de usuario debe contener al menos tres caracteres.
fr: Le pseudo doit mesurer au moins 3 caractères de long.
fy: Dyn brûkersnamme moat teminsten 3 tekens hawwe.
hi: उपयोगकर्तानाम में कम से कम तीन वर्ण होने चाहिए|
id: Nama pengguna harus mengandung setidaknya tiga karakter.
ko: 사용자 이름에는 최소 3자 이상이 포함되어야 합니다.
nl: Je gebruikersnaam moet minstens 3 tekens hebben.
pl: Nazwa użytkownika musi zawierać co najmniej trzy znaki.
sr: Корисничко име мора садржати најмање три карактера.
sw: Jina la mtumiaji lazima liwe na herufi angalau tatu.
ta: பயனர்பெயரில் குறைந்தது மூன்று எழுத்துக்கள் இருக்க வேண்டும்.
tr: Kullanıcı adı en az üç karakter içermelidir.
uk: Ім'я користувача має містити не менше трьох символів.
zh_hans: 用户名必须至少包含三个字符。

# usernames_too_short
source: Usernames must be at least 3 characters long. Correct the following usernames, so that they are 3 or more symbols: {usernames}
ar: يجب أن يتكون اسم المستخدم من 3 أحرف على الأقل. صحح أسماء المستخدمين التالية بحيث تتكون من 3 رموز أو أكثر: {usernames}
ca: Els noms d'usuari han de tenir almenys 3 caràcters. Corregeix els següents noms d'usuari perquè tinguin 3 o més símbols: {usernames}
es: Los nombres de usuario deben tener al menos 3 caracteres. Corrige los siguientes nombres de usuario, para que sean 3 o más símbolos: {usernames}
nl: Gebruikersnamen moeten minimaal 3 tekens lang zijn. Corrigeer de volgende gebruikersnamen, zodat ze 3 of meer symbolen bevatten: {usernames}
sr: Корисничка имена морају бити дуга најмање 3 карактера. Исправите следећа корисничка имена, тако да буду 3 или више симбола: {usernames}
ta: பயனர்பெயர்கள் குறைந்தது 3 எழுத்துக்கள் நீளமாக இருக்க வேண்டும். பின்வரும் பயனர்பெயர்களை சரிசெய்யவும், இதனால் அவை 3 அல்லது அதற்கு மேற்பட்ட சின்னங்கள்: {usernames}
uk: Ім’я користувача має містити принаймні 3 символи. Виправте такі імена користувачів, щоб вони складалися з 3 або більше символів: {usernames}
zh_hans: 用户名必须至少包含 3 个字符。请更正以下用户名，使其包含 3 个或更多字符：{usernames}

# usernames_unavailable
source: The following usernames are not available: {usernames}. You can create similar accounts, for example, by appending an underscore or your class name.
ar: أسماء المستخدمين التالية غير متاحة: {usernames}. يمكنك إنشاء حسابات مشابهة، على سبيل المثال، عن طريق إضافة شرطة سفلية أو اسم صفك.
ca: Els següents noms d'usuari no estan disponibles: {usernames}. Pots crear comptes similars, per exemple, afegint una subratllada o el nom de la teva classe.
es: Los siguientes nombres de usuario no están disponibles: {usernames}. Puede crear cuentas similares, por ejemplo, añadiendo un subrayado o el nombre de su clase.
nl: De volgende gebruikersnamen zijn niet beschikbaar: {usernames}. Je kunt vergelijkbare accounts maken door bijvoorbeeld een underscore of uw klassenaam toe te voegen.
sr: Следећа корисничка имена нису доступна: {usernames}. Можете креирати сличне налоге, на пример, додавањем доње црте или имена вашег часа.
ta: பின்வரும் பயனர்பெயர்கள் கிடைக்கவில்லை: {usernames}. நீங்கள் ஒத்த கணக்குகளை உருவாக்கலாம், எடுத்துக்காட்டாக, அடிக்கோடிட்டு அல்லது உங்கள் வகுப்பு பெயரைச் சேர்ப்பதன் மூலம்.
uk: Наступні імена користувачів недоступні: {usernames}. Ви можете створити подібні облікові записи, наприклад, додавши підкреслення або назву свого класу.
zh_hans: 以下用户名不可用：{usernames}。您可以创建类似的帐户，例如，通过附加下划线或您的班级名称。

source: Value
ca: Valor
de: Wert
fr: Valeur
id: Nilai
ko: 값
nl: Waarde
pl: Wartość
sr: Вредност
tr: Değer
uk: Значення
zh_hans: 值

source: View adventures
ar: الاطّلاع على المغامرات
ca: Veure aventures
es: Ver aventuras
kab: Wali tidyanin
nl: Bekijk avonturen
pl: Wyświetl przygody
sr: Погледај авантуре
ta: சாகசங்களைக் காண்க
uk: Переглянути пригоди
zh_hans: 查阅探险

source: View classes
ar: الاطّلاع على الصفوف
ca: Veure classes
es: Ver clases
kab: Wali ismilen
nl: Bekijk de klassen
pl: Wyświetl klasy
sr: Погледај часове
ta: வகுப்புகளைக் காண்க
uk: Переглянути класи
zh_hans: 查阅课程

source: View program
ar: الاطّلاع على البرنامج
ca: Veure el programa
de: Programm ansehen
eo: Vidi programon
es: Ver programa
fr: Voir le programme
hi: प्रोग्राम देखें
id: Lihat program
kab: Sken ahil
ko: 프로그램 보기
nl: Bekijk programma
pl: Wyświetl program
sr: Погледај програм
ta: நிரல் காண்க
tr: Programı görüntüle
uk: Переглянути програму
zh_hans: 观看程序

source: View slides
ar: الاطّلاع على الشرائح
ca: Veure diapositives
es: Ver diapositivas
kab: Wali tibursatin
nl: Bekijk de presentatie
pl: Wyświetl slajdy
sr: Погледај слајдове
ta: ச்லைடுகளைக் காண்க
uk: Перегляд слайдів
zh_hans: 查阅幻灯

source: Waiting for submit
ar: ننتظر التسليم
ca: Esperant la tramesa
es: Esperando para enviar
kab: Aṛaǧu n tuzna
nl: Wachten op indienen
pl: Oczekiwanie na przesłanie
sr: Чекање на подношење
ta: சமர்ப்பிக்க காத்திருக்கிறது
uk: Очікування надсилання
zh_hans: 等待提交

# walker_variable_role
source: walker
ar: ماشي
ca: caminant
es: caminante
sr: шетач
ta: வாக்கர்
uk: ходунки
zh_hans: 漫游者

source: Website
ar: موقعك
ca: Pàgina web
es: Página web
kab: Asmel web
sr: Вебсајт
ta: வலைத்தளம்
uk: Веб-сайт
zh_hans: 网站

source: What is your role?
ar: ما هو دورك؟
ca: Quin és el teu paper?
de: Was ist deine Rolle?
es: ¿Cuál es tu papel?
id: Apa peran Anda?
kab: D acu-tt temlilt-ik·im?
nl: Wat is jouw rol?
pl: Jaka jest twoja rola?
sr: Која је ваша улога?
ta: உங்கள் பங்கு என்ன?
tr: Göreviniz nedir?
uk: Яка твоя роль?
zh_hans: 你的角色是什么？

source: What should my code do?
ca: Què hauria de fer el meu codi?
de: Was soll mein Code tun?
fr: Que devrait faire mon code ?
id: Apa yang seharusnya dilakukan oleh kode saya?
ko: 내 코드는 어떻게 해야하지?
nl: Wat moet mijn code doen?
pl: Co powinien robić mój kod?
sr: Шта би мој код требало да ради?
tr: Kodumun ne yapması gerekiyor?
uk: Що повинен робити мій код?
zh_hans: 我的代码能做什么？

# workbook_circle_question_text
source: **Question**: Circle {goal} in this code:
ar: **سؤال**: ضع دائرة {goal} في هذا البرنامج:
ca: **Pregunta**: Encercla {goal} en aquest codi:
es: **Pregunta**: Encierra {goal} en este código:
nl: **Vraag**: Omcirkel {goal} in deze code:
sr: **Питање**: Окружите {goal} у овом коду:
ta: ** கேள்வி **: இந்த குறியீட்டில் வட்டம் {goal}:
uk: **Запитання**: обведіть {goal} у цьому коді:
zh_hans: **问题**: 在此代码中圈出{goal}:

# workbook_circle_question_title
source: Assign
ar: عَيِّن
ca: Assigna
es: Asignar
kab: Mudd
nl: Aanwijzen
sr: Доделите
ta: ஒதுக்க
uk: Призначити
zh_hans: 分配

# workbook_define_question_text
source: **Question**: What does {word} mean?
ar: **سؤال**: ماذا تعني كلمة {word}؟
ca: **Pregunta**: Què significa {word}?
es: **Pregunta**: ¿Qué significa {word}?
nl: **Vraag**: Wat betekent {word}?
sr: **Питање**: Шта значи {word}?
ta: ** கேள்வி **: {word} என்றால் என்ன?
uk: **Запитання**: Що означає {word}?
zh_hans: **问题**：{word} 是什么意思?

# workbook_define_question_title
source: Define
ar: عَرِّف
ca: Defineix
es: Definir
kab: Sbadu
nl: Definiëer
sr: Дефиниши
ta: வரையறுக்கவும்
uk: Визначити

# workbook_input_question_text
source: **Question**: Which code snippet produced this output?
ar: **سؤال**: أي فقرة من فقرات البرنامج أنتجت هذا المُخرج؟
ca: **Pregunta**: Quin fragment de codi ha produït aquesta sortida?
es: **Pregunta**: ¿Qué fragmento de código produjo este resultado?
nl: **Vraag**: Welke code hoort bij deze uitvoer?
sr: **Питање**: Који фрагмент кода је произвео овај излаз?
ta: ** கேள்வி **: எந்த குறியீடு துணுக்கை இந்த வெளியீட்டை உருவாக்கியது?
uk: **Запитання**: Який фрагмент коду створив цей результат?
zh_hans: **问题**：哪个代码片段产生了这个输出？

# workbook_input_question_title
source: Input
ar: مُدخل
ca: Entrada
es: Entrada
kab: Sekcem
sr: Унос
ta: உள்ளீடு
uk: Введення
zh_hans: 输入

# workbook_multiple_choice_question_text
source: **Question**: Is this code correct or does it have an error?
ar: **سؤال**: هل هذا البرنامج صحيح أو هل فيه خطأ؟
ca: **Pregunta**: Aquest codi és correcte o té un error?
es: **Pregunta**: ¿Este código es correcto o tiene un error?
nl: **Vraag**: Is deze code goed of fout?
sr: **Питање**: Да ли је овај код тачан или садржи грешку?
ta: ** கேள்வி **: இந்த குறியீடு சரியானதா அல்லது அதற்கு பிழை உள்ளதா?
uk: **Запитання**: Чи правильний цей код чи містить помилку?
zh_hans: **问题**：此代码正确吗？或者有错误？

# workbook_multiple_choice_question_title
source: Choose
ar: اختر
ca: Escull
es: Elegir
kab: Fren
nl: Kies
sr: Изабери
ta: தேர்வு
uk: Виберіть
zh_hans: 选择

# workbook_open_question_title
source: Open-ended question
ar: سؤال ذات إجابة موسعة
ca: Qüestió de final obert
es: Pregunta de respuesta libre
nl: Open vraag
sr: Отворено питање
ta: திறந்தநிலை கேள்வி
uk: Відкрите питання
zh_hans: 开放式问题

# workbook_output_question_text
source: **Question**: What is the output of this code?
ar: **سؤال**: ما هو مُخرج هذا البرنامج؟
ca: **Pregunta**: Quina és la sortida d'aquest codi?
es: **Pregunta**: ¿Cuál es el resultado de este código?
nl: **Vraag**: Wat is de uitvoer van deze code?
sr: **Питање**: Који је излаз овог кода?
ta: ** கேள்வி **: இந்த குறியீட்டின் வெளியீடு என்ன?
uk: **Запитання**: Що таке вихід цього коду?
zh_hans: **问题**：这段代码的输出是什么？

# workbook_output_question_title
source: Output
ar: مُخرج
ca: Sortida
es: Resultado
kab: Suffeɣ
sr: Излаз
ta: வெளியீடு
uk: Вихід
zh_hans: 输出

# year_invalid
source: Please enter a year between 1900 and {current_year}.
ar: الرجاء ادخال سنة بين ١٩٩٠ و {current_year}.
ca: Si us plau, introdueix un any entre el 1900 i el {current_year}.
cs: Prosím zadej rok mezi 1900 a {current_year}
de: Bitte ein Jahr zwischen 1900 und {current_year} eingeben.
eo: Bonvolu tajpi jaron inter 1900 kaj {current_year}.
es: Por favor ingresa un año entre 1900 y {current_year}.
fr: Veuillez entrer une année entre 1900 et {current_year}.
fy: It jier moat letter wêze as 1900 en {current_year}
hi: कृपया एक वर्ष डालें जो इनके बीच में हो १९०० और {current_year}
id: Silakan masukkan tahun antara 1900 dan {current_year}.
ko: 1900년에서 {current_year}년 사이의 연도를 입력하십시오.
nl: Dit is geen geldig jaartal, die moet liggen tussen 1900 en {current_year}.
pl: Proszę wprowadzić rok pomiędzy 1900 i {current_year}.
sr: Молимо вас да унесете годину између 1900 и {current_year}.
ta: தயவுசெய்து 1900 முதல் {current_year} க்கு இடையில் ஒரு வருடத்தை உள்ளிடவும்.
tr: Lütfen 1900 ile {current_year} arasında bir yıl girin.
uk: Введіть рік між 1900 і {current_year}.
zh_hans: 请输入介于 1900 和 {current_year} 之间的年份。

source: Yes
ar: نعم
bg: Да
ca: Sí
cs: Ano
de: Ja
eo: Jes
es: Sí
fr: Oui
fy: Ja
hi: हां
id: Ya
kab: Ih
ko: 네.
nl: Ja
pl: Tak
sr: Да
ta: ஆம்
tr: Evet
uk: Так
zh_hans: 是的

source: Your personal text...
ar: نصّك الشخصي...
bg: Твоето лично съобщение...
ca: El teu text personal...
de: Dein persönlicher Text...
eo: Via persona teksto...
es: Tu texto personal...
fr: Votre texte personnel...
hi: आपका व्यक्तिगत पाठ...
id: Teks pribadi Anda...
kab: Aḍris-ik·im udmawan...
ko: 당신의 문자가...
nl: Jouw persoonlijke tekst...
pl: Opis...
sr: Ваш лични текст...
ta: உங்கள் தனிப்பட்ட உரை ...
tr: Kişisel metniniz...
uk: Ваш особистий текст...
zh_hans: 你的个人文本...

source: Your program
ar: برنامجك
ca: El teu programa
de: Dein Programm
es: Tu programa
fr: Ton programme
id: Program Anda
kab: Ahil-ik·im
ko: 당신의 프로그램
nl: Jouw programma
pl: Twój program
sr: Ваш програм
ta: உங்கள் நிரல்
tr: Programınız
uk: Ваша програма
zh_hans: 你的程序

source: Enter
ar: إدخال
bg: Въведи
ca: Introdueix
de: Eingeben
eo: Tajpi
es: Ingresar
fr: Entrer
fy: Ynfolje
hi: दर्ज करें
id: Tuliskan
kab: Sekcem
ko: 엔터
nl: Invullen
pl: Wprowadź
sr: Унеси
ta: உள்ளிடவும்
tr: Girin
zh_hans: 输入

source: OK
ar: حسناً
ca: D'acord
eo: Bone
es: De acuerdo
hi: ठीक है
kab: Ih
ko: 네 알겠습니다
sr: У реду
ta: சரி
tr: TAMAM
zh_hans: 好的
