Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# recover_password
source: Request a password reset
ar: طلب إعادة ضبط كلمة المرور
bg: Поискайте повторно задаване на парола
ca: Sol·liciteu un restabliment de la contrasenya
cs: Požádat o obnovení hesla
da: Anmod om nulstilling af adgangskode
de: Passwort-Reset anfordern
eo: Petu pasvortigon
es: Restablecer contraseña
fr: Demander une réinitialisation de mot de passe
fy: Freegje in nij wachtwurd oan.
hi: सांकेतिक शब्द को फिर से कायम करने अनुरोध करें
id: Minta set ulang password
ko: 암호 리셋 요청
nl: Vraag een nieuw wachtwoord aan
pl: Zażądaj zmiany hasła
sr: Затражи ресетовање лозинке
sw: Omba kuweka upya nenosiri
ta: கடவுச்சொல் மீட்டமைப்பைக் கோருங்கள்
tr: Şifre sıfırlama isteğinde bulunun
uk: Запит на скидання пароля
vi: Yêu cầu đặt lại mật khẩu
zh_hans: 要求重置密码

# regress_button
source: Go back to level {level}
ca: Torna al nivell {level}
de: Gehe zurück zu Level {level}
fr: Retourner au niveau {level}
id: Kembali ke level {level}
ko: 레벨 {level}(으)로 돌아가기
nl: Ga terug naar level {level}
pl: Powróć do poziomu {level}
sr: Врати се на ниво {level}
tr: {level}. seviyeye geri dönün
uk: Повернутися на рівень {level}
zh_hans: 回到等级 {level}

source: Remove
ar: ازالة
ca: Elimina
de: Löschen
eo: Forigi
es: Eliminar
fr: Retirer
hi: हटा दें
id: Hapus
kab: Kkes
ko: 제거하기
nl: Verwijder
pl: Usuń
sr: Уклони
ta: அகற்று
tr: Kaldır
uk: Видалити
zh_hans: 移除

source: Remove customization
ar: إزالة التخصيصات
ca: Elimina la personalització
de: Modifikationen entfernen
es: Eliminar configuración
fr: Retirer la personnalisations
hi: अनुकूलन निकालें
id: Hapus penyesuaian
kab: Kkes isaganen
ko: 사용자 지정 제거
nl: Verwijder personalisatie
pl: Usuń ustawienia tej klasy
sr: Уклони прилагођавање
ta: தனிப்பயனாக்கலை அகற்று
tr: Özelleştirmeyi kaldırın
uk: Видалити налаштування
zh_hans: 删除自定义

# remove_customizations_prompt
source: Are you sure you want to remove this class's customizations?
ar: هل أنت متأكد أنك تريد إزالة التخصيصات المتعلقة بهذا الصف؟
ca: Estàs segur que vols eliminar les personalitzacions d'aquesta classe?
de: Bist du dir sicher, dass du die Modifikationen dieser Klasse entfernen möchtest?
es: ¿Estás seguro de que quieres eliminar esta clase de sus personalizaciones?
fr: Es-tu sur de vouloir supprimer cette personnalisation de classe ?
hi: क्या आप वाकई इस वर्ग के अनुकूलन को हटाना चाहते हैं?
id: Apakah Anda yakin ingin menghapus penyesuaian kelas ini?
ko: 이 수업의 사용자 지정을 제거하시겠습니까?
nl: Weet je zeker dat je de personalisatie van deze klas wilt verwijderen?
pl: Czy jesteś pewien, że chcesz usunąć konfigurację tej klasy?
sr: Да ли сте сигурни да желите да уклоните прилагођавања овог разреда?
ta: இந்த வகுப்பின் தனிப்பயனாக்கங்களை அகற்ற விரும்புகிறீர்களா?
tr: Bu sınıfın özelleştirmelerini kaldırmak istediğinizden emin misiniz?
uk: Ви впевнені, що хочете видалити налаштування цього класу?
zh_hans: 您确定要删除该类的自定义吗？

# remove_student_prompt
source: Are you sure you want to remove the student from the class?
ar: هل أنت متأكد أنك تريد ازالة التلميذ من الصف؟
ca: Estàs segur que vols eliminar l'estudiant de la classe?
de: Soll der/die Schüler*in aus der Klasse entfernt werden?
es: ¿Estás seguro de que quieres eliminar al alumno de la clase?
fr: Es-tu sur de vouloir supprimer l'élève de la classe ?
fy: Witst seker datst de learling út de klas fuorthelje wolst?
hi: क्या आप वाकई छात्र को कक्षा से बाहर निकलना चाहते हैं?
id: Apa kamu yakin mau mengeluarkan murid tersebut dari kelas?
ko: 그 학생을 수업에서 빼시겠습니까?
nl: Weet je zeker dat je deze leerling uit de klas wilt verwijderen?
pl: Czy na pewno chcesz usunąć tego ucznia z klasy?
sr: Да ли сте сигурни да желите да уклоните ученика из разреда?
ta: வகுப்பிலிருந்து மாணவரை அகற்ற விரும்புகிறீர்களா?
tr: Öğrenciyi bu sınıftan çıkarmak istediğinize emin misiniz?
uk: Ви впевнені, що хочете видалити учня з класу?
zh_hans: 你确定要将这名学生移出班级吗？

# remove_user_prompt
source: Confirm removing this user from the class.
ar: هل تأكد حذف هذا المستخدم؟
ca: Confirma l'eliminació d'aquest usuari de la classe.
es: Confirmar la eliminación de este usuario de la clase.
id: Konfirmasikan penghapusan pengguna ini dari kelas.
nl: Bevestig de verwijdering van deze gebruiker (user) van deze klas.
pl: Potwierdź usunięcie tego użytkownika z klasy.
sr: Потврдите уклањање овог корисника из одељења.
ta: இந்த பயனரை வகுப்பிலிருந்து அகற்றுவதை உறுதிப்படுத்தவும்.
uk: Підтвердьте видалення цього користувача з класу.
zh_hans: 确认从班级中删除该用户。

source: Rename class
ar: أعد تسمية الصف
ca: Canvia el nom de la classe
es: Renombrar clase
sr: Преименуј разред
ta: வகுப்பு மறுபெயரிடுங்கள்
uk: Перейменувати клас
zh_hans: 重命名类

# rename_class_prompt
source: What is the name you want to give to this class?
ar: ما الاسم الذي تريده لهذا الصف؟
ca: Quin nom vols donar a aquesta classe?
es: ¿Cuál es el nombre que le quieres dar a esta clase?
sr: Које име желите да дате овом разреду?
ta: இந்த வகுப்பிற்கு நீங்கள் கொடுக்க விரும்பும் பெயர் என்ன?
uk: Яку назву ви хочете дати цьому класу?
zh_hans: 你想给这个班级起什么名字?

# repair_program_logo_alt
source: Repair program icon
ar: علامة تصليح البرنامج
ca: Icona de reparació de programes
de: Repariere Programm Symbol
eo: Piktogramo pri riparado de programo
es: Icono de reparación de programa
fr: Corriger l'icône du programmer
id: Ikon program perbaikan
kab: Seɣti tignit n usihel
ko: 프로그램 복구 아이콘
nl: Repareer programma icon
pl: Ikona naprawy programu
sr: Икона за поправку програма
ta: பழுதுபார்க்கும் நிரல் படவுரு
tr: Program onarım simgesi
uk: Значок програми відновлення
zh_hans: 修复程序图标

# repeat_dep
source: Starting in level 8, `{repeat}` needs to be used with indentation. You can see examples on the `{repeat}` tab in level 8.
ar: بداية من المستوى الثامن، '{repeat}' يجب أن تُستخدم مع مسافة بادئة. يمكنك أن ترى أمثلة عن '{repeat}' في المستوى الثامن.
ca: A partir del nivell 8, `{repeat}` s'ha d'utilitzar amb indentació. Pots veure exemples a la pestanya `{repeat}` del nivell 8.
eo: Ekde la nivelo 8, `{repeat}` bezonas esti uzita kun krommarĝeno. Vi povas vidi ekzemplojn en la tabelo `{repeat}` de la nivelo 8.
es: Empezando en el nivel 8, `{repeat}` necesita ser usado con sangría. Puedes ver ejemplos en la pestaña `{repeat}` en el nivel 8.
fr: À partir du niveau 8, `{repeat}` doit être utilisée avec de l'indentation. Des exemples sont montrés à l'onglet `{repeat}` du niveau 8.
nl: Vanaf level 8 moet je regels van `{repeat}` inspringen. Hiervan heb je een voorbeeld op level 8 bij de `{repeat}` pagina.
pl: Począwszy od poziomu 8, {repeat} należy używać z wcięciem. Przykłady na karcie {repeat} na poziomie 8.
sr: Почевши од нивоа 8, `{repeat}` треба да се користи са увлачењем. Можете видети примере на картици `{repeat}` у нивоу 8.
ta: நிலை 8 இல் தொடங்கி, `{repeat}` உள்தள்ளலுடன் பயன்படுத்தப்பட வேண்டும். நிலை 8 இல் `{repeat}` தாவலில் எடுத்துக்காட்டுகளை நீங்கள் காணலாம்.
uk: Починаючи з рівня 8, `{repeat}` потрібно використовувати з відступом. Ви можете побачити приклади на вкладці `{repeat}` на рівні 8.
zh_hans: 从第 8 级开始，`{repeat}` 需要与缩进一起使用。 可以在第 8 级的 `{repeat}` 选项卡上查看示例。

# repeat_match_password
source: The repeated password does not match.
ar: كلمة المرور المكررة غير متطابقة.
bg: Повторената парола не съвпада с първата.
ca: La contrasenya repetida no coincideix.
cs: Zopakované heslo se neshoduje.
de: Das wiederholte Passwort stimmt nicht mit dem ersten überein.
eo: La ripetita pasvorto ne kongruas.
es: La contraseña repetida es distinta.
fr: Les mots de passes sont différents.
fy: De wachtwurden binne net itselde.
hi: दोहराया हुआ सांकेतिक शब्द मेल नहीं खाता|
id: Password yang dimasukkan ulang tidak sesuai.
ko: 반복되는 암호가 일치하지 않습니다.
nl: Het herhaalde wachtwoord is niet gelijk.
pl: Powtórzone hasło nie zgadza się z nowym hasłem.
sr: Поновљена лозинка се не поклапа.
sw: Nenosiri inayorudiwa hailingani.
ta: மீண்டும் இடப்பட்ட கடவுச்சொல் பொருந்தவில்லை.
tr: Yinelenen şifre eşleşmiyor.
uk: Повторний пароль не збігається.
zh_hans: 再次输入的密码和第一次输入的密码不一致。

source: Repeat new password
ar: أعد ادخال كلمة المرور
bg: Повтаряне на паролата
ca: Repeteix la nova contrasenya
cs: Zopakuj nové heslo
de: Wiederhole neues Passwort
eo: Ripetu la novan pasvorton
es: Repetir nueva contraseña
fr: Répéter le nouveau mot de passe
fy: Werhelje nije wachtwurd
hi: नया सांकेतिक शब्द दोहराएं
id: Ulangi password baru
kab: Ales i wawal n uɛeddi amaynut
ko: 새 암호 반복
nl: Herhaal nieuw wachtwoord
pl: Powtórz nowe hasło
sr: Поновите нову лозинку
sw: Rudia nenosiri mpya
ta: புதிய கடவுச்சொல்லை மீண்டும் செய்யவும்
tr: Yeni şifreyi tekrarla
uk: Повторіть новий пароль
zh_hans: 重复新密码

# report_failure
source: This program does not exist or is not public
ar: هذا البرنامج غير موجود أو غير متوفر للعامة
ca: Aquest programa no existeix o no és públic
de: Dieses Programm existiert nicht oder ist nicht öffentlich
eo: Ĉi tiu programaĵo ne ekzistas aŭ ne estas publika
es: Este programa no existe o no es público
fr: Ce programme n'existe pas ou n'est pas public
id: Program ini tidak ada atau tidak bersifat publik
kab: Ahil-a ulac-it neɣ mačči d azayaz
ko: 이 프로그램이 존재하지 않거나 공개되지 않습니다
nl: Dit programma bestaat niet, of is niet publiek
pl: Ten program nie istnieje lub nie jest udostępniony publicznie
sr: Овај програм не постоји или није јаван
ta: இந்த திட்டம் இல்லை அல்லது பொது இல்லை
tr: Bu program mevcut değil veya herkese açık değil
uk: Ця програма не існує або не є публічною
zh_hans: 该程序不存在或未公开

# report_program
source: Are you sure you want to report this program?
ar: امتأكدٌ أنك تريد الإبلاغ عن هذا البرنامج؟
ca: Estàs segur que vols informar sobre aquest programa?
de: Bist du dir sicher, dass du dieses Programm melden möchtest?
eo: Ĉu vi certas voli denunci ĉi tiun programaĵon?
es: ¿Estás seguro de que quieres reportar este programa?
fr: Es-tu sur de vouloir signaler ce programme ?
id: Apakah Anda yakin ingin melaporkan program ini?
kab: D tidet tebɣiḍ ad temmleḍ ahil-a?
ko: 이 프로그램을 Hedy에 보고 하시겠습니까?
nl: Wete je zeker dat je dit programma wilt rapporteren?
pl: Czy jesteś pewien, że chcesz zgłosić ten program?
sr: Да ли сте сигурни да желите да пријавите овај програм?
ta: இந்த திட்டத்தை நீங்கள் நிச்சயமாக புகாரளிக்க விரும்புகிறீர்களா?
tr: Bu programı bildirmek istediğinizden emin misiniz?
uk: Ви впевнені, що бажаєте повідомити про цю програму?
zh_hans: 你确定要上报这个程序吗？

# report_success
source: This program has been reported
ar: لقد تم الإبلاغ عن هذا البرنامج
ca: Aquest programa ha estat informat
de: Dieses Programm wurde gemeldet
eo: Ĉi tiu programo estis denuncita
es: Este programa ha sido reportado
fr: Ce programme a été reporté
id: Program ini telah dilaporkan
kab: Ahil-a yettwammel
ko: 이 프로그램이 보고되었습니다
nl: Dit programma is gerapporteerd
pl: Ten program został zgłoszony
sr: Овај програм је пријављен
ta: இந்த திட்டம் தெரிவிக்கப்பட்டுள்ளது
tr: Bu program rapor edilmiştir
uk: Про цю програму повідомлено
zh_hans: 该程序已被上报

source: Request invalid
ar: هذا الطلب غير صحيح
ca: Sol·licitud no vàlida
es: Solicitud no válida
kab: Assuter d arameɣtu
pl: Nieprawidłowe żądanie
sr: Захтев је неважећи
ta: கோரிக்கை தவறானது
uk: Запит недійсний
zh_hans: 请求无效

# request_teacher
source: Would you like to become a teacher?
ar: هل ترغب في التقدم بطلب للحصول على حساب المعلم؟
ca: T'agradaria ser professor?
de: Möchtest du dich für einen Lehr-Konto bewerben?
eo: Ĉu vi volas peti instruistan konton?
es: ¿Te gustaría aplicar a una cuenta de profesor?
fr: Souhaitez-vous postuler pour un compte enseignant ?
hi: मैं एक शिक्षक हूं और मैं एक शिक्षक के खाते के लिए आवेदन करना चाहता/चाहती हूं
id: Apakah Anda ingin mengajukan akun guru?
ko: 선생님 계좌를 신청하고 싶으신가요?
nl: Wil je een lerarenaccount aanvragen?
pl: Czy chciałbyś aplikować o konto nauczyciela?
sr: Да ли желите да постанете наставник?
ta: நீங்கள் ஆசிரியராக விரும்புகிறீர்களா?
tr: Öğretmen hesabı için başvurmak ister misiniz?
uk: Чи хотіли б ви стати вчителем?
zh_hans: 你想申请教师账户吗？

# request_teacher_account
source: Become a teacher
ar: اصبح معلما
ca: Fes-te professor
de: Lehr-Konto anfordern
eo: Peti instruan konton
es: Solicita cuenta de profesor/a
fr: Demander un compte enseignant
id: Mengajukan akun guru
kab: Uɣal d aselmad
ko: 선생님계정요청
nl: Vraag lerarenaccount aan
pl: Aplikuj o konto nauczyciela
sr: Постаните наставник
ta: ஆசிரியராகுங்கள்
tr: Öğretmen hesabı için başvurun
uk: Стати вчителем
zh_hans: 申请教师账户

# required_field
source: Fields marked with an * are required
ar: مطلوب تعبئة الحقول مع علامة ال *
ca: Els camps marcats amb un * són obligatoris
cs: * povinná pole
de: * zeigt erforderliche Felder an
es: Los campos marcados con * son obligatorios
fr: Les champs marqués d'une * sont obligatoires
id: Bidang yang ditandai dengan * wajib diisi
ko: *로 표시된 필드는 필수입니다
nl: Velden met een * zijn verplicht
pl: Pola oznaczone * są wymagane
sr: Поља означена са * су обавезна
ta: AN * உடன் குறிக்கப்பட்ட புலங்கள் தேவை
tr: * ile işaretlenmiş alanlar zorunludur
uk: Поля, позначені *, обов'язкові для заповнення
zh_hans: 标有 星号* 的为必填项

# reset_adventure_prompt
source: Are you sure you want to reset all selected adventures?
ar: هل أنت متأكد أنك تريد إعادة ضبط كل المغامرات المختارة؟
ca: Estàs segur que vols restablir totes les aventures seleccionades?
de: Bist du dir sicher, dass du alle ausgewählten Abenteuer zurücksetzen möchtest?
es: ¿Seguro que quieres restablecer todas las aventuras seleccionadas?
fr: Est tu sur de vouloir remettre à zéro toutes les aventures sélectionnées ?
hi: क्या आप वाकई सभी चयनित adventures को रीसेट करना चाहते हैं?
id: Apakah Anda yakin ingin mengatur ulang semua petualangan yang dipilih?
ko: 선택한 모든 모험을 리셋하시겠습니까?
nl: Weet je zeker dat je alle geselecteerde avonturen wilt wissen?
pl: Czy jesteś pewien, że chcesz zresetować wybrane przygody?
sr: Да ли сте сигурни да желите да ресетујете све изабране авантуре?
ta: தேர்ந்தெடுக்கப்பட்ட அனைத்து சாகசங்களையும் மீட்டமைக்க விரும்புகிறீர்களா?
tr: Seçilen tüm maceraları sıfırlamak istediğinizden emin misiniz?
uk: Ви впевнені, що бажаєте скинути всі вибрані пригоди?
zh_hans: 您确定要重置所有选定的冒险吗？

# reset_adventures
source: Reset selected adventures
ar: إعادة ضبط المغامرات المختارة
ca: Restablir les aventures seleccionades
de: Ausgewählte Abenteuer zurücksetzen
es: Restablecer aventuras seleccionadas
fr: Réinitialiser les aventures sélectionnées
hi: चयनित adventures रीसेट करें
id: Atur ulang petualangan yang dipilih
ko: 선택한 모험을 리셋
nl: Wis gekozen avonturen
pl: Resetuj wybrane przygody
sr: Ресетуј изабране авантуре
ta: தேர்ந்தெடுக்கப்பட்ட சாகசங்களை மீட்டமைக்கவும்
tr: Seçili maceraları sıfırla
uk: Скинути вибрані пригоди
zh_hans: 重置选定的冒险

# reset_button
source: Reset
ar: أعد التشغيل
ca: Restableix
de: Zurücksetzen
es: Restablecer
fr: Remettre à zéro
id: Atur ulang
kab: Wennez
ko: 리셋
pl: Resetuj
sr: Ресетуј
ta: மீட்டமை
tr: Sıfırla
uk: Скинути
zh_hans: 重置

source: Reset password
ar: اعادة ضبط كلمة المرور
ca: Restableix contrasenya
cs: Obnovit heslo
de: Passwort zurücksetzen
es: Establecer nueva contraseña
fr: Réinitialiser le mot de passe
fy: Dyn wachtwurd resette
hi: सांकेतिक शब्द को फिर से कायम करें
id: Set ulang password
kab: Wennez awal n uɛeddi
ko: 비밀번호 리셋
nl: Reset je wachtwoord
pl: Zresetuj hasło
sr: Ресетуј лозинку
sw: Badilisha nenosiri
ta: கடவுச்சொல்லை மீட்டமைக்கவும்
tr: Şifreyi sıfırla
uk: Скинути пароль
zh_hans: 重置密码

source: Restart
ar: إعادة تشغيل
ca: Reinicia
es: Restablecer
kab: Ales asenker
sr: Поново покрени
ta: மறுதொடக்கம்
uk: Перезапустіть
zh_hans: 重来

# retrieve_adventure_error
source: You're not allowed to view this adventure!
ar: لا يسمح لك بعرض هذه المغامرة!
ca: No tens permís per veure aquesta aventura!
de: Du darfst dieses Abenteuer nicht sehen!
es: ¡No puedes ver esta aventura!
fr: Tu n'as pas accès à cette aventure !
id: Anda tidak diperbolehkan melihat petualangan ini!
ko: 이 모험을 볼 수 없습니다!
nl: Jij mag dit avontuur niet bekijken!
pl: Nie możesz otworzyć tej przygody!
sr: Није вам дозвољено да видите ову авантуру!
ta: இந்த சாகசத்தைக் காண உங்களுக்கு இசைவு இல்லை!
tr: Bu macerayı görüntülemenize izin verilmiyor!
uk: Вам заборонено переглядати цю пригоду!
zh_hans: 您无权查看这个探险活动！

# retrieve_class_error
source: Only teachers can retrieve classes
ar: يمكن للمعلمين فقط استرجاع الصفوف
ca: Només els professors poden recuperar classes
de: Nur Lehrpersonen können Klassen laden
es: Solo los profesores pueden ver clases
fr: Seulement les professeurs peuvent consulter les classes
hi: केवल शिक्षक ही कक्षाएं पुनः प्राप्त कर सकते हैं
id: Hanya guru yang dapat mengambil kelas
ko: 선생님들만이 수업을 다시 들을 수 있다
nl: Alleen leraren mogen klassen openen
pl: Tylko uczniowie mogą pobrać listę klas
sr: Само наставници могу преузети одељења
ta: ஆசிரியர்கள் மட்டுமே வகுப்புகளை மீட்டெடுக்க முடியும்
tr: Sadece öğretmenler sınıfları geri alabilir
uk: Тільки вчителі можуть отримати класи
zh_hans: 只有教师可以获得有关班级的信息

# retrieve_tag_error
source: Error retrieving tags
ar: حدث خطأ أثناء استرجاع العلامات
ca: Error en recuperar les etiquetes
es: Error al recuperar las etiquetas
nl: Fout bij het ophalen van kenmerken (tags)
pl: Błąd podczas pobierania znaczników
sr: Грешка при преузимању ознака
ta: குறிச்சொற்களை மீட்டெடுப்பதில் பிழை
uk: Помилка отримання тегів
zh_hans: 检索标签错误

source: Role
ar: منصب
ca: Rol
eo: Rolo
es: Papel
id: Peran
kab: Tamlilt
nl: Rol
pl: Rola
sr: Улога
ta: பங்கு
uk: Роль
zh_hans: 角色

# run_code_button
source: Run code
ar: تنفيذ البرنامج
bg: Тествай кода
ca: Executa
cs: Spustit kód
de: Programm ausführen
eo: Ruli kodon
es: Ejecutar código
fr: Exécuter le code
fy: Koade draaie
hi: कोड को चलाएं
id: Jalankan kode
kab: Selkem tangalt
ko: 실행코드
nl: Voer de code uit
pl: Uruchom kod
sr: Покрени код
sw: Endesha programu
ta: குறியீட்டை இயக்கவும்
tr: Kodu Çalıştır
uk: Запустити код
zh_hans: 运行程序

# save_parse_warning
source: This program contains an error, are you sure you want to save it?
ar: هذا البرنامج يحتوي على خطأ، هل أنت متأكد أنك تريد حفظه؟
ca: Aquest programa conté un error, segur que el vols guardar?
de: Dieses Programm enthält einen Fehler, bist du dir sicher, dass du es speichern möchtest?
eo: Ĉi tiu programaĵo enhavas eraron, ĉu vi certas voli konservi ĝin?
es: Tu programa contiene un error. ¿Estás seguro/a de que quieres guardarlo?
fr: Ce programme contient une erreur, le sauvegarder ?
id: Program ini mengandung kesalahan, apakah Anda yakin ingin menyimpannya?
kab: Ahil-a deg-s tuccḍa, d tidet tebɣiḍ ad t-teskelseḍ?
ko: 이 프로그램에 오류가 있습니다. 저장하시겠습니까?
nl: Dit programma bevat een foutje, weet je zeker dat je het wilt opslaan?
pl: Ten program zawiera błędy. Czy jesteś pewien, że chcesz go zapisać?
sr: Овај програм садржи грешку, да ли сте сигурни да желите да га сачувате?
ta: இந்த நிரலில் பிழை உள்ளது, நீங்கள் அதை சேமிக்க விரும்புகிறீர்களா?
tr: Bu program bir hata içeriyor, kaydetmek istediğinizden emin misiniz?
uk: Ця програма містить помилку. Ви впевнені, що хочете її зберегти?
zh_hans: 此程序包含错误，你确定要保存它吗？

# save_prompt
source: You need to have an account to save your program. Would you like to login now?
ar: يجب أن يكون لديك حساب لتتمكن من حفظ برنامجك. هل ترغب بتسجيل الدخول الآن؟
ca: Cal tenir un compte per guardar el programa. Vols iniciar sessió?
cs: Potřebuješ vlastní uživatelský účet, abys mohl*a uložit svůj program. Chceš se nyní přihlásit?
de: Du brauchst ein Konto, um deine Programme zu speichern. Möchtest du dich jetzt anmelden?
eo: Ĉu bezonas havi konton por konservi vian programaĵon. Ĉu vi volas ensaluti?
es: Debes estar registrado para guardar tu programa. ¿Deseas entrar ahora a tu cuenta?
fr: Un compte est nécessaire pour sauvegarder ton programme. Se connecter ?
fy: Do hast in akkount nedich om dyn programma's te bewarjen. Wolst no ynlogge?
hi: अपने प्रोग्राम को सहेजने के लिए आपके पास एक खाता होना चाहिए। क्या आप अभी लॉग इन करना चाहेंगे?
id: Kamu harus memiliki akun untuk menyimpan program. Apakah kamu mau masuk dengan akunmu sekarang?
kab: Tesriḍ ad tesɛuḍ amiḍan i wakken ad teskelseḍ ahil-ik. Tebɣiḍ ad teqqneḍ?
ko: 프로그램을 저장하려면 계정이 있어야 합니다. 지금 로그인하시겠습니까?
nl: Je moet ingelogd zijn om je programma op te kunnen slaan. Wil je inloggen of een account maken?
pl: Aby zapisać program musisz mieć konto użytkownika. Czy chciałbyś się zalogować teraz?
sr: Морате имати налог да бисте сачували свој програм. Да ли желите да се пријавите сада?
sw: Unahitaji kuwa na akaunti kuokoa programu yako. Je! Ungependa login sasa?
ta: உங்கள் திட்டத்தை சேமிக்க உங்களிடம் ஒரு கணக்கு இருக்க வேண்டும். இப்போது உள்நுழைய விரும்புகிறீர்களா?
tr: Programınızı kaydetmek için bir hesabınızın olması gerekir. Şimdi giriş yapmak ister misiniz?
uk: Щоб зберегти програму, потрібно мати обліковий запис. Бажаєте увійти зараз?
zh_hans: 你需要有一个帐户才能保存你的程序。你想立即登录吗？

# save_success_detail
source: Program saved successfully.
ar: تم حفظ البرنامج بنجاح.
ca: Programa salvat amb èxit.
cs: Program byl úspěšně uložen.
de: Programm erfolgreich gespeichert.
eo: Programaĵo sukcese konservita.
es: Tu programa se ha guardado correctamente.
fr: Programme sauvegardé.
fy: Dyn programma is bewarre
hi: प्रोग्राम सफलतापूर्वक सहेजा गया
id: Program tersimpan dengan sukses.
kab: Ahil yettwasekles akken iwata.
ko: 프로그램이 성공적으로 저장되었습니다.
nl: Je programma is opgeslagen.
pl: Program został zapisany pomyślnie.
sr: Програм успешно сачуван.
sw: Programu imehifadhiwa kwa mafanikio
ta: நிரல் வெற்றிகரமாக சேமிக்கப்பட்டது.
tr: Program başarıyla kaydedildi.
uk: Програму успішно збережено.
zh_hans: 程序保存成功。

source: Score
ca: Puntuació
de: Punkte
id: Skor
ko: 점수를
pl: Wynik
sr: Резултат
tr: Puan
uk: Оцінка
zh_hans: 得分

source: Search...
ar: ابحث...
ca: Cercar...
de: Suche...
eo: Serĉi…
es: Busca...
fr: Rechercher...
hi: ढूंढें...
id: Mencari...
kab: Nadi...
ko: 검색...
nl: Zoeken...
pl: Szukaj...
sr: Претрага...
ta: தேடுங்கள் ...
tr: Ara...
uk: Пошук...
zh_hans: 搜寻...

# search_button
source: Search
ar: البحث
ca: Cerca
cs: Vyhledat
de: Suche
eo: Serĉi
es: Buscar
fr: Rechercher
id: Mencari
kab: Nadi
ko: 검색
nl: Zoeken
pl: Szukaj
sr: Претрага
ta: தேடல்
tr: Ara
uk: Пошук
zh_hans: 搜索

source: Second teacher
ar: معلم ثاني
ca: Segon professor
es: Segundo profesor
id: Guru kedua
kab: Aselmad wis sin
nl: Tweede leraar/lerares
pl: Drugi nauczyciel
sr: Други наставник
ta: இரண்டாவது ஆசிரியர்
uk: Друга вчителька
zh_hans: 助教

# second_teacher_copy_prompt
source: Are you sure you want to copy this teacher?
ar: امتأكدٌ أنك تريد نسخ هذا المعلم؟
ca: Estàs segur que vols copiar aquest professor?
es: ¿Estás seguro de que quieres copiar a este profesor?
nl: Weet je zeker dat je deze leraar/lerares wilt kopiëren?
pl: Czy na pewno chcesz skopiować tego nauczyciela?
sr: Да ли сте сигурни да желите да копирате овог наставника?
ta: இந்த ஆசிரியரை நகலெடுக்க விரும்புகிறீர்களா?
uk: Ви впевнені, що хочете скопіювати цього вчителя?
zh_hans: 你确定要模仿这位老师吗？

# second_teacher_prompt
source: Enter a teacher username to invite them.
ar: أدخل إسم المعلم لدعوته
ca: Introdueix un nom d'usuari de professor per convidar-lo.
es: Introduce el nombre del usuario de un profesor para invitarle.
id: Masukkan nama pengguna guru untuk mengundang mereka.
nl: Geef een naam van een leraar/lerares om uit te nodigen.
pl: Wprowadź nazwę użytkownika nauczyciela, aby go zaprosić.
sr: Унесите корисничко име наставника да га позовете.
ta: அவர்களை அழைக்க ஆசிரியர் பயனர்பெயரை உள்ளிடவும்.
uk: Введіть ім’я користувача вчителя, щоб запросити його.
zh_hans: 输入教师用户名以邀请他们。

# second_teacher_warning
source: All teachers in this class can customize it.
ar: كل معلم بهذا الصف يمكنه تعديل الخصائص جميعها.
ca: Tots els professors d'aquesta classe poden personalitzar-la.
es: Todos los profesores de esta clase pueden personalizarlo.
id: Semua guru di kelas ini dapat menyesuaikannya.
nl: Alle leraren/leraressen in deze klas kunnen het aanpassen.
pl: Wszyscy nauczyciele w tej klasie mogą to dostosowywać.
sr: Сви наставници у овом одељењу могу га прилагодити.
ta: இந்த வகுப்பில் உள்ள அனைத்து ஆசிரியர்களும் அதைத் தனிப்பயனாக்கலாம்.
uk: Усі вчителі цього класу можуть налаштувати його.
zh_hans: 本班所有老师都可以定制。
