Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# see_adventure_shared_class
source: You can see this adventure because you share class {class_name} with {creator}
ar: بإمكانك أن ترى هذه المغامرة لأنك تشارك الصف {class_name} مع المُنشأ {creator}
ca: Pots veure aquesta aventura, ja que comparteixes la classe {class_name} amb {creator}
es: Puedes ver esta aventura porque compartes la clase {class_name} con {creator}
nl: Je ziet dit avontuur omdat je in klas {class_name} zit met {creator}
ta: இந்தச் சாகசத்தை நீங்கள் காணலாம், ஏனெனில் நீங்கள் {class_name} ஐ {creator} உடன் பகிர்ந்து கொள்கிறீர்கள்
uk: Ви можете бачити цю пригоду, тому що ви ділитеся класом {class_name} із {creator}

# see_certificate
source: See {username} certificate!
ar: اطلع على شهادة {username}!
ca: Veure certificat de {username}!
de: Zertifikat für {username} ansehen!
eo: Vidi la atestilon de {username}!
es: ¡Ve el certificado de {username}!
fr: Voir le certificat de {username} !
id: Lihat sertifikat {username}!
kab: Wali aselkin {username}!
ko: {username} 인증서 참조!
nl: Zie {username} certificaat!
pl: Zobacz certyfikat {username}!
sr: Погледајте {username} сертификат!
ta: {username} சான்றிதழைக் காண்க!
tr: {username} sertifikasına bakın!
uk: Перегляньте сертифікат {username}!
zh_hans: 查看 {username} 的证书！

source: Select
ar: اختر
bg: Избери
ca: Selecciona
cs: Vyber
de: Auswahl
eo: Elekti
es: Seleccionar
fr: Sélectionner
fy: Kies
hi: चुनें
id: Pilih
kab: Fren
ko: 선택하기
nl: Kies
pl: Wybierz
sr: Изабери
sw: Chagua
ta: தேர்ந்தெடு
tr: Seçin
uk: Виберіть
zh_hans: 选择

# select_adventures
source: Select and order adventures
ar: اختيار المغامرات
ca: Selecciona i ordena aventures
de: Wähle und ordne Abenteuer
eo: Elekti aventurojn
es: Seleccionar y encargar aventuras
fr: Choisissez les aventures
hi: adventures का चयन करें
id: Pilih dan pesan petualangan
ko: 모험 선택 및 주문
nl: Avonturen selecteren
pl: Wybierz przygody
sr: Изаберите и наручите авантуре
ta: சாகசங்களைத் தேர்ந்தெடுத்து ஆர்டர் செய்யுங்கள்
tr: Maceraları seçin ve sıralayın
uk: Виберіть і замовте пригоди
zh_hans: 选择并订购探险

source: Select all
ar: اختر الجميع
ca: Selecciona-ho tot
es: Seleccionar todo
kab: Fren kullec
nl: Selecteer alles
pl: Wybierz wszystko
sr: Изабери све
ta: அனைத்தையும் தெரிவுசெய்
uk: Вибрати все
zh_hans: 全选

source: Select classes
ar: اختر الصفوف
ca: Selecciona classes
es: Seleccionar clases
nl: Selecteer klassen
sr: Изаберите часове
ta: வகுப்புகளைத் தேர்ந்தெடுக்கவும்
uk: Виберіть класи

# select_lang
source: Select language
ar: اختر اللغة
ca: Selecciona l'idioma
eo: Elektu lingvon
es: Selecciona el idioma
kab: Fren tutlayt
nl: Selecteer taal
pl: Wybierz język
sr: Изаберите језик
ta: மொழியைத் தேர்ந்தெடுக்கவும்
uk: Виберіть мову
zh_hans: 选择语言

source: Select levels
ar: اختر المستويات
bg: Избери нива
ca: Selecciona nivells
de: Wähle Level
es: Seleccione los niveles
kab: Fren iswiren
nl: Selecteer niveaus
pl: Wybierz poziomy
sr: Изаберите нивое
ta: நிலைகளைத் தேர்ந்தெடுக்கவும்
uk: Виберіть рівні
zh_hans: 选择级别

source: Selected
ar: المُختار
ca: Seleccionat
es: Seleccionado
kab: Yettwafren
nl: Geselecteerd
pl: Wybrano
sr: Изабрано
ta: தேர்ந்தெடுக்கப்பட்டது
uk: Вибране
zh_hans: 选中的

# self_removal_prompt
source: Are you sure you want to leave this class?
ar: هل أنت متأكد أنك تريد مغادرة هذا الصف؟
ca: Segur vols abandonar aquesta classe?
de: Bist du dir sicher, dass du die Klasse verlassen möchtest?
eo: Ĉu vi certas, ke vi volas forlasi ĉi tiun klason?
es: ¿Estás seguro de que quieres abandonar esta clase?
fr: Voulez-vous vraiment quitter ce cours ?
hi: क्या आप वाकई इस कक्षा को छोड़ना चाहते हैं?
id: Apakah Anda yakin ingin keluar dari kelas ini?
kab: D tidet tebɣiḍ ad teffɣeḍ seg usmil-a?
ko: 정말 이 수업을 나가실 건가요?
nl: Weet je zeker dat je deze klas wilt verlaten?
pl: Czy jesteś pewien, że chcesz opuścić klasę?
sr: Да ли сте сигурни да желите да напустите одељење?
ta: இந்த வகுப்பை விட்டு வெளியேற விரும்புகிறீர்களா?
tr: Bu sınıftan ayrılmak istediğinize emin misiniz?
uk: Ви впевнені, що бажаєте залишити цей курс?
zh_hans: 你确定你要退出这个班级吗？

# send_password_recovery
source: Send me a password recovery link
ar: ارسال رابط لاسترجاع كلمة المرور
ca: Envia'm un enllaç de recuperació de contrasenya
cs: Pošlete mi odkaz na obnovení hesla
de: Wiederherstellungslink für Passwort versenden
eo: Sendu al mi ligilon por rehavi pasvorton
es: Envíame un link para restablecer mi contraseña
fr: Envoyez-moi un lien de récupération de mot de passe
fy: Stjoer my in link om in nij wachtwurd te kiezen
hi: मुझे एक सांकेतिक शब्द पुनर्प्राप्ति लिंक भेजें
id: Kirimkan saya tautan untuk pemulihan password
kab: Azen-iyi-d aseɣwen n tririt n wawal n uɛeddi
ko: 비밀번호 복구 이메일을 보내주세요
nl: Stuur me een link om een nieuw wachtwoord te kiezen
pl: Wyślij mi link do odzyskania hasła
sr: Пошаљите ми везу за опоравак лозинке
sw: Nitumie kiungo cha kurejesha nenosiri
ta: கடவுச்சொல் மீட்பு இணைப்பை எனக்கு அனுப்புங்கள்
tr: Bana bir şifre kurtarma bağlantısı gönder
uk: Надішліть мені посилання для відновлення пароля
zh_hans: 向我发送密码恢复链接

# sent_by
source: This invitation is sent by
ar: تم إرسال الدعوة من قبل
ca: Aquesta invitació ha sigut enviada per
de: Diese Einladung wurde gesendet von
eo: Ĉi tiu invito estis sendita de
es: Esta invitación ha sido mandada por
fr: Cette invitation a été envoyée par
hi: यह आमंत्रण इनके द्वारा भेजा गया है
id: Undangan ini dikirim oleh
kab: Tinnubga-a tettwazen-d sɣur
ko: 이 초대장은 다음 사람에 의해 발송됩니다
nl: Deze uitnodiging is verstuurd door
pl: To zaproszenie zostało wysłane przez
sr: Овај позив је послат од стране
ta: இந்த அழைப்பு அனுப்பப்படுகிறது
tr: Bu davetiye şu kişi tarafından gönderilmiştir
uk: Це запрошення надіслано
zh_hans: 本邀请函由以下单位发出

# sent_password_recovery
source: You should soon receive an email with instructions on how to reset your password.
ar: ستصلك على الفور رسالة على البريد الإلكتروني مع التعليمات الخاصة بإعادة ضبط كلمة المرور الخاصة بك.
ca: Ben aviat rebràs correu electrònic amb les instruccions per reinicialitzar la teva contrasenya.
de: Du solltest bald eine Email mit Anweisungen zum Zurücksetzen des Passworts erhalten.
es: Pronto recibirás un correo electrónico con instrucciones sobre cómo restablecer tu contraseña.
fr: Tu devrais bientôt recevoir un email avec des instructions pour réinitialiser ton mot de passe.
fy: Do krijst sa in emailtsje wêrt yn útlein wurdt hoest in nij wachtwurd kieze kinst.
hi: आपको जल्द ही अपना सांकेतिक शब्द फिर से कायम करने के निर्देशों के साथ एक ईमेल प्राप्त होना चाहिए|
id: Kamu harusnya akan segera menerima email dengan instruksi terkait bagaimana memulihkan password kamu.
kab: Ad teṭṭfeḍ imayl anida ara d-ddun iwellihen ɣef wamek ara twennzeḍ awal n uɛeddi.
ko: 암호를 리셋하는 방법에 대한 지침이 포함된 이메일을 곧 받을 수 있습니다.
nl: Je krijgt zo een mailtje met informatie over hoe je een nieuw wachtwoord kiest.
pl: Niedługo powinieneś otrzymać email z instrukcjami jak zresetować swoje hasło.
sr: Ускоро ћете добити имејл са упутствима како да ресетујете своју лозинку.
sw: Utapokea barua pepe chenye maelezo ya kurejesha nenosiri.
ta: உங்கள் கடவுச்சொல்லை எவ்வாறு மீட்டமைப்பது என்பதற்கான வழிமுறைகளைக் கொண்ட மின்னஞ்சலை விரைவில் பெற வேண்டும்.
tr: Yakında şifrenizi nasıl sıfırlayacağınıza ilişkin talimatları içeren bir e-posta alacaksınız.
uk: Невдовзі ви маєте отримати електронний лист із інструкціями щодо скидання пароля.
zh_hans: 你很快就会收到一封电子邮件，说明如何重置你的密码。

# settings
source: My personal settings
ar: اعداداتي الشخصية
ca: La meva configuració personal
de: Meine persönlichen Einstellungen
eo: Miaj personaj agordoj
es: Mi configuración personal
fr: Mes préférences
hi: ेरी व्यक्तिगत सेटिंग
id: Pengaturan pribadi saya
kab: Iɣewwaren-inu
ko: 내 개인 설정
nl: Mijn gegevens
pl: Moje ustawienia osobiste
sr: Моја лична подешавања
ta: எனது தனிப்பட்ட அமைப்புகள்
tr: Kişisel ayarlarım
uk: Мої особисті налаштування
zh_hans: 我的个人设置

# share_by_giving_link
source: Show your program to other people by giving them the link below:
ar: اعرض برنامجك مع أناس آخرين بإرسال هذا الرابط إليهم:
ca: Mostra el teu programa a altres persones donant-los el següent enllaç:
de: Zeige dein Programm anderen, indem du ihnen den Link unten gibst:
eo: Diskonigu vian programaĵon al aliaj homoj sendante al ili la ĉi-suban ligilon:
es: Muestra tu programa a otras personas dándoles el siguiente enlace:
fr: Partage ton programme avec d'autres personnes en leur donnant le lien suivant :
id: Tunjukkan program Anda kepada orang lain dengan memberi mereka tautan di bawah ini:
kab: Sken ahil-ik i yimdanen niḍen s tikci n useɣwen-a:
ko: 다른 사용자에게 아래 링크를 제공하여 프로그램을 보여줍니다:
nl: Deel je programma met iemand door ze deze link te geven:
pl: Pokaż innym swój program dając im poniższy link:
sr: Прикажите свој програм другим људима давањем везе испод:
ta: கீழே உள்ள இணைப்பை வழங்குவதன் மூலம் உங்கள் திட்டத்தை மற்றவர்களுக்குக் காட்டுங்கள்:
tr: Aşağıdaki bağlantıyı vererek programınızı diğer insanlara gösterin:
uk: Покажіть свою програму іншим людям, надавши їм посилання нижче:
zh_hans: 通过向其他人提供以下链接向他们展示你的程序：

source: Share your program
ar: شارك برنامجك
ca: Comparteix el teu programa
de: Teile dein Programm
eo: Diskonigu vian programaĵon
es: Compartir el programa
fr: Partage ton programme
id: Bagikan program Anda
kab: Bḍu ahil-ik
ko: 프로그램 공유
nl: Deel je programma
pl: Udostępnij swój program
sr: Поделите свој програм
ta: உங்கள் நிரலைப் பகிரவும்
tr: Programınızı paylaşın
uk: Поділіться своєю програмою
zh_hans: 分享你的程序

# signup_student_or_teacher
source: Are you a student or a teacher?
ar: هل أنت طالب أو معلم؟
ca: Ets estudiant o professor?
de: Bist du Schüler(in) oder Lehrperson?
eo: Ĉu vi estas studento aŭ instruisto?
es: ¿Eres un alumno o un profesor?
fr: Êtes-vous un élève ou un enseignant ?
id: Apakah Anda seorang pelajar atau guru?
kab: Kečč d anelmad neɣ d aselmad?
ko: 학생이신가요 아니면 선생님이신가요?
nl: Ben je een leerling of een leraar?
pl: Czy jesteś uczniem czy nauczycielem?
sr: Да ли сте ученик или наставник?
ta: நீங்கள் ஒரு மாணவரா அல்லது ஆசிரியரா?
tr: Öğrenci misiniz yoksa öğretmen mi?
uk: Ви студент чи викладач?
zh_hans: 你是学生还是老师？

# single quotes
source: a single quote
ar: علامة اقتباس أحادية
bg: апострофи
ca: un apòstrof
cs: jednoduché uvozovky
de: ein einfaches Anführungszeichen
eo: unuobla citilo
es: una comilla simple
fr: une apostrophe
fy: inn hege komma
hi: एक उद्धरण चिन्ह
id: kutip satu
ko: 인용구 하나
nl: een hoge komma
pl: pojedynczy cudzysłów
sr: апостроф
sw: nukuu moja
ta: ஒரு மேற்கோள்
tr: bir tek tırnak
uk: одна цитата
zh_hans: 单引号

# slash
source: a slash
ar: علامة الخط المائل ناحية اليمين
bg: наклонена черта
ca: una barra
cs: lomítko
de: ein Schrägstrich
eo: suprenstreko
es: una barra
fr: une barre oblique
fy: in skean streepke
hi: एक स्लैश
id: garis miring
kab: ajerriḍ yeknan
ko: slash
nl: een schuin streepje
pl: ukośnik
sr: коса црта
sw: alama ya kufyeka
ta: ஒரு சாய்வு
tr: bir sağa eğik çizgi
uk: коса риска
zh_hans: 斜杠

source: Sleeping...
ar: نائم...
ca: Dormint...
es: Hibernando...
kab: Iḍes...
sr: Спавање...
ta: தூக்கம் ...
uk: спить...
zh_hans: 休眠...

source: Slides
ar: شرائح
ca: Diapositives
es: Diapositivas
kab: Tibursatin
nl: Dia's
pl: Slajdy
sr: Слајдови
ta: ச்லைடுகள்
uk: Слайди
zh_hans: 幻灯

source: Slides for level
ar: شرائح للمستوى
ca: Diapositives pel nivell
es: Diapositivas para el nivel
kab: Tibursatin i uswir
pl: Slajdy do poziomu
sr: Слајдови за ниво
ta: நிலைக்கு ச்லைடுகள்
uk: Слайди для рівня
zh_hans: 级别幻灯

# slides_info
source: For each level of Hedy, we have created slides to help you teach. The slides contain explanations of each level, and Hedy examples that you can run inside the slides. Just click the link and get started! the Introduction slides are a general explanation of Hedy before level 1 The slides were created using <a href="https://slides.com">slides.com</a>. If you want to adapt them yourself, you can download them, and then upload the resulting zip file to <a href="https://slides.com">slides.com</a>. You can find more information about the slides in the <a href="https://hedy.org/for-teachers/manual/features">teacher's manual</a>.
ar: لكل مستوى من مستويات هيدي، قمنا بإعداد شرائح لمساعدتك في التدريس. تحتوي هذه الشرائح على شروحات لكل مستوى، بالإضافة إلى أمثلة عملية من هيدي يمكنك عرضها داخل الشرائح. ما عليك سوى النقر على الرابط والبدء! تقدم شرائح المقدمة شرحًا عامًا لهيدي قبل المستوى الأول. تم إنشاء هذه الشرائح باستخدام <a href="https://slides.com">slides.com</a>. إذا كنت ترغب في تعديلها بنفسك، يمكنك تنزيلها، ثم تحميل ملف ZIP الناتج إلى <a href="https://slides.com">slides.com</a>. يمكنك العثور على مزيد من المعلومات حول الشرائح في <a href="https://hedy.org/for-teachers/manual/features">دليل المعلم</a>.
ca: Per a cada nivell de Hedy, hem creat diapositives per ajudar-te a ensenyar. Les diapositives contenen explicacions de cada nivell i exemples de Hedy que pots executar dins de les diapositives. Només cal que facis clic a l'enllaç i comencis! Les diapositives d'introducció són una explicació general de Hedy abans del nivell 1. Les diapositives s'han creat utilitzant <a href="https://slides.com">slides.com</a>. Si vols adaptar-les tu mateix, pots descarregar-les i després pujar el fitxer zip resultant a <a href="https://slides.com">slides.com</a>. Pots trobar més informació sobre les diapositives al <a href="https://hedy.org/for-teachers/manual/features">manual del professor</a>.
es: ¡Estas son diapositivas que hemos creado para ayudarte a enseñar con Hedy! Cada diapositiva contiene una explicación de cada nivel, junto con algunos ejemplos.Las diapositivas fueron creadas mediante el servicio <a href="https://slides.com">slides.com</a>; si crear tus propias diapositivas usando estas como partida, puedes descargarlas, y luego subir el archivo zip resultante a <a href="https://slides.com">slides.com</a>. Puedes ver más información acerca de las diapositivas en el <a href="https://hedy.org/for-teachers/manual/features">manual de profesores</a>.
nl: Voor elk niveau (level) in Hedy hebben we dia's (slides) gemaakt om jou te helpen. Deze dia's (slides) bevatten uitleg over elk level, en Hedy voorbeelden die je in dia's (slides) kan tonen/draaien. Klik op de link en begin! De introductie dia's (slides) zijn een generieke uitleg van Hedy, dus voor je begint aan level 1. De dia's (slides) zijn gemaakt met <a href=https://slides.com>slides.com</a>. Als je deze dia's (slides) wilt aanpassen kan je deze downloaden, en daarna uploaden in een zip bestand, naar <a href=https://slides.com>slides.com</a>. Meer informatie over dia's (slides) kan je vinden in de <a href=https://hedy.org/for-teachers/manual/features>Leraren Handleiding (for-teachers manual)</a>.
pl: Dla każdego poziomu Hedy stworzyliśmy slajdy, które pomogą Ci uczyć. Slajdy zawierają wyjaśnienia każdego poziomu oraz przykłady Hedy, które można uruchomić wewnątrz slajdów. Wystarczy kliknąć link i zacząć! slajdy wprowadzające są ogólnym wyjaśnieniem Hedy przed poziomem 1. Slajdy zostały utworzone przy użyciu <a href="https://slides.com">slides.com</a>. Jeśli chcesz je dostosować samodzielnie, możesz je pobrać, a następnie prześlij wynikowy plik zip do <a href="https://slides.com">slides.com</a>. Więcej informacji o slajdach można znaleźć w <a href="https://hedy.org/for-teachers/manual/features">instrukcja dla nauczyciela</a>.
sr: За сваки ниво Hedy-а, креирали смо слајдове да вам помогнемо у предавању. Слајдови садрже објашњења сваког нивоа и Hedy примере које можете покренути унутар слајдова. Само кликните на везу и почните! Уводни слајдови су опште објашњење Hedy-а пре нивоа 1. Слајдови су креирани коришћењем <a href="https://slides.com">slides.com</a>. Ако желите сами да их прилагодите, можете их преузети, а затим отпремити резултујући zip фајл на <a href="https://slides.com">slides.com</a>. Више информација о слајдовима можете пронаћи у <a href="https://hedy.org/for-teachers/manual/features">приручнику за наставнике</a>.
ta: எடியின் ஒவ்வொரு மட்டத்திற்கும், நீங்கள் கற்பிக்க உதவுவதற்காக ச்லைடுகளை உருவாக்கியுள்ளோம். ச்லைடுகளில் ஒவ்வொரு மட்டத்தின் விளக்கங்களும், ச்லைடுகளுக்குள் நீங்கள் இயக்கக்கூடிய எடி எடுத்துக்காட்டுகளும் உள்ளன. இணைப்பைக் சொடுக்கு செய்து தொடங்கவும்! அறிமுகம் ச்லைடுகள் நிலை 1 க்கு முன்னர் எடியின் பொதுவான விளக்கமாகும் <a href = "https://slides.com"> ச்லைடு.காம் </a> ஐப் பயன்படுத்தி ச்லைடுகள் உருவாக்கப்பட்டன. அவற்றை நீங்களே மாற்றியமைக்க விரும்பினால், அவற்றை பதிவிறக்கம் செய்து, இதன் விளைவாக வரும் சிப் கோப்பை <a href = "https://slides.com"> ச்லைடு.காம் </a> இல் பதிவேற்றலாம். ச்லைடுகளைப் பற்றிய கூடுதல் தகவல்களை <a href = "https://hedy.org/for-teachers/manual/features"> ஆசிரியரின் கையேடு </a> இல் காணலாம்.
uk: Для кожного рівня Hedy ми створили слайди, які допоможуть вам навчати. Слайди містять пояснення кожного рівня та приклади Hedy, які можна запускати на слайдах. Просто клацніть посилання та почніть! Слайди вступу є загальним поясненням Hedy до рівня 1. Слайди створено за допомогою <a href="https://slides.com">slides.com</a>. Якщо ви хочете адаптувати їх самостійно, ви можете завантажити їх, а потім завантажити отриманий файл zip на <a href="https://slides.com">slides.com</a>. Ви можете знайти більше інформації про слайди в <a href="https://hedy.org/for-teachers/manual/features">посібнику для вчителя</a>.
zh_hans: 对于 海蒂 的每个级别，我们都创建了幻灯片来帮助您教学。 这些幻灯片包含每个级别的说明以及您可以在幻灯片中运行的 海蒂 示例。 只需点击链接即可开始！ 简介幻灯片是对 1 级之前的 海蒂 的一般说明。幻灯片是使用 <a href="https://slides.com">slides.com</a> 创建的。 如果您想自行调整它们，可以下载它们，然后将生成的 zip 文件上传到 <a href="https://slides.com">slides.com</a>。 您可以在<a href="https://hedy.org/for-teachers/manual/features">教师手册</a>中找到有关幻灯片的更多信息。

source: Social media
ar: وسائل التواصل الاجتماعي
ca: Xarxes socials
de: Soziale Medien
es: Redes sociales
fr: Réseau social
id: Media sosial
kab: Azeṭṭa anmetti
ko: 소셜 미디어
nl: Sociale media
pl: Media społecznościowe
sr: Друштвени медији
ta: சமூக ஊடகங்கள்
tr: Sosyal medya
uk: Соціальні мережі
zh_hans: 社交媒体

source: Solution
ar: حل
nl: Oplossing
ta: நீர்மக்கூழ்
uk: Рішення

source: Solution Example
ar: مثال للحل
ca: Exemple de solució
es: Solución al ejemplo
kab: Amedya n tifrat
nl: Voorbeeldoplossing
pl: Przykład rozwiązania
sr: Пример решења
ta: தீர்வு எடுத்துக்காட்டு
uk: Приклад рішення
zh_hans: 解决方案示例

# solution_example_explanation
source: This is where the solution of your adventure goes. This can be used if you want to share this adventure with other teacher's, so they can know what your suggested solution is.
ar: ضع حل مغامرتك هنا. بإمكانك مشاركة المغامرة مع أي معلم آخر، وسيعرفون حينئذ ما هو حلك المقترح.
ca: Aquí va la solució de la teva aventura. Això es pot utilitzar si vols compartir aquesta aventura amb altres professors, perquè puguin saber quina és la teva solució suggerida.
es: Aquí es donde va la solución de tu aventura. Puedes utilizarlo si quieres compartir esta aventura con otros profesores, para que sepan cuál es la solución que propones.
nl: Dit is plek om de oplossing van jouw avontuur op te schrijven. Dit is handig om te gebruiken wanneer je jouw avontuur wilt delen met andere leraren, zodat ze kunnen weten wat je voorgestelde oplossing is.
pl: To jest rozwiązanie twojej przygody. Możesz go użyć, jeśli chcesz podzielić się tą przygodą z innymi nauczycielami, aby mogli się dowiedzieć, jakie jest twoje sugerowane rozwiązanie.
sr: Овде иде решење ваше авантуре. Ово се може користити ако желите да поделите ову авантуру са другим наставницима, како би знали шта је ваше предложено решење.
ta: உங்கள் சாகசத்தின் தீர்வு இங்குதான் செல்கிறது. இந்த சாகசத்தை நீங்கள் மற்ற ஆசிரியர்களுடன் பகிர்ந்து கொள்ள விரும்பினால் இதைப் பயன்படுத்தலாம், எனவே நீங்கள் பரிந்துரைத்த தீர்வு என்ன என்பதை அவர்கள் அறிந்து கொள்ள முடியும்.
uk: Ось де рішення вашої пригоди. Це можна використати, якщо ви хочете поділитися цією пригодою з іншими вчителями, щоб вони могли знати, яке рішення ви пропонуєте.
zh_hans: 这是您冒险的解决方案。如果您想与其他老师分享这次冒险，可以使用它，这样他们就可以知道您建议的解决方案是什么。

# some_rows_missing_separator
source: The following rows are missing a semicolon, so either the username or the password is missing: {rows}
ar: الصفوف التالية تفتقر إلى فاصلة منقوطة، لذا إما أن اسم المستخدم أو كلمة المرور مفقود: {rows}
ca: Les següents files no tenen un punt i coma, així que falta el nom d'usuari o la contrasenya: {rows}
es: Las siguientes filas están faltando un punto y coma, por lo que falta el nombre de usuario o la contraseña: {rows}
sr: Следећи редови недостају тачку зарез, тако да недостаје или корисничко име или лозинка: {rows}
ta: பின்வரும் வரிசைகள் அரைக்காற்புள்ளியைக் காணவில்லை, எனவே பயனர்பெயர் அல்லது கடவுச்சொல் இல்லை: {rows}
uk: У наступних рядках відсутня крапка з комою, тому немає імені користувача або пароля: {rows}
zh_hans: 以下行缺少分号，因此缺少用户名或密码：{rows}

# space
source: a space
ar: مسافة إزاحة
bg: шпация
ca: un espai
cs: mezera
de: ein Leerzeichen
eo: spaceto
es: un espacio
fr: un espace
fy: in spaasje
hi: एक रिक्त स्थान
id: spasi
kab: tallunt
ko: 띄어쓰기
nl: een spatie
pl: spacja
sr: размак
sw: nafasi
ta: ஒரு இடம்
tr: bir boşluk
uk: пробіл
zh_hans: 空格

# star
source: a star
ar: علامة النجمة
bg: звезда
ca: un asterisc
cs: hvězdička
de: ein Stern
eo: asterisko
es: un asterisco
fr: une étoile
fy: in stjerke
hi: एक तारा चिन्ह
id: bintang
kab: itri
ko: 스타
nl: een sterretje
pl: gwiazda
sr: звездица
sw: alama ya nyuta
ta: ஒரு விண்மீன்
tr: bir yıldız
uk: зірка
zh_hans: 星号

source: Start learning
ar: ابدأ بالتعلم
ca: Comença a aprendre
es: Comienza a aprender
kab: Bdu almad
nl: Begin als leerling
pl: Rozpocznij naukę
sr: Почни са учењем
ta: கற்கத் தொடங்குங்கள்
uk: Почніть навчання
zh_hans: 开始学习

source: Start quiz
ca: Comença el qüestionari
de: Quiz starten
fr: Démarrer le questionnaire
id: Mulai kuis
ko: 퀴즈시작
nl: Start de Hedy Quiz
pl: Zacznij quiz
sr: Започни квиз
tr: Kısa sınavı başlatın
uk: Розпочати вікторину
zh_hans: 开始测验

source: Start teaching
ar: ابدأ بالتعليم
ca: Comença a ensenyar
es: Empezar a enseñar
kab: Bdu aselmed
nl: Begin als leraar
pl: Rozpocznij nauczanie
sr: Почни са предавањем
ta: கற்பிக்கத் தொடங்குங்கள்
uk: Почніть викладати
zh_hans: 开始教学

# step_title
source: Assignment
ar: المهمة
bg: Задача
ca: Tasca
cs: Úkol
de: Aufgabe
es: Tarea
fr: Devoir
fy: Opjefte
hi: कार्यभार
id: Tugas
nl: Opdracht
pl: Zadanie domowe
sr: Задатак
sw: Kazi Ya ziada
ta: ஒதுக்கீடு
tr: Ödev
uk: призначення
zh_hans: 任务

# stepper_variable_role
source: stepper
ar: الزائد
ca: pas a pas
es: paso a paso
sr: корак
ta: ச்டெப்பர்
uk: степпер
zh_hans: 步进机

source: Stop
ar: توقف
ca: Para
es: Parar
kab: Ḥbes
sr: Заустави
ta: நிறுத்து
uk: СТІЙ
zh_hans: 停止

# stop_code_button
source: Stop program
ar: ايقاف البرنامج
ca: Para el programa
cs: Zastavit program
de: Programm stoppen
eo: Ĉesigi programon
es: Detener programa
fr: Arrêter le programme
id: Hentikan program
kab: Ḥbes ahil
ko: 프로그램 중지
nl: Stop programma
pl: Zatrzymaj program
sr: Заустави програм
ta: நிறுத்தம் நிரல்
tr: Programı durdur
uk: Зупинити програму
zh_hans: 停止程序

# string
source: text
ar: نص
eo: teksto
es: texto
fr: un texte
hi: टेक्स्ट
id: teks
kab: aḍris
ko: 본문
nl: tekst
pl: tekst
sr: текст
ta: உரை
tr: metin
uk: текст
zh_hans: 文本

# student_accounts_created
source: Successfully created student accounts
ar: لقد أنشأت حسابات طلاب بنجاح
ca: Comptes d'alumne creats amb èxit
es: Cuentas de alumno creadas con éxito
kab: Timerna n yimiḍanen n yinelmaden tedda akken iwata
nl: Studentenaccounts succesvol aangemaakt
sr: Успешно креирани ученички налози
ta: மாணவர் கணக்குகளை வெற்றிகரமாக உருவாக்கியது
uk: Успішно створені облікові записи студентів
zh_hans: 成功创建学生账户

# student_adventures_table
source: Student's Adventures
ar: مغامرات الطلاب
ca: Aventures de l'alumne
es: Las aventuras de los alumnos
kab: Tidyanin n unelmad
nl: Leerling avonturen
pl: Przygoda ucznia
sr: Авантуре ученика
ta: மாணவர்களின் சாகசங்கள்
uk: Студентські пригоди
zh_hans: 学生的探险
