Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# template_code
source: This is the explanation of my adventure! This way I can show a command: <code>print</code> But sometimes I might want to show a piece of code, like this: <pre> ask What's your name? echo so your name is </pre>
ca: Aquesta és l'explicació de la meva aventura! D'aquesta manera puc mostrar una comanda: <code>print</code> Però de vegades podria voler mostrar una peça de codi, així: <pre> ask Quin és el teu nom? echo El teu nom és </pre>
de: Dies ist die Erklärung zu meinem Abenteuer! So kann ich einen Befehl zeigen: <code>{print}</code> Aber manchmal möchte ich ein Stück Code wie folgt zeigen: <pre> ask Wie ist dein Name? echo also ist dein Name </pre>
es: ¡Esta es la explicación de mi aventura! De esta manera puedo mostrar un comando: <code>print</code> Pero a veces es posible que quiera mostrar un fragmento de código, como este: <pre> pregunta ¿Cuál es tu nombre? echo así que tu nombre es </pre>
fr: C'est l'explication de mon aventure ! De cette manière, je peux montrer une commande : <code>{print}</code> Mais parfois, je pourrais vouloir montrer un bout de code comme cela : <pre> ask Quel est ton nom ? echo Ainsi ton nom est </pre>
id: Ini merupakan penjelasan petualangan saya! Dengan cara ini saya bisa menampilkan perintah: <code>{print}</code> Namun terkadang saya mungkin ingin menampilkan sepotong kode, seperti ini: <pre> ask Siapa namamu? echo jadi namamu </pre>
kab: Wagi d asegzu n tedyant-iw! Abrid-a zemreɣ ad d-sekneɣ taladna: <code>siggez</code> D acu tikwal yewwi-d ad d-sekneɣ cwiṭ kan seg tengalt, akka: <pre> ssuter Isem-ik? echo isem-ik </pre>
ko: 이것이 나의 모험에 대한 설명이다! 이렇게 하면 명령을 표시할 수 있습니다. <code>{print}</code> 하지만 가끔은 이런 코드를 보여주고 싶을 수도 있어요: <pre> {ask} What's your name? {echo} so your name is </pre>
pl: To jest wyjaśnienie do mojej przygody! W ten sposób mogę pokazać polecenie: <code>print</code> Ale czasami mogę chcieć pokazać fragment kodu, jak ten: <pre> ask Jak masz na imię? echo twoje imię to </pre>
sr: Ово је објашњење моје авантуре! На овај начин могу показати команду: <code>print</code> Али понекад можда желим да покажем део кода, овако: <pre> ask Како се зовеш? echo дакле твоје име је </pre>
ta: இது எனது சாகசத்தின் விளக்கம்! இந்த வழியில் நான் ஒரு கட்டளையைக் காட்ட முடியும்: <code> அச்சு </code> ஆனால் சில நேரங்களில் நான் இது போன்ற ஒரு குறியீட்டைக் காட்ட விரும்பலாம்: <pre> உங்கள் பெயர் என்ன என்று கேளுங்கள்? எதிரொலி எனவே உங்கள் பெயர் </pre>
uk: Ось пояснення моєї пригоди! Таким чином я можу показати команду: <code>print</code> Але іноді я можу показати фрагмент коду, як-от: <pre> запитай Як тебе звати? echo так ваше ім'я </pre>

source: This adventure has an example solution
ar: هذه المغامرة لها مثال للحل
ca: Aquesta aventura té un exemple de solució
es: Esta aventura tiene una solución de ejemplo
nl: Dit avontuur heeft een voorbeeldoplossing
sr: Ова авантура има пример решења
ta: இந்த சாகசத்திற்கு ஒரு எடுத்துக்காட்டு தீர்வு உள்ளது
uk: Ця пригода має приклад рішення

# this_turns_in_assignment
source: This turns in your assignment to your teacher.
ar: قدم واجبك إلى المعلم.
ca: Això entrega la teva tasca al teu professor.
de: Dies gibt deine Lösung an deine Lehrerin oder deinen Lehrer ab.
es: Esto entrega tu tarea a tu profesor.
fr: Envoyer le devoir au professeur.
id: Ini menyerahkan tugas Anda kepada guru Anda.
ko: 이것은 당신이 선생님께 해야할 과제가 된다.
nl: Dit levert je opdracht in bij je leraar.
pl: To przekazuje twoje zadanie twojemu nauczycielowi.
sr: Ово предаје ваш задатак вашем наставнику.
ta: இது உங்கள் ஆசிரியருக்கு உங்கள் வேலையில் மாறுகிறது.
tr: Bu, ödevinizi öğretmeninize teslim etmenizi sağlar.
uk: Це перетворює ваше завдання на вчителя.
zh_hans: 这会将您的作业交给老师。

source: Title
ar: العنوان
ca: Títol
de: Titel
eo: Titolo
es: Título
fr: Titre
hi: शीर्षक
id: Judul
kab: Azwel
ko: 제목
nl: Titel
pl: Tytuł
sr: Наслов
ta: தலைப்பு
tr: Bulmaca
uk: Назва
zh_hans: 标题

# title_admin
source: Hedy - Administrator page
ar: هيدي - صفحة الإدارة
ca: Hedy - Pàgina d'administrador
de: Hedy - Administratorseite
eo: Hedy - Paĝo por administranto
es: Hedy - Página de administración
fr: Hedy – Page d'administration
id: Hedy - Halaman Pengelola
ko: Hedy - Administrator 페이지
nl: Hedy - Administrator pagina
pl: Hedy - Strona Administratora
sr: Hedy - Администраторска страница
ta: எடி - நிர்வாகி பக்கம்
tr: Hedy - Yönetici sayfası
uk: Hedy - сторінка адміністратора
zh_hans: Hedy - 管理员页面

# title_class-overview
source: Hedy - Class overview
ar: هيدي - نظرة عامة على الصف
ca: Hedy - Visió general de la classe
de: Hedy - Klassenüberblick
eo: Hedy - Superrigardo pri klaso
es: Hedy - Visión general de la clase
fr: Hedy – Classe
id: Hedy - Ikhtisar kelas
ko: Hedy - 수업 개요
nl: Hedy - Klas overzicht
pl: Hedy - Informacje o klasie
sr: Hedy - Преглед одељења
ta: எடி - வகுப்பு கண்ணோட்டம்
tr: Hedy - Sınıfa genel bakış
uk: Hedy - Огляд класу
zh_hans: 海蒂 - 班级概况

# title_customize-adventure
source: Hedy - Customize adventure
ar: هيدي - تخصيص مغامرة
ca: Hedy - Personalitza l'aventura
de: Hedy - Bearbeite Abenteuer
eo: Hedy - Adapti aventuron
es: Hedy - Configurar aventura
fr: Hedy – Modifier une aventure
id: Hedy - Sesuaikan petualangan
kab: Hedy - Sagen tadyant
ko: Hedy - 모험 사용자 지정
nl: Hedy - Avontuur personaliseren
pl: Hedy - Spersonalizuj przygodę
sr: Hedy - Прилагоди авантуру
ta: எடி - சாகசத்தைத் தனிப்பயனாக்குங்கள்
tr: Hedy - Macerayı özelleştirin
uk: Hedy - Налаштуйте пригоду
zh_hans: 海蒂-定制自己的探险活动

# title_customize-class
source: Hedy - Customize class
ar: هيدي - تخصيص صف
ca: Hedy - Personalitza la classe
de: Hedy - Klasse anpassen
eo: Hedy - Adapti klason
es: Hedy - Personalizar clase
fr: Hedy – Modifier une classe
id: Hedy - Sesuaikan kelas
kab: Hedy - Sagen asmil
ko: Hedy - 수업 사용자 정의
nl: Hedy - Klas personaliseren
pl: Hedy - Spersonalizuj klasę
sr: Hedy - Прилагоди одељење
ta: எடி - வகுப்பைத் தனிப்பயனாக்குங்கள்
tr: Hedy - Sınıfı özelleştirin
uk: Hedy - Налаштувати клас
zh_hans: 海蒂 - 自定义课程

# title_for-teacher
source: Hedy - For teachers
ar: هيدي - للمعلمين
bg: Хеди - За учители
ca: Hedy - Per a professorat
cs: Hedy - pro učitele
de: Hedy - Für Lehrende
eo: Hedy - Por instruistoj
es: Hedy - Para profesores
fr: Hedy - Pour les professeurs
id: Hedy - Untuk pengajar
kab: Hedy - I yiselmaden
ko: Hedy - 선생님용
nl: Hedy - Voor leraren
pl: Hedy - Dla nauczycieli
sr: Hedy - За наставнике
ta: எடி - ஆசிரியர்களுக்கு
tr: Hedy - Öğretmenler için
uk: Hedy - Для вчителів
vi: Hedy - Dành cho giáo viên
zh_hans: 海蒂 - 教师专用

# title_join-class
source: Hedy - Join class
ca: Hedy - Uneix-te a la classe
de: Hedy - Klasse beitreten
fr: Hedy – Rejoindre une classe
id: Hedy - Bergabung kelas
ko: Hedy - 수업 참여
nl: Hedy - Inschrijven voor klas
pl: Hedy - Dołącz do klasy
sr: Hedy - Придружите се одељењу
tr: Hedy - Sınıfa katılın
uk: Хеді - Приєднуйтесь до класу
zh_hans: 海蒂 - 加入班级

# title_learn-more
source: Hedy - Learn more
ar: هيدي - اعرف أكثر
bg: Хеди - Научи повече
ca: Hedy - Més informació
cs: Hedy - dozvědět se více
de: Hedy - Mehr erfahren
eo: Hedy - Lerni plu
es: Hedy - Aprender más
fr: Hedy - En savoir plus
id: Hedy - Pelajari lebih lanjut
kab: Hedy - Issin ugar
ko: Hedy - 자세히 보기
nl: Hedy - Meer info
pl: Hedy - Dowiedz się więcej
sr: Hedy - Сазнајте више
ta: எடி - மேலும் அறிக
tr: Hedy - Daha fazlasını öğrenin
uk: Hedy - Дізнатись більше
zh_hans: 海蒂 - 了解更多

# title_login
source: Hedy - Login
ar: هيدي - تسجيل الدخول
bg: Хеди - Влез
ca: Hedy - Iniciar Sessió
cs: Hedy - přihlášení
eo: Hedy - Saluti
es: Hedy - Iniciar sesión
fr: Hedy - Connexion
id: Hedy - Masuk
kab: Hedy - Tuqqna
ko: Hedy - 로그인
nl: Hedy - Inloggen
pl: Hedy - Logowanie
sr: Hedy - Пријавите се
ta: எடி - உள்நுழைவு
tr: Hedy - Giriş
uk: Hedy - Вхід
zh_hans: 海蒂 - 登录

# title_my-profile
source: Hedy - My account
ar: هيدي - حسابي
bg: Хеди - Моят акаунт
ca: Hedy - El meu compte
cs: Hedy - můj účet
de: Hedy - Mein Konto
eo: Hedy - Mia konto
es: Hedy - Mi Cuenta
fr: Hedy - Mon compte
id: Hedy - Akun saya
kab: Hedy - Amiḍan-iw
ko: Hedy - 내 계정
nl: Hedy - Mijn account
pl: Hedy - Moje konto
sr: Hedy - Мој налог
ta: எடி - என் கணக்கு
tr: Hedy - Hesabım
uk: Hedy - Мій аккаунт
zh_hans: 海蒂 - 我的账户

# title_privacy
source: Hedy - Privacy terms
ar: هيدي - شروط الخصوصية
bg: Хеди - Условия за поверителност
ca: Hedy - Condicions de privacitat
de: Hedy - Datenschutzerklärung
eo: Hedy - Kondiĉoj pri privateco
es: Hedy - Términos de privacidad
fr: Hedy - Conditions de confidentialité
id: Hedy - Persyaratan privasi
kab: Hedy - Tiwtilin n tbaḍnit
ko: Hedy - 개인 정보 보호 약관
nl: Hedy - Privacyverklaring
pl: Hedy - Polityka prywatności
sr: Hedy - Услови приватности
ta: எடி - தனியுரிமை விதிமுறைகள்
tr: Hedy - Gizlilik koşulları
uk: Hedy - Умови конфіденційності
zh_hans: 海蒂 - 隐私条款

# title_programs
source: Hedy - My programs
ar: هيدي -برامجي
bg: Хеди - Мойте програми
ca: Hedy - Els meus programes
cs: Hedy - Moje programy
de: Hedy - Meine Programme
eo: Hedy - Miaj programoj
es: Hedy - Mis programas
fr: Hedy - Mes programmes
id: Hedy - Program saya
kab: Hedy - Ihalan-iw
ko: Hedy - 내 프로그램
nl: Hedy - Mijn programma's
pl: Hedy - Moje programy
sr: Hedy - Моји програми
ta: எடி - எனது நிகழ்ச்சிகள்
tr: Hedy - Programlarım
uk: Hedy - Мої програми
vi: Hedy - Chương trình của tôi
zh_hans: 海蒂 - 我的程序

# title_public-adventures
source: Hedy - Public adventures
ar: هيدي - المغامرات العامة
ca: Hedy - Aventures públiques
es: Hedy - Aventuras en público
kab: Hedy - Tidyanin tizayazin
nl: Hedy - Publieke avonturen
pl: Hedy - Publiczne przygody
sr: Hedy - Јавне авантуре
ta: எடி - பொது சாகசங்கள்
uk: Хеді - Публічні пригоди
zh_hans: 海蒂 - 公共冒险

# title_recover
source: Hedy - Recover account
ar: هيدي - استرجاع الحساب
bg: Хеди - Възстанови акаунт
ca: Hedy - Recupera compte
cs: Hedy - obnovení účtu
de: Hedy - Konto wiederherstellen
eo: Hedy - Reakiri konton
es: Hedy - Recuperar cuenta
fr: Hedy - Récupérer le compte
id: Hedy - Pulihkan akun
kab: Hedy - Err-d amiḍan
ko: Hedy - 계정 복구
nl: Hedy - Account herstellen
pl: Hedy - Odzyskaj konto
sr: Hedy - Опоравак налога
ta: எடி - கணக்கை மீட்டெடுங்கள்
tr: Hedy - Hesabı kurtar
uk: Hedy - Відновити акаунт
zh_hans: 海蒂 - 恢复帐户

# title_reset
source: Hedy - Reset password
ar: هيدي - اعادة ضبط كلمة المرور
bg: Хеди - Възстанови парола
ca: Hedy - Restablir la contrasenya
cs: Hedy - obnovení hesla
de: Hedy - Passwort zurücksetzen
eo: Hedy - Restarigi pasvorton
es: Hedy - Restablecer la contraseña
fr: Hedy - Réinitialiser le mot de passe
id: Hedy - Setel ulang kata sandi
kab: Hedy - Wennez awal n uɛeddi
ko: Hedy - 암호 리셋
nl: Hedy - Wachtwoord resetten
pl: Hedy - Zresetuj hasło
sr: Hedy - Ресетовање лозинке
ta: எடி - கடவுச்சொல்லை மீட்டமைக்கவும்
tr: Hedy - Şifreyi sıfırla
uk: Hedy - Змінити пароль
zh_hans: 海蒂 - 重置密码

# title_signup
source: Hedy - Create an account
ar: هيدي - انشاء حساب
bg: Хеди - Създай акаунт
ca: Hedy - Crea un compte
cs: Hedy - vytvoření účtu
de: Hedy - Konto erstellen
eo: Hedy - Krei konton
es: Hedi - Crea una cuenta
fr: Hedy - Créer un compte
id: Hedy - Buat akun
kab: Hedy - Asnulfu n umiḍan
ko: Hedy - 계정 생성하기
nl: Hedy - Account aanmaken
pl: Hedy - Utwórz konto
sr: Hedy - Направите налог
ta: எடி - ஒரு கணக்கை உருவாக்கவும்
tr: Hedy - Bir hesap oluşturun
uk: Hedy - Створити акаунт
zh_hans: 海蒂 - 创建一个帐户

# title_start
source: Hedy - Textual programming made easy
ar: هيدي - لغة برمجة متدرجة
bg: Хеди - Постепеннен език за програмиране
ca: Hedy - La programació textual feta fàcil
de: Hedy - Eine graduelle Programmiersprache
eo: Hedy - Laŭgrada programlingvo
es: Hedy - Programación textual fácil
fr: Hedy - La programmation textuelle facilement
id: Hedy - Pemrograman teks menjadi mudah
kab: Hedy - Asihel aḍrisan afessas
ko: Hedy - 텍스트 프로그래밍이 쉬워졌습니다
nl: Hedy - Een graduele programmeertaal
pl: Hedy - Stopniowany język programowania
sr: Hedy - Лако текстуално програмирање
ta: எடி - உரை நிரலாக்கமானது எளிதானது
tr: Hedy - Metinsel programlama kolaylaştı
uk: Hedy - Мова поступового програмування
zh_hans: 海蒂 - 一门循序渐进的编程语言

# title_view-adventure
source: Hedy - View adventure
ar: هيدي - عرض مغامرة
ca: Hedy - Veure l'aventura
de: Hedy - Abenteuer ansehen
eo: Hedy - Vidi aventuron
es: Hedy - Ver aventura
fr: Hedy – Voir une aventure
id: Hedy - Lihat petualangan
ko: Hedy - 모험 보기
nl: Hedy - Avontuur bekijken
pl: Hedy - Wyświetl przygodę
sr: Hedy - Погледај авантуру
ta: எடி - சாகசத்தைக் காண்க
tr: Hedy - Macerayı görüntüle
uk: Hedy - Переглянути пригоди
zh_hans: 海蒂-查看探险活动

# token_invalid
source: Your token is invalid.
ar: الرمز الخاص بك غير صالح.
ca: El teu token és invàlid.
de: Dein Token ist ungültig.
eo: Via ĵetono ne validas.
es: Tu token no es válido.
fr: Votre clé n'est pas valide.
hi: आपका टोकन अमान्य है
id: Token Anda tidak valid.
ko: 토큰이 올바르지 않습니다.
nl: Jouw token is ongeldig.
pl: Twój token jest nieprawidłowy.
sr: Ваш токен је неважећи.
ta: உங்கள் கிள்ளாக்கு தவறானது.
tr: Bağlanma jeton dizesi geçersiz.
uk: Ваш маркер недійсний.
zh_hans: 你的令牌无效。

# too_many_accounts
source: You cannot create more than 100 student accounts.
ar: لا يمكنك إنشاء أكثر من 100 حساب طالب.
ca: No pots crear més de 100 comptes d'estudiant.
es: No se pueden crear más de 100 cuentas de alumno.
kab: Ur tezmireḍ ara ad d-tesnulfuḍ ugar n 100 yimiḍanen n yinelmaden.
nl: Je kunt niet meer dan 100 studentenaccounts aanmaken.
sr: Не можете креирати више од 100 ученичких налога.
ta: 100 க்கும் மேற்பட்ட மாணவர் கணக்குகளை நீங்கள் உருவாக்க முடியாது.
uk: Ви не можете створити більше 100 облікових записів студентів.
zh_hans: 您不能创建超过 100 个学生帐户。

# tooltip_level_locked
source: Your teacher disabled this level
ar: قام معلمك بتعطيل هذا المستوى
ca: El teu professor ha desactivat aquest nivell
es: Su profesor desactivó este nivel
nl: Je leraar heeft dit level gesloten
pl: Twój nauczyciel wyłączył ten poziom
sr: Ваш наставник је онемогућио овај ниво
ta: உங்கள் ஆசிரியர் இந்த நிலையை முடக்கியுள்ளார்
uk: Ваш учитель вимкнув цей рівень
zh_hans: 你的老师禁用了这个级别

# translate_error
source: Something went wrong while translating the code. Try running the code to see if it has an error. Code with errors can not be translated.
ar: حدث خطأ ما خلال ترجمة البرنامج. حاول تنفيذ البرنامج وافحص وجود خطأ فيه. البرنامج الذي يحتوي على خطأ لا يمكن أن تتم ترجمته.
bg: Изникна проблем при превеждането на кода. Опитай се да компилираш кода за да видиш дали има грешка. Код с грешки не може да се преведе.
ca: Alguna ha anat malament durant la traducció del codi. Prova d'executar-lo a veure si té un error. Quan el codi té un error no es pot traduir.
cs: Při provádění kódu se něco pokazilo. Zkuste kód spustit a zjistit, zda neobsahuje chybu. Kód s chybami nelze provést.
de: Während der Übersetzung des Codes ist etwas schiefgegangen. Versuche, den Code auszuführen, um zu sehen, ob er einen Fehler enthält. Fehlerhafter Code kann nicht übersetzt werden.
eo: Io misfunkciis dum tradukado de la kodo. Provu ruli la kodon por kontroli, ĉu ĝi havas eraron. Kodo enhavanta erarojn ne estas tradukebla.
es: Algo salió mal al traducir el código. Intenta ejecutar el código para ver si tiene un error. El código con errores no se puede traducir.
fr: Quelque chose s'est mal passé lors de la traduction du code. Essayez d'exécuter le code pour voir s'il contient une erreur. Le code avec des erreurs ne peut pas être traduit.
id: Ada yang tidak beres saat menerjemahkan kode. Coba jalankan kode untuk melihat apakah ada kesalahan. Kode dengan kesalahan tidak dapat diterjemahkan.
ko: 코드를 번역하는 동안 오류가 발생했습니다. 코드를 실행하여 오류가 있는지 확인해 보십시오. 오류가 있는 코드는 번역할 수 없습니다.
nl: Er is iets misgegaan met het vertalen van de code. Probeer je code te runnen om te kijken of er misschien een foutje in zit. Code met foutjes kan niet vertaald worden.
pl: Coś poszło nie tak podczas tłumaczenia tego programu. Spróbuj uruchomić program, aby sprawdzić czy ma błąd. Kod z błędami nie może być przetłumaczony.
sr: Нешто је пошло наопако приликом превођења кода. Покушајте да покренете код да видите да ли има грешку. Код са грешкама не може бити преведен.
ta: குறியீட்டை மொழிபெயர்க்கும்போது ஏதோ தவறு ஏற்பட்டது. குறியீட்டை பிழை இருக்கிறதா என்று பார்க்க முயற்சிக்கவும். பிழைகள் கொண்ட குறியீட்டை மொழிபெயர்க்க முடியாது.
tr: Kodu çevirirken bir şeyler yanlış gitti. Hata olup olmadığını görmek için kodu çalıştırmayı deneyin. Hata içeren kod çevrilemez.
uk: Щось пішло не так під час виконання перекладу коду. Спробуйте запустити код на виконання, щоб перевірити, чи немає в ньому помилки. Код з помилками не може бути перекладений.
zh_hans: 翻译代码时出了点问题。尝试运行代码以查看它是否有错误。有错误的代码无法翻译。

source: Translating Hedy
ar: ترجمة هيدي
ca: Traduint Hedy
de: Hedy übersetzen
es: Traducción de Hedy
fr: Traduire Hedy
id: Menerjemahkan Hedy
ko: Hedy 번역
nl: Hedy vertalen
pl: Tłumaczenie Hedy
sr: Превођење Hedy-а
ta: மொழிபெயர்ப்பு எடி
tr: Hedy'nin çevirisini yapmak
uk: Перекласти Hedy
zh_hans: 翻译 海蒂

source: Translator
ar: مترجم
ca: Traductor
de: Übersetzer
es: Traductor
id: Penerjemah
kab: Amsuqel
nl: Vertaler
pl: Tłumacz
sr: Преводилац
ta: மொழிபெயர்
tr: Çevirmen
uk: Перекладач
zh_hans: 翻译

# turned_into_teacher
source: Congratulations! You successfully turned into a teacher.
ar: تهانينا! لقد صرت معلما.
ca: Enhorabona! T'has convertit en professor amb èxit.
es: ¡Enhorabuena! Te has convertido en profesor con éxito.
nl: Gefeliciteerd! Je bent succesvol veranderd in een leraar.
pl: Gratulacje! Z powodzeniem zostałeś nauczycielem.
sr: Честитамо! Успешно сте постали учитељ.
ta: வாழ்த்துக்கள்! நீங்கள் வெற்றிகரமாக ஆசிரியராக மாறினீர்கள்.
uk: Щиро вітаю! Ви успішно перетворилися на вчителя.
zh_hans: 恭喜！你已成功晋升为教师。

# unauthorized
source: You don't have access rights for this page
ar: ليس لديك الصلاحيات اللازمة للوصول إلى هذه الصفحة
bg: Нямаш достъп до тази страница
ca: No tens permisos per accedir a aquesta pàgina
cs: Nemáte oprávnění k přístupu na tuto stránku
de: Du hast keine Zugriffsrechte für diese Seite
eo: Al vi mankas la rajto atingi ĉi tiun paĝon
es: Usted tiene acceso a esta página
fr: Vous n’avez pas les droits d’accès à cette page
id: Anda tidak memiliki hak akses untuk halaman ini
ko: 이 페이지에 대한 액세스 권한이 없습니다
nl: Jij hebt geen rechten voor deze pagina
pl: Nie masz dostępu do tej strony
sr: Немате права приступа за ову страницу
ta: இந்த பக்கத்திற்கான அணுகல் உரிமைகள் உங்களிடம் இல்லை
tr: Bu sayfa için erişim izniniz yok
uk: У вас немає прав доступу до цієї сторінки
vi: Bạn không có quyền truy cập trang này
zh_hans: 你没有此页面的访问权限

# unfavourite_confirm
source: Are you sure you want to unfavourite this program?
ar: هل أنت متأكد من رغبتك في إلغاء ضم هذا البرنامج إلى قائمة البرامج المفضلة الخاصة بك؟
ca: Estàs segur que vols desmarcar aquest programa com a favorit?
es: ¿Estás seguro de que quieres eliminar este programa como favorito?
kab: D tidet tebɣiḍ ur tesmenyafayed ara ahil-a?
nl: Weet je zeker dat je dit programma 'niet favoriet' wilt maken?
sr: Да ли сте сигурни да желите да уклоните овај програм из фаворита?
ta: இந்த திட்டத்தை நீங்கள் தவிர்க்க விரும்புகிறீர்களா?
uk: Ви впевнені, що хочете видалити цю програму з улюблених?
zh_hans: 您确定要取消收藏该程序吗？

# unfavourite_success
source: Your program is unfavourited.
ar: تم إلغاء برنامجك من قائمة برامجك المفضلة.
ca: El teu programa s'ha desmarcat com a favorit.
es: Su programa no es favorito.
kab: Ahil-ik mačči d asmenyaf.
nl: Je programma is niet populair.
pl: Przestałeś lubić ten program.
sr: Ваш програм је уклоњен из фаворита.
ta: உங்கள் நிரல் முதலமிக்கப்படவில்லை.
uk: Ваша програма не є улюбленою.
zh_hans: 您的节目已经取消收藏.

# unknown_variable_role
source: unknown
ar: غير معلوم
ca: desconegut
es: desconocido
kab: arussin
pl: nieznany
sr: непознато
ta: தெரியவில்லை
uk: невідомий
zh_hans: 未知

# unlock_thresholds
source: Unlock level thresholds
ca: Desbloqueja els llindars de nivell
de: Schalte Level.Grenzen frei
fr: Déverrouiller les limites de niveau
id: Buka kunci ambang batas level
ko: 잠금 해제 레벨 임계값
nl: Ongrendel level scores
pl: Wymagania do odblokowania następnego poziomu
sr: Откључај праг нивоа
tr: Seviye eşiklerinin kilidini aç
uk: Розблокувати пороги рівня
zh_hans: 解锁级别阈值

# unsaved_class_changes
source: There are unsaved changes, are you sure you want to leave this page?
ar: توجد تغييرات غير محفوظة، هل أنت متأكد أنك تريد مغادرة هذه الصفحة؟
ca: Hi ha canvis no guardats, segur que voleu sortir d'aquesta pàgina?
de: Es gibt ungespeicherte Änderungen, bist du dir sicher, dass du diese Seite verlassen möchtest?
es: Hay cambios sin guardar, ¿estás seguro de que quieres abandonar esta página?
fr: Il y a des changements non pris en comptes, es-tu sur de vouloir quitter la page ?
id: Ada perubahan yang belum disimpan, yakin ingin meninggalkan halaman ini?
ko: 저장하지 않은 변경사항이 있습니다. 이 페이지를 떠나시겠습니까?
nl: Er zijn wijzigingen nog niet opgeslagen, weet je zeker dat je terug wilt gaan?
pl: Strona zawiera niezapisane zmiany. Czy jesteś pewien, że chcesz wyjść bez zapisania zmian?
sr: Постоје несачуване промене, да ли сте сигурни да желите да напустите ову страницу?
ta: சேமிக்கப்படாத மாற்றங்கள் உள்ளன, இந்தப் பக்கத்தை விட்டு வெளியேற விரும்புகிறீர்களா?
tr: Kaydedilmemiş değişiklikler var, bu sayfadan ayrılmak istediğinize emin misiniz?
uk: Є незбережені зміни. Ви впевнені, що бажаєте залишити цю сторінку?
zh_hans: 有未保存的更改，您确定要离开此页面吗？

source: Unsubmit program
ar: ألغِ تقديم البرنامج
ca: Desfés l'enviament del programa
es: Dar de baja el programa
kab: Ahil ur yettwaznen ara
nl: Terugtrekken programma
pl: Nie przesyłaj programu
sr: Поништи подношење програма
ta: அகப்பெட்டி திட்டம்
uk: Скасувати надсилання програми
zh_hans: 不提交程序

# unsubmit_warning
source: Are you sure you want to unsubmit this program?
ar: هل أنت متأكد أنك تريد إلغاء تقديم هذا البرنامج؟
ca: Estàs segur que vols desfer la tramesa d'aquest programa?
es: ¿Está seguro de que desea cancelar el envío de este programa?
kab: D tidet tebɣiḍ ad tesfesxeḍ tuzna-a?
nl: Weet je zeker dat je dit programma wilt intrekken?
pl: Czy na pewno chcesz zrezygnować z przesyłania z tego programu?
sr: Да ли сте сигурни да желите да поништите подношење овог програма?
ta: இந்த திட்டத்தை நீங்கள் ஆதரிக்க விரும்புகிறீர்களா?
uk: Ви впевнені, що бажаєте скасувати цю програму?
zh_hans: 您确定要取消提交此计划吗？

source: Unsubmitted
ar: تم إلغاء تقديم البرنامج
ca: No enviat
es: No enviado
nl: Niet ingediend
pl: Nieprzesłane
sr: Поништено подношење
ta: கட்டமைக்கப்படாதது
uk: Не надіслано
zh_hans: 取消提交

# unsubscribed_header
source: You have been unsubscribed
ar: تم حذف إشتراكك
es: Te has dado de baja
nl: Je bent uitgeschreven
ta: நீங்கள் குழுவிலகப்பட்டீர்கள்
uk: Ви скасували підписку

# unsubscribed_message
source: Sad to see you go. If you unsubscribed by accident you can resubscribe by filling out <a href="http://eepurl.com/hk77Mv">this form</a>.
ar: يحزننا ذهابك. إذا حذفت اشتراكك بالخطأ، فيمكنك إعادة الاشتراك بإعادة ملء هذه الاستمارة: <a href="http://eepurl.com/hk77Mv">this form</a>.
es: Nos entristece verte marchar. Si te has dado de baja por accidente, puedes volver a suscribirte rellenando <a href="http://eepurl.com/hk77Mv"> el siguiente formulario </a>.
nl: Jammer dat je de nieuwsbrief niet meer ontvangt! Per ongeluk uitgeschreven? Geen stress, je kunt je gewoon weer aanmelden via <a href="http://eepurl.com/hk77Mv">dit formulier</a>.
ta: நீங்கள் செல்வதைக் கண்டு வருத்தமாக இருக்கிறது. தற்செயலாக நீங்கள் குழுவிலகப்பட்டால், <a href = "http://eepurl.com/hk77mv"> இந்த படிவம் </a> ஐ நிரப்புவதன் மூலம் மறுபரிசீலனை செய்யலாம்.
uk: Сумно бачити, що ти йдеш. Якщо ви випадково скасували підписку, ви можете повторно підписатися, заповнивши <a href="http://eepurl.com/hk77Mv">цю форму</a>.
