Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# mail_welcome_teacher_body
source: <strong>Welcome!</strong> Congratulations on your brand new Hedy teacher's account. Welcome to the world wide community of Hedy teachers! <strong>What teacher's accounts can do</strong> There are a number of extra options unlocked for you now. 1. Extra explanation is available in the <a href="https://hedy.org/for-teachers/manual">teacher's manual</a>. 2. With your teacher account, you can create classes. Your students can than join your classes and you can see their progress. Classes are made and managed though the for <a href="https://hedycode.com/for-teachers">teachers page</a>. 3. You can fully customize your classes, for example you can open and close levels, enable or disable adventures and author your own adventures! <strong>Join our online community!</strong> All Hedy teachers, programmers and other fans are welcome to join our <a href="https://discord.gg/8yY7dEme9r">Discord server</a>. This is the ideal place to chat about Hedy: we have channels where you can show your cool projects and lessons, channels to report bugs, and channels to chat with other teachers and with the Hedy team. <strong>How to ask for help </strong> If anything is unclear, you can let us know on Discord, or <a href="mailto: hello@hedy.org">send us an email</a>. <strong>How to report bugs</strong> In Discord, we have a channel for reporting bugs, called #bugs. That is the perfect place to let us know about issues you are running into. If you know how to use GitHub, you can create an <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">issue</a> there.
ar: <strong>مرحبًا!</strong> تهانينا على حساب المعلم الجديد الخاص بك من هيدي. مرحبًا بك في المجتمع العالمي لمعلمي هيدي! <strong> ما يمكن لحساب المعلم فعله </strong> باستخدام حساب المعلم الخاص بك ، لديك خيار إنشاء الصفوف الدراسية. يمكن لتلاميذك الانضمام إلى صفوفك ويمكنك رؤية تقدمهم. يتم إنشاء الصفوف وإدارتها من خلال <a href="https://hedycode.com/for-teachers">صفحةالمعلم</a>. <strong> كيفية مشاركة الأفكار </strong> إذا كنت تستخدم هيدي في الصف ، فمن المحتمل أن يكون لديك أفكار للتحسين! يمكنك مشاركة هذه الأفكار معنا في <a href="https://github.com/hedyorg/hedy/discussions/categories/ideas"> مناقشة الأفكار </a>. <strong> كيف تطلب المساعدة </strong> إذا كان هناك أي شيء غير واضح ، فيمكنك النشر في <a href="https://github.com/hedyorg/hedy/discussions/categories/q-a"> مناقشة الأسئلة والأجوبة </a> أو <a href = "mailto:hello@hedy.org "> أرسل إلينا بريدًا إلكترونيًا </a>. استمر في البرمجة!
ca: <strong>Benvingut/da!</strong> Enhorabona pel teu nou compte de professorat d'Hedy. Benvingut a la comunitat mundial de professors Hedy! <strong>Què poden fer els comptes del professor</strong> Hi ha una sèrie d'opcions addicionals desbloquejades per a tu ara. 1. Hi ha una explicació addicional disponible al <a href="https://hedy.org/for-teachers/manual">manual del professor</a>. 2. Amb el teu compte de professorat, pots crear classes. Els vostres estudiants poden unir-se a les vostres classes i podreu veure el seu progrés. Les classes es fan i es gestionen mitjançant la <a href="https://hedycode.com/for-teachers">pàgina per a professorat</a>. 3. Pots personalitzar completament les teves classes, per exemple pots obrir i tancar nivells, activar o desactivar aventures i crear les teves pròpies aventures! <strong>Uneix-te a la nostra comunitat en línia!</strong> Tots els professors, programadors i altres fans d'Hedy poden unir-se al nostre <a href="https://discord.gg/8yY7dEme9r">servidor de Discord</a>. Aquest és el lloc ideal per xerrar sobre Hedy: tenim canals on mostrar els teus projectes i lliçons interessants, canals per informar d'errors i canals per xerrar amb altres professors i amb l'equip d'Hedy. <strong>Com demanar ajuda </strong> Si alguna cosa no està clara, pots fer-nos-ho saber a Discord o <a href="mailto: hello@hedy.org">enviar-nos un correu electrònic</a>. <strong>Com informar d'errors</strong> A Discord, tenim un canal per informar d'errors, anomenat #bugs. Aquest és el lloc perfecte per informar-nos dels problemes amb què us trobeu. Si sabeu com utilitzar GitHub, podeu crear un <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">problema </a> allà.
de: <strong>Welcome!</strong> Glückwunsch zu Ihrem neuen Hedy Lehrer-Konto. Willkommen in der Community von Hedy-Lehrenden aus aller Welt! <strong>Wofür Lehrer-Konten gut sind</strong> Sie haben nun einige Optionen zur Verfügung. 1. Weiterführende Erklärungen finden Sie in der <a href="https://hedy.org/for-teachers/manual">Anleitung für Lehrende</a>. 2. Mit Ihrem Lehrer-Konto können Sie Klassen erstellen. Ihre Schülerinnen in Schüler können Ihren Klassen beitreten und ihren Lernfortschritt sehen. Klassen werden erstellt und verwaltet über die <a href="https://hedycode.com/for-teachers">Seite für Lehrende</a>. 3. Sie können Ihre Klassen vollständig personalisieren. Beispielsweise können sie Levels öffnen oder schließen, Abenteuer verfügbar machen oder deaktivieren und ihre eigenen Abenteuer erstellen! <strong>Treten Sie unserer Online-Community bei!</strong> Alle Hedy Lehrer, Programmierer und andere Fans sind eingeladen, unserem <a href="https://discord.gg/8yY7dEme9r">Discord-Server</a> beizutreten. Dies ist der perfekte Ort, um sich über Hedy auszutauschen: es gibt Kanäle, in denen Sie coole Projekte und Unterrichtsmaterialien präsentieren können, es gibt Kanäle für Fehlerberichte and Kanäle, um mit anderen Hedy-Lehrer und dem Hedy-Team zu chatten. <strong>Wie Sie Hilfe erhalten</strong> Sollten Sie etwas unklar finden, können Sie uns auf Discord kontaktieren, oder uns eine <a href="mailto: hello@hedy.org">Email senden</a>. <strong>Wie Sie Bugs/Fehler melden</strong> Auf Discord haben wir einen eigenen Kanal für Fehlermeldungen/ Bugs, genannt #bugs. Dieser ist der perfekte Ort, um uns über Fehler und technische Probleme zu informieren, auf die Sie gestoßen sind. Falls Sie GitHub nutzen, können Sie dort eine <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">Issue</a> erstellen.
es: <strong>¡Bienvenido/a!</strong> Felicidades por tu nueva cuenta de profesor Hedy. ¡Bienvenido a la comunidad mundial de profesores de Hedy! <strong>Qué pueden hacer las cuentas de profesor</strong> Ahora tienes disponibles una serie de opciones adicionales. 1. En el <a href="https://hedy.org/for-teachers/manual">manual del profesor</a> encontrarás explicaciones adicionales. 2. Con tu cuenta de profesor, puedes crear clases. Tus alumnos pueden unirse a tus clases y puedes ver su progreso. Las clases se crean y se gestionan a través de la página <a href="https://hedycode.com/for-teachers">para profesores</a>. 3. ¡Puedes personalizar completamente tus clases, por ejemplo, puedes abrir y cerrar niveles, habilitar o deshabilitar aventuras y crear tus propias aventuras! <strong>¡Únete a nuestra comunidad en línea!</strong> Todos los profesores de Hedy, programadores y demás fans están invitados a unirse a nuestro <a href="https://discord.gg/8yY7dEme9r">servidor de Discord</a>. Este es el lugar perfecto para charlar sobre Hedy: tenemos canales donde puedes mostrar tus proyectos y lecciones interesantes, canales para reportar errores y canales para chatear con otros profesores y con el equipo de Hedy. <strong>Cómo solicitar ayuda</strong> Si tienes dudas, puedes hacérnoslas saber en Discord o <a href="mailto: hello@hedy.org">enviarnos un correo electrónico</a>. <strong>Cómo reportar errores</strong> En Discord, tenemos un canal para reportar errores, llamado #bugs. Ese es el lugar perfecto para hacernos saber sobre problemas con los que te encuentres. Si sabes cómo usar GitHub, también puedes crear un <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">problema</a> allí.
fr: <strong>Bienvenue !</strong> Félicitation pour ton tout nouveau compte enseignant Hedy. Bienvenue dans la communauté mondiale des enseignants Hedy ! <strong>Ce que l'on peut faire avec un compte enseignants</strong> Il y a de nombreuses options qui s'offrent à toi. 1. Des explications supplémentaires sont disponible dans <a href="https ://hedy.org/for-teachers/manual">le manuel de l'enseignant</a>. 2. Avec ton compte enseignant, tu peux créer une classe. Tes élèves peuvent se joindre à ta classe et tu peux voir leurs progrès. Les classes sont créées et gérées depuis la <a href="https ://hedycode.com/for-teachers">page d'enseignant (for-teachers)</a>. 3. Tu peux personnaliser totalement tes classes, par exemple, tu peux ouvrir et fermer des niveaux, activer ou désactiver des aventures et créer ta propre aventure ! <strong>Rejoins notre communauté en ligne !</strong> Tous les enseignants Hedy, programmeurs et autres fans sont les bienvenues sur notre <a href="https ://discord.gg/8yY7dEme9r">server Discord</a>. C'est l'endroit idéal pour parler de Hedy : nous avons des channels où tu peux montrer tes projets cool et tes lessons, des channel pour remonter les bugs, et des channels de chat avec d'autres enseignant et des membres de l'équipe Hedy. <strong>Comment demander de l'aide</strong> Si quelque chose n'est pas clair, tu peux nous le faire savoir sur discord ou <a href="mailto : hello@hedy.org">nous envoyer un email</a>. <strong>Comment remonter les bugs</strong> Dans Discord, on a un channel pour remonter les bugs, il s'appelle #bugs. C'est l'endroit parfait pour nous informer sur les problèmes que tu rencontres. Si tu sais utiliser GitHub, tu peux créer une <a href="https ://github.com/hedyorg/hedy/issues/new ?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">issue</a> là-bas.
id: <strong>Selamat datang!</strong> Selamat atas akun guru Hedy yang baru. Selamat datang di komunitas guru Hedy di seluruh dunia! <strong>Apa yang dapat dilakukan akun guru</strong> Ada sejumlah opsi tambahan yang terbuka untuk Anda sekarang. 1. Penjelasan tambahan tersedia di <a href="https://hedy.org/for-teachers/manual">teacher's manual</a>. 2. Dengan akun guru Anda, Anda dapat membuat kelas. Siswa Anda dapat bergabung dengan kelas Anda dan Anda dapat melihat kemajuan mereka. Kelas dibuat dan dikelola melalui <a href="https://hedycode.com/for-teachers">teacher's page</a>. 3. Anda dapat sepenuhnya menyesuaikan kelas Anda, misalnya Anda dapat membuka dan menutup level, mengaktifkan atau menonaktifkan petualangan, dan menulis petualangan Anda sendiri! <strong>Bergabunglah dengan komunitas online kami!</strong> Semua guru Hedy, pemrogram, dan penggemar lainnya dipersilakan untuk bergabung dengan <a href="https://discord.gg/8yY7dEme9r">Discord server</a> kami. Ini adalah tempat yang ideal untuk mengobrol tentang Hedy: kami memiliki saluran tempat Anda dapat menunjukkan proyek dan pelajaran keren Anda, saluran untuk melaporkan bug, dan saluran untuk mengobrol dengan guru lain dan tim Hedy. <strong>Cara meminta bantuan </strong> Jika ada yang kurang jelas, Anda dapat memberi tahu kami di Discord, atau <a href="mailto: hello@hedy.org">kirim email kepada kami</a>. <strong>Cara melaporkan bug</strong> Di Discord, kami memiliki saluran untuk melaporkan bug, yang disebut #bugs. Itu adalah tempat yang tepat untuk memberi tahu kami tentang masalah yang Anda hadapi. Jika Anda tahu cara menggunakan GitHub, Anda dapat membuat <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">issue</a> di sana.
ko: <strong>어서오세요!/strong> 당신의 새로운 Hedy 선생님의 계정을 축하드립니다. 전세계 Hedy 선생님들의 커뮤니티에 오신 것을 환영합니다! <강한>선생님의 회계가 할 수 있는 일 </강한> 지금은 잠금 해제된 여러 가지 옵션이 있습니다. 1. 자세한 설명은 <a href="https://hedy.org/for-teachers/manual ">선생님용 설명서에서 확인할 수 있다. 2. 당신의 선생님 계정으로 당신은 수업을 만들 수 있다. 당신의 학생들은 당신의 수업에 참여하는 것보다 더 많은 것을 할 수 있고, 당신은 그들의 진행 상황을 볼 수 있다. 수업은 <a href="https://hedycode.com/for-teachers ">의 페이지를 통해 만들어지고 관리된다. 3. 수업를 완전히 사용자 정의할 수 있습니다. 예를 들어 레벨을 열고 닫고, 모험을 활성화 또는 비활성화하고, 자신의 모험을 작성할 수 있습니다! <strong>온라인 커뮤니티에 가입하세요!/strong> 모든 Hedy 선생님들, 프로그래머들 그리고 다른 팬들은 저희 <a href="https://discord.gg/8yY7dEme9r ">Discord 서버에 가입하신 것을 환영합니다. 이곳은 여러분의 멋진 프로젝트와 교훈을 보여줄 수 있는 채널, 버그를 보고할 수 있는 채널, 그리고 다른 선생님들이나 Hedy 팀과 이야기할 수 있는 채널이 있습니다. <strong>도움을 요청하는 방법 </strong> 불분명한 사항이 있으면 디스코드로 알려주거나 <a href="mail to: hello@hedy.org ">로 이메일을 보내주세요. <strong>버그 신고 방법 </strong> 디스코드에는 버그 보고 채널인 #discord가 있다. 그곳은 당신이 직면하고 있는 문제들에 대해 우리에게 알려주기에 완벽한 장소이다. 당신이 깃허브를 사용하는 방법을 안다면, 당신은 거기서 <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D "> 이슈를 만들 수 있다.
nl: <strong>Welkom!</strong> Gefeliciteerd met jouw splinternieuwe Hedy lerarenaccount. Welkom bij de wereldwijde community van Hedy leraren! <strong>Wat lerarenaccounts kunnen doen</strong> Met een lerarenaccount kun je klassen aanmaken. Leerlingen kunnen aan deze klas deelnemen en je kunt hun voortgang bekijken. Klassen worden gemaakt en beheerd via de <a href=https://hedycode.com/for-teachers>voor leraren</a> pagina. <strong>Hoe ideeën te delen</strong> Als je Hedy gebruikt in jouw klas, dan heb je vast wat ideeën wat er beter kan! Je kunt deze ideeën met ons delen via de <a href=https://github.com/hedyorg/hedy/discussions/categories/ideas>Ideas Discussion</a>. <strong>Kom bij de online Hedy community!</strong> Alle Hedy leraren, programmeurs en andere fans zijn welkom op onze [Discord server](https://discord.gg/8yY7dEme9r). Dit is de ideale plek om over Hedy te kletsen: er zijn kanalen om jouw projecten en lessen te laten zien, kanalen om bugs te melden en om met andere leraren en het Hedy team te praten. <strong>Hoe krijg ik hulp</strong> Als iets niet helemaal duidelijk is kun je dit posten in de <a href=https://github.com/hedyorg/hedy/discussions/categories/q-a>Q&A discussion</a>, of <a href=mailto: hello@hedy.org>stuur ons een mail</a>. Blijf programmeren!
pl: <strong>Witaj!</strong> Gratulujemy założenia nowego konta nauczyciela Hedy. Witamy w światowej społeczności nauczycieli Hedy! <strong>Co mogą robić nauczyciele</strong> Konto nauczyciela daje nowe możliwości. 1. Dodatkowe wyjaśnienia są dostępne w <a href="https://hedy.org/for-teachers/manual">poradniku nauczyciela</a>. 2. Za pomocą konta nauczyciela masz możliwość tworzenia zajęć. Twoi uczniowie mogą dołączyć do twoich zajęć, a ty możesz zobaczyć ich postępy. Zajęcia są prowadzone i zarządzane przez <a href="https://hedycode.com/for-teachers">stronę nauczyciela</a>. 3. Masz możliwość pełnego dostosowania swoich zajęć - możesz odblokowywać i zablokowywać poziomy, włączać i wyłączać przygody oraz tworzyć własne przygody! <strong>Dołącz do naszej społeczności online!</strong> Zapraszamy wszystkich nauczycieli, programistów i innych fanów Hedy do dołączenia do naszego <a href="https://discord.gg/8yY7dEme9r">serwera Discord</a>. To idealne miejsce do rozmowy o Hedy: mamy kanały, na których możesz pokazać swoje fajne projekty i lekcje, kanały do zgłaszania błędów oraz kanały do czatowania z innymi nauczycielami i zespołem Hedy. <strong>Jak pytać o pomoc </strong> Jeśli coś jest niejasne, daj nam znać na DIscord, lub <a href="mailto: hello@hedy.org">wyślij nam maila</a>. <strong>Jak zgłaszać błędy</strong> W Discordzie mamy kanał do zgłaszania błędów o nazwie #bugs. To idealne miejsce, aby poinformować nas o problemach, z którymi się spotykasz. Jeśli wiesz, jak korzystać z GitHub, możesz tam otworzyć <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">issue</a>.
sr: <strong>Добродошли!</strong> Честитамо на вашем новом Hedy налогу за наставнике. Добродошли у светску заједницу Hedy наставника! <strong>Шта могу налози за наставнике</strong> Сада вам је откључано неколико додатних опција. 1. Додатно објашњење је доступно у <a href="https://hedy.org/for-teachers/manual">приручнику за наставнике</a>. 2. Са вашим налогом за наставнике, можете креирати одељења. Ваши ученици могу тада да се придруже вашим одељењима и ви можете видети њихов напредак. Одељења се праве и управљају преко <a href="https://hedycode.com/for-teachers">странице за наставнике</a>. 3. Можете у потпуности прилагодити своја одељења, на пример можете отварати и затварати нивое, омогућавати или онемогућавати авантуре и креирати своје авантуре! <strong>Придружите се нашој онлајн заједници!</strong> Сви Hedy наставници, програмери и други обожаваоци су добродошли да се придруже нашем <a href="https://discord.gg/8yY7dEme9r">Discord серверу</a>. Ово је идеално место за ћаскање о Hedy: имамо канале где можете показати своје кул пројекте и лекције, канале за пријаву грешака и канале за ћаскање са другим наставницима и са Hedy тимом. <strong>Како тражити помоћ</strong> Ако вам нешто није јасно, можете нас обавестити на Discord-у, или <a href="mailto: hello@hedy.org">нам послати имејл</a>. <strong>Како пријавити грешке</strong> На Discord-у имамо канал за пријаву грешака, назван #bugs. То је савршено место да нас обавестите о проблемима на које наилазите. Ако знате како да користите GitHub, можете тамо креирати <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">проблем</a>.
ta: <strong> வரவேற்கிறோம்! </strong> உங்கள் புத்தம் புதிய எடி ஆசிரியரின் கணக்கில் வாழ்த்துக்கள். எடி ஆசிரியர்களின் உலகளாவிய சமூகத்திற்கு வருக! <strong> ஆசிரியரின் கணக்குகள் என்ன செய்ய முடியும் </strong> உங்களுக்காக இப்போது பல கூடுதல் விருப்பங்கள் திறக்கப்பட்டுள்ளன. 1. கூடுதல் விளக்கம் <a href = "https://hedy.org/for-teachers/manual"> ஆசிரியரின் கையேடு </a> இல் கிடைக்கிறது. 2. உங்கள் ஆசிரியர் கணக்குடன், நீங்கள் வகுப்புகளை உருவாக்கலாம். உங்கள் வகுப்புகளில் சேருவதை விட உங்கள் மாணவர்கள் முடியும், மேலும் அவர்களின் முன்னேற்றத்தை நீங்கள் காணலாம். <A href = "https://hedycode.com/for-teachers"> ஆசிரியர்கள் பக்கம் </a> க்காக வகுப்புகள் தயாரிக்கப்பட்டு நிர்வகிக்கப்படுகின்றன. 3. உங்கள் வகுப்புகளை நீங்கள் முழுமையாகத் தனிப்பயனாக்கலாம், எடுத்துக்காட்டாக நீங்கள் நிலைகளைத் திறந்து மூடலாம், சாகசங்களை இயக்கலாம் அல்லது முடக்கலாம் மற்றும் உங்கள் சொந்த சாகசங்களை எழுதலாம்! <strong> எங்கள் நிகழ்நிலை சமூகத்தில் சேரவும்! </strong> அனைத்து எடி ஆசிரியர்கள், புரோகிராமர்கள் மற்றும் பிற ரசிகர்கள் எங்கள் <a href = "https://discord.gg/8yy7deme9r"> முரண்பாடு சேவையகம் </a> இல் சேர வரவேற்கப்படுகிறார்கள். எடியைப் பற்றி அரட்டையடிக்க இது சிறந்த இடம்: எங்களிடம் சேனல்கள் உள்ளன, அங்கு உங்கள் அருமையான திட்டங்கள் மற்றும் பாடங்கள், பிழைகள் புகாரளிக்க சேனல்கள் மற்றும் மற்ற ஆசிரியர்களுடன் அரட்டையடிக்க சேனல்கள் மற்றும் எடி குழுவுடன் அரட்டை அடிக்கலாம். <strong> உதவி கேட்பது எப்படி </strong> ஏதேனும் தெளிவாகத் தெரியவில்லை என்றால், நீங்கள் டிச்கார்ட்டில் எங்களுக்குத் தெரியப்படுத்தலாம், அல்லது <a href = "mailto: hello@hedy.org"> எங்களுக்கு ஒரு மின்னஞ்சல் அனுப்புங்கள் </a>. <strong> பிழைகள் எவ்வாறு புகாரளிப்பது </strong> டிச்கார்ட்டில், #பக்ச் எனப்படும் பிழைகள் புகாரளிப்பதற்கான ஒரு சேனல் எங்களிடம் உள்ளது. நீங்கள் இயங்கும் சிக்கல்களைப் பற்றி எங்களுக்குத் தெரியப்படுத்த இது சரியான இடம். கிட்அப்பை எவ்வாறு பயன்படுத்துவது என்பது உங்களுக்குத் தெரிந்தால், நீங்கள் ஒரு <a href = "https://github.com/hediorg/hedy/issues/new?
tr: <strong>Hoş geldiniz!</strong> Yepyeni Hedy öğretmen hesabınız için tebrikler. Hedy öğretmenlerinin dünya çapındaki topluluğuna hoş geldiniz! <strong>Öğretmen hesapları neler yapabilir</strong> Artık sizin için açılmış bir dizi ek seçenek var. 1. Ek açıklamalar <a href="https://hedy.org/for-teachers/manual">öğretmen kılavuzu</a> 'da bulunabilir. 2. Öğretmen hesabınızla sınıflar oluşturabilirsiniz. Öğrencileriniz daha sonra sınıflarınıza katılabilir ve ilerlemelerini görebilirsiniz. Sınıflar, öğretmen hesabı üzerinden yapılır ve <a href="https://hedycode.com/for-teachers">öğretmen sayfası</a> 'ndan yönetilir.. 3. Sınıflarınızı tamamen özelleştirebilirsiniz, örneğin seviyeleri açıp kapatabilir, maceraları etkinleştirebilir veya devre dışı bırakabilir ve kendi maceralarınızı yazabilirsiniz! <strong>Çevrimiçi topluluğumuza katılın!</strong> Tüm Hedy öğretmenleri, programcıları ve diğer hayranları <a href="https://discord.gg/8yY7dEme9r">Discord sunucumuza</a> katılmaya davetlidir. Burası Hedy hakkında sohbet etmek için ideal bir yer: harika projelerinizi ve derslerinizi gösterebileceğiniz kanallarımız, hataları bildirebileceğiniz kanallarımız ve diğer öğretmenlerle ve Hedy ekibiyle sohbet edebileceğiniz kanallarımız var. <strong>Nasıl yardım istenir </strong> Anlaşılmayan bir şey varsa, Discord'da bize bildirebilir veya <a href="mailto: hello@hedy.org">bize bir e-posta gönderebilirsiniz</a>. <strong>Hatalar nasıl bildirilir</strong> Discord'da, hataları bildirmek için #bugs adında bir kanalımız var. Karşılaştığınız sorunları bize bildirmek için mükemmel bir yer. GitHub'ı nasıl kullanacağınızı biliyorsanız, orada bir <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">sorun bildirimi (issue)</a> açabilirsiniz.
uk: <strong>Ласкаво просимо!</strong> Вітаємо з новим обліковим записом вчителя Hedy. Ласкаво просимо до всесвітньої спільноти вчителів Hedy! <strong>Що можуть зробити облікові записи вчителя</strong> Зараз для вас розблоковано кілька додаткових опцій. 1. Додаткове пояснення є в <a href="https://hedy.org/for-teachers/manual">посібнику для вчителя</a> . 2. За допомогою облікового запису вчителя ви можете створювати класи. Ваші студенти можуть приєднатися до ваших занять, і ви можете бачити їхній прогрес. Класи створюються та керуються через <a href="https://hedycode.com/for-teachers">сторінку для викладачів</a> . 3. Ви можете повністю налаштувати свої класи, наприклад, ви можете відкривати та закривати рівні, вмикати та вимикати пригоди та створювати власні пригоди! <strong>Приєднуйтесь до нашої онлайн-спільноти!</strong> Запрошуємо всіх викладачів Hedy, програмістів та інших шанувальників приєднатися до нашого <a href="https://discord.gg/8yY7dEme9r">сервера Discord</a> . Це ідеальне місце для спілкування про Hedy: у нас є канали, де ви можете показати свої класні проекти та уроки, канали для повідомлення про помилки та канали для спілкування з іншими вчителями та командою Hedy. <strong>Як звернутися за допомогою</strong> Якщо щось незрозуміло, ви можете повідомити нам про це на Discord або <a href="mailto: hello@hedy.org">надіслати нам електронний лист</a> . <strong>Як повідомляти про помилки</strong> У Discord у нас є канал для повідомлення про помилки під назвою #bugs. Це ідеальне місце, щоб повідомити нам про проблеми, з якими ви стикаєтеся. Якщо ви знаєте, як користуватися GitHub, ви можете створити <a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">проблему</a> там.
zh_hans: <strong>欢迎！</strong>。 恭喜您拥有全新的Hedy教师账户。欢迎来到世界范围内的Hedy教师社区! <strong>教师账户可以做什么？ 现在为你解锁许多额外的选项。 1.额外的解释可在<a href="https://hedy.org/for-teachers/manual">teacher's manual</a>中找到。 2.您可以通过您的教师帐户创建您的班级。您的学生将能加入您的班级，您也可以看到他们的进度。班级是通过<a href="https://hedycode.com/for-teachers">teachers page</a>创建和管理的。 3.您可以完全自定义您的班级，例如，您可以打开和关闭不同级别，启用或禁用冒险活动，以及编写您自己的冒险活动！ <strong>加入我们的在线社区！</strong> 欢迎所有Hedy老师、程序员和其他爱好者加入我们的社区<a href="https://discord.gg/8yY7dEme9r">Discord server</a>。这是谈论Hedy的理想场所：我们有一些频道，你可以展示你很酷的项目和课程，有一些频道可以报告错误，还有一些频道可以与其他教师和Hedy团队聊天。 <strong>如何求助</strong>？ 如果有什么不清楚的地方，你可以在Discord上告诉我们，或者在这里给我们发邮件<a href="mailto: hello@hedy.org">send us an email</a>。 <strong>如何报告错误</strong> 在 Discord 中，我们有一个报告错误的频道，叫做 #bugs。这是让我们了解您所遇到的问题的最佳场所。如果您知道如何使用GitHub，您可以在那里创建一个<a href="https://github.com/hedyorg/hedy/issues/new?assignees=&labels=&template=bug_report.md&title=%5BBUG%5D">issue</a>。
