Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# adventures_info
source: Each Hedy level has built-in exercises for students, which we call adventures. You can create your own adventures and add them to your classes. With your own adventures you can create adventures that are relevant and interesting for your students. You can find more information about creating your own adventures <a href="https://hedy.org/for-teachers/manual/features">here</a>.
ar: يحتوي كل مستوى من مستويات هيدي على تمارين مدمجة للطلاب، نسميها "مغامرات". يمكنك إنشاء مغامراتك الخاصة وإضافتها إلى دروسك. من خلال مغامراتك الخاصة، يمكنك ابتكار مغامرات شيقة ومناسبة لطلابك. يمكنك العثور على مزيد من المعلومات حول إنشاء مغامراتك الخاصة <a href="https://hedy.org/for-teachers/manual/features">here</a>.
ca: Cada nivell d'Hedy té exercicis integrats per als estudiants, que anomenem aventures. Pots crear les teves pròpies aventures i afegir-les a les teves classes. Amb les teves pròpies aventures, pots crear aventures que siguin rellevants i interessants per als teus estudiants. Pots trobar més informació sobre la creació de les teves pròpies aventures <a href="https://hedy.org/for-teachers/manual/features"> aquí </a>.
es: Cada nivel de Hedy tiene ejercicios incorporados para los alumnos, los cuales llamamos aventuras. Puedes crear tus propias aventuras y añadirlas a tus clases. Con tus propias aventuras puedes crear aventuras que sean importantes e interesantes para tus alumnos. Puedes encontrar más información sobre cómo crear tus propias aventuras <a href="https://hedy.org/for-teachers/manual/features">aquí</a>.
nl: Elk Hedy level heeft ingebouwde oefeningen voor leerlingen, wat wij avonturen noemen. Jij kan ook jouw eigen avonturen maken en toevoegen aan je klassen. Met jouw eigen avonturen kan je lessen maken die relevant en interessant zijn voor jouw leerlingen. Meer informatie over het maken van eigen avonturen: <a href="https://hedy.org/for-teachers/manual/features#make-your-own-adventure">klik hier</a>.
pl: Każdy poziom Hedy ma wbudowane ćwiczenia dla uczniów, które nazywamy przygodami. Możesz tworzyć własne przygody i dodawać je do swoich zajęć. Dzięki własnym przygodom możesz tworzyć przygody, które są odpowiednie i interesujące dla twoich uczniów. Możesz znaleźć więcej informacji na temat tworzenia własnych przygód <a href="https://hedy.org/for-teachers/manual/features"> tutaj </a>.
sr: Сваки Hedy ниво има уграђене вежбе за ученике, које називамо авантурама. Можете креирати своје авантуре и додати их у своја одељења. Са својим авантурама можете креирати авантуре које су релевантне и занимљиве за ваше ученике. Више информација о креирању својих авантура можете пронаћи <a href="https://hedy.org/for-teachers/manual/features">овде</a>.
ta: ஒவ்வொரு எடி மட்டத்திலும் மாணவர்களுக்கான உள்ளமைக்கப்பட்ட பயிற்சிகள் உள்ளன, அவற்றை நாங்கள் சாகசங்கள் என்று அழைக்கிறோம். நீங்கள் உங்கள் சொந்த சாகசங்களை உருவாக்கி அவற்றை உங்கள் வகுப்புகளில் சேர்க்கலாம். உங்கள் சொந்த சாகசங்கள் மூலம் உங்கள் மாணவர்களுக்கு பொருத்தமான மற்றும் சுவையான சாகசங்களை உருவாக்கலாம். உங்கள் சொந்த சாகசங்களை உருவாக்குவது பற்றிய கூடுதல் தகவல்களை நீங்கள் காணலாம் <a href = "https://hedy.org/for-teachers/manual/features"> இங்கே </a>.
tr: Her Hedy seviyesi, öğrenciler için macera olarak adlandırdığımız yerleşik alıştırmalara sahiptir. Kendi maceralarınızı oluşturabilir ve bunları sınıflarınıza ekleyebilirsiniz. Kendi maceralarınızla öğrencileriniz için alakalı ve ilginç maceralar oluşturabilirsiniz. Kendi maceralarınızı oluşturma hakkında daha fazla bilgiyi <a href="https://hedy.org/for-teachers/manual/features"> bu linkten </a> bulabilirsiniz.
uk: Кожен рівень Hedy має вбудовані вправи для учнів, які ми називаємо пригодами. Ви можете створювати власні пригоди та додавати їх до своїх класів. За допомогою власних пригод ви можете створювати пригоди, які будуть актуальними та цікавими для ваших учнів. Ви можете знайти більше інформації про створення власних пригод <a href="https://hedy.org/for-teachers/manual/features">тут</a> .
zh_hans: 每个 海蒂 级别都为学生提供内置练习，我们称之为冒险。 您可以创建自己的冒险并将其添加到您的课程中。 通过您自己的冒险，您可以创造与您的学生相关且有趣的冒险。 您可以在<a href="https://hedy.org/for-teachers/manual/features">此处</a>找到有关创建自己的冒险的更多信息。

# adventures_restored
source: The default adventures have been restored.
ar: أُرجعت المغامرات الأصلية.
ca: Les aventures per defecte han estat restaurades.
de: Die Standardabenteuer wurden wiederhergestellt.
es: Se han restaurado las aventuras por defecto.
fr: Les aventures par défaut ont été rétablies.
id: Petualangan default telah dipulihkan.
kab: Tidyanin timezwer tettwarr-d.
ko: 기본 모험이 복구되었습니다.
nl: De standaardavonturen zijn terug gezet.
pl: Domyślne przygody zostały przywrócone.
sr: Подразумеване авантуре су враћене.
ta: இயல்புநிலை சாகசங்கள் மீட்டமைக்கப்பட்டுள்ளன.
tr: Varsayılan maceralar geri yüklendi.
uk: Стандартні пригоди відновлено.
zh_hans: 默认的冒险已经恢复。

source: Adventures ticked
ar: المغامرات المُختارة
ca: Tiquet d'aventura
es: Aventuras marcadas
nl: Avonturen afgevinkt
pl: Odznaczone przygody
sr: Означене авантуре
ta: சாகசங்கள் தேர்வு செய்யப்பட்டன
tr: Maceralar işaretlendi
uk: Пригоди відзначилися
zh_hans: 冒险已完成

source: Adventures tried
ar: المغامرات المُحاولة
ca: Aventures intentades
es: Aventuras intentadas
nl: Avonturen geprobeerd
pl: Wypróbowane przygody
sr: Покушане авантуре
ta: சாகசங்கள் முயற்சித்தன
tr: Maceralar denendi
uk: Пригоди пробували
zh_hans: 尝试冒险

# ago
source: {timestamp} ago
ar: منذ {timestamp} ساعة
ca: fa {timestamp}
de: vor {timestamp}
es: Hace {timestamp}
id: {timestamp} yang lalu
kab: {timestamp} aya
ko: {timestamp} 전에
nl: {timestamp} geleden
pl: {timestamp} temu
sr: пре {timestamp}
ta: {timestamp} முன்பு
tr: {timestamp} önce
uk: {timestamp} тому
zh_hans: {timestamp} 前

# agree_invalid
source: You have to agree with the privacy terms.
ar: يجب أن توافق على شروط الخصوصية.
ca: Has d'acceptar els termes de privacitat.
de: Du musst den Privatsphäre-Bedingungen zustimmen.
es: Debes aceptar los términos de privacidad.
fr: Tu dois accepter la politique de confidentialité.
id: Anda harus menyetujui persyaratan privasi.
kab: Ilaq ad tqebleḍ tiwtilin n tbaḍnit.
ko: 당신은 개인 정보 보호 조항에 동의해야 합니다.
nl: Je moet akkoord gaan met de privacyverklaring.
pl: Musisz zgodzić się z zasadami polityki prywatności.
sr: Морате се сложити са условима приватности.
ta: தனியுரிமை விதிமுறைகளுடன் நீங்கள் உடன்பட வேண்டும்.
tr: Gizlilik koşullarını kabul etmeniz gerekir.
uk: Ви повинні погодитися з умовами конфіденційності.
zh_hans: 你必须同意隐私条款。

# agree_with
source: I agree to the
ar: أوافق على
ca: Accepto les
de: Ich stimme zu
eo: Mi konsentas al la
es: Acepto las
fr: J’accepte les
id: Saya setuju dengan
kab: Qebleɣ
ko: 나는 동의합니다
nl: Ik ga akkoord met de
pl: Zgadzam się na
sr: Слажем се са
ta: நான் ஒப்புக்கொள்கிறேன்
tr: Kabul ediyorum:
uk: Я погоджуюся з умовами
zh_hans: 我同意

# ajax_error
source: There was an error, please try again.
ar: لقد حدث خطأ ما، يرجى المحاولة مرة أخرى.
ca: Hi ha hagut un error, si us plau torna-ho a intentar.
cs: Nastala chyba, prosím zkus to znova.
de: Ein Fehler ist aufgetreten. Bitte nochmal versuchen.
eo: Okazis eraro; bonvolu reprovi.
es: Hubo un error, por favor intenta nuevamente.
fr: Il y a eu une erreur, veuillez réessayer.
fy: Der gong wat mis, besykje it nochris.
hi: एक त्रुटि थी, कृपया पुनः प्रयास करें।
id: Ditemukan sebuah error. Silakan coba lagi.
kab: Tella-d tuccḍa, ttxil-k ɛreḍ tikkelt niḍen.
ko: 오류가 발생했습니다. 다시 시도하십시오.
nl: Er is een fout opgetreden, probeer het nog eens.
pl: Wystąpił błąd, proszę spróbować ponownie.
sr: Дошло је до грешке, молимо покушајте поново.
sw: Kulikuwa na hitilafu, tafadhali jaribu tena.
ta: பிழை இருந்தது, தயவுசெய்து மீண்டும் முயற்சிக்கவும்.
tr: Bir hata oluştu, lütfen tekrar deneyin.
uk: Виникла помилка, будь ласка, спробуйте ще раз.
zh_hans: 出现了一个错误，请重试。

source: All
ar: الجميع
ca: Tot
de: Alle
es: Todo/as
fr: Tout
id: Semua
kab: Akk
ko: 전체
nl: Allemaal
pl: Wszystkie
sr: Сви
ta: அனைத்தும்
tr: Tümü
uk: Всі
zh_hans: 全部

# all_rows_missing_separator
source: None of the rows contain a semicolon. Perhaps you want to let us auto generate passwords? If so, click the passwords toggle and create the accounts again. If this is not the case, use a semicolon to separate usernames and passwords on the following lines: {rows}
ar: لا تحتوي أي من صفوف الجدول الأفقية على فاصلة منقوطة. لعلك ترغب في السماح لنا بإنشاء كلمات المرور تلقائيًا؟ إذا كان الأمر كذلك، فاضغط على زر تبديل كلمات المرور وأعد إنشاء الحسابات. إذا لم يكن الأمر كذلك، فاستخدم فاصلة منقوطة للفصل بين أسماء المستخدمين وكلمات المرور في الأسطر التالية: {rows}
ca: Cap de les files conté un punt i coma. Potser vols que generem automàticament les contrasenyes? Si és així, clica el botó de contrasenyes i crea els comptes de nou. Si no és així, utilitza un punt i coma per separar els noms d'usuari i les contrasenyes en les línies següents: {rows}
es: Ninguna de las filas contiene un punto y coma. ¿Tal vez usted quiere que nosotros auto generar contraseñas? Si es así, haga clic en las contraseñas de conmutación y crear las cuentas de nuevo. Si no es así, use un punto y coma para separar los nombres de usuario y las contraseñas en las siguientes líneas: {rows}
nl: Geen van de rijen bevat een puntkomma. Misschien wil je dat wij automatisch wachtwoorden genereren? Klik dan op de wachtwoorden-schakelaar en maak de accounts opnieuw aan. Als dit niet het geval is, gebruik dan een puntkomma om gebruikersnamen en wachtwoorden te scheiden op de volgende regels: {rows}
sr: Нити један ред не садржи тачку зарез. Можда желите да нам дозволите да аутоматски генеришемо лозинке? Ако је тако, кликните на прекидач за лозинке и креирајте налоге поново. Ако то није случај, употребите тачку зарез да одвојите корисничка имена и лозинке на следећим линијама: {rows}
ta: வரிசைகளில் எதுவும் அரைக்காற்புள்ளியைக் கொண்டிருக்கவில்லை. கடவுச்சொற்களை தானாக உருவாக்க அனுமதிக்க விரும்புகிறீர்களா? அப்படியானால், கடவுச்சொற்கள் மாறுவதைக் சொடுக்கு செய்து கணக்குகளை மீண்டும் உருவாக்கவும். இது அவ்வாறு இல்லையென்றால், பயனர்பெயர்கள் மற்றும் கடவுச்சொற்களை பின்வரும் வரிகளில் பிரிக்க அரைக்காற்புள்ளியைப் பயன்படுத்தவும்: {rows}
tr: Satırların hiçbiri noktalı virgül içermiyor. Belki de şifreleri otomatik olarak oluşturmamıza izin vermek istiyorsunuzdur? Eğer öyleyse, parolalar geçiş düğmesine tıklayın ve hesapları tekrar oluşturun. Durum böyle değilse, şu satırlarda kullanıcı adlarını ve parolalarını ayırmak için noktalı virgül kullanın: `{rows}`
uk: Жоден із рядків не містить крапки з комою. Можливо, ви хочете дозволити нам автоматично генерувати паролі? Якщо так, натисніть перемикач паролів і створіть облікові записи знову. Якщо це не так, використовуйте крапку з комою, щоб розділити імена користувачів і паролі в таких рядках: {rows}
zh_hans: 所有行均不包含分号。也许您想让我们自动生成密码？如果是这样，请单击密码切换按钮并重新创建帐户。如果不是这种情况，请在以下行中使用分号分隔用户名和密码：{rows}

# already_account
source: Already have an account?
ar: هل لديك حساب بالفعل؟
bg: Вече имаш акаунт?
ca: Ja tens un compte?
cs: Už máš svůj účet?
de: Hast du schon ein Konto?
eo: Ĉu vi jam havas konton?
es: ¿Ya tienes una cuenta?
fr: Vous avez déjà un compte ?
fy: Hast al in akkount?
hi: पहले से ही एक खाता है?
id: Sudah memiliki akun?
kab: Tesɛiḍ yakan amaɣnu?
ko: 계정이 이미 있으신가요?
nl: Heb je al een account?
pl: Posiadasz już konto?
sr: Већ имате налог?
sw: Tayari una akaunti?
ta: ஏற்கனவே ஒரு கணக்கு இருக்கிறதா?
tr: Zaten bir hesabınız var mı?
uk: Вже маєте обліковий запис?
zh_hans: 是否已经有账户?

# already_program_running
source: There is already a program running, finish that one first.
ar: هناك بالفعل برنامج اخر تحت التنفيذ، قم بانهاء ذلك البرنامج أولاً.
ca: Ja hi ha un programa en execució, finalitza'l primer.
de: Es läuft bereits ein Programm, beende es zunächst.
es: Ya hay un programa en ejecución. Finalízalo antes.
fr: Il y a déjà un programme en cours, finissez d'abord celui-ci.
id: Sudah ada program yang sedang berjalan, selesaikan dulu program tersebut.
kab: La yettwaselkam yakan wahil, fakk qbel wagi.
ko: 이미 실행 중인 프로그램이 있습니다. 먼저 프로그램을 끝내십시오.
nl: Er is al een programma bezig, maak die eerst af.
pl: Jakiś program właśnie się wykonuje, zakończ go, zanim uruchomisz kolejny.
sr: Већ постоји програм који ради, завршите тај прво.
ta: ஏற்கனவே ஒரு நிரல் இயங்குகிறது, முதலில் அதை முடிக்கவும்.
tr: Şu anda çalışan bir program var, önce onu bitirin.
uk: Програма вже запущена, завершіть її спочатку.
zh_hans: 已经正在运行着一个程序，请先完成那个程序。

# are_you_sure
source: Are you sure? You cannot revert this action.
ar: هل أنت متأكد؟ لا يمكنك التراجع عن هذا الإجراء.
bg: Внимание! Това действие е необратимо.
ca: Estàs segur? No pots desfer aquesta acció.
cs: Opravdu to chceš udělat? Tato akce je nevratná.
de: Bist du sicher? Du kannst diese Aktion nicht rückgängig machen.
es: ¿Estás segura/o? No puedes revertir esta acción.
fr: Êtes-vous sûr ? Vous ne pouvez pas annuler cette action.
fy: Bisto wis? Kinst dit net mear weromdraaie.
hi: क्या आपको यकीन है? आप इस क्रिया को लौटा नहीं सकते|
id: Apakah kamu yakin? Kamu tidak dapat membatalkan aksi ini.
kab: D tidet tebɣiḍ? Ur tezmireḍ ara ad tesfesxeḍ tigawt-a.
ko: 확실하신가요? 이 작업은 뒤로 되돌릴 수 없습니다.
nl: Weet je het zeker? Je kunt dit niet meer ongedaan maken.
pl: Czy jesteś pewien? Ta operacja jest nieodwracalna.
sr: Да ли сте сигурни? Не можете поништити ову акцију.
sw: Una uhakika? Huwezi kurudisha kitendo hiki.
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா? இந்த செயலை நீங்கள் மாற்ற முடியாது.
tr: Emin misiniz? Bu işlemi geri alamazsınız.
uk: Ви впевнені? Ви не можете відкликати цю операцію.
zh_hans: 你确定吗？ 你无法撤销此操作。

# ask_needs_var
source: Starting in level 2, `{ask}` needs to be used with a variable. Example: name `{is}` `{ask}` What is your name?
ar: ابتداء من المستوى الثاني، نستخدم الأمر `{ask} مع متغير. مثال: الاسم '{is}' '{ask}' ما اسمك؟
ca: A partir del nivell 2, cal utilitzar `{ask}` amb una variable. Exemple: nom `{is}` `{ask}` Com et dius?
de: Ab Level 2 muss `{ask}` mit einer Variable benutzt werden. Beispiel: Name `{is}` `{ask}` Wie heißt du?
es: A partir del nivel 2, `{ask}` debe utilizarse con una variable. Ejemplo: nombre `{is}` `{ask}` ¿Cómo te llamas?
fr: À partir du niveau 2, `{ask}` doit être utilisé avec une variable. Exemple : nom `{is}` `{ask}` Quel est ton nom ?
id: Mulai level 2, `{ask}` perlu digunakan dengan variabel. Contoh: nama `{is}` `{ask}` Siapa namamu?
kab: Seg uswir wis 2, {ask} yesra ad yettwaseqdac akked umutti. Amedya: isem`{is}` `{ask}`Isem-ik?
ko: 레벨 2부터 {ask}을(를) 변수와 함께 사용해야 합니다. 예: 이름 {is} {ask} 무엇이라고 부르십니까?
nl: Vanaf level 2 hoort `{ask}` met een variabele ervoor. Bijv: naam `{is}` `{ask}` Hoe heet jij?
pl: Od poziomu 2, `{ask}` musi być użyty razem ze zmienną. Przykład: imię `{is}` `{ask}` Jak się nazywasz?
sr: Почевши од нивоа 2, `{ask}` мора бити коришћен са променљивом. Пример: име `{is}` `{ask}` Како се зовеш?
ta: நிலை 2 இல் தொடங்கி, `{ask}` ஒரு மாறியுடன் பயன்படுத்தப்பட வேண்டும். எடுத்துக்காட்டு: பெயர் `{is}` `{ask}` உங்கள் பெயர் என்ன?
tr: Seviye 2'den itibaren, "`{ask}`" komutu bir değişkenle birlikte kullanılmalıdır. Örnek: isim `{is}` `{ask}` Senin adın ne?
uk: Починаючи з рівня 2, `{ask}` потрібно використовувати із перемінною. Приклад: name `{is}` `{ask}` Як тебе звати?
zh_hans: 从第2关开始，`{ask}`需要和变量共同使用。例子：名字`{is}` `{ask}`你叫什么？

source: Available in:
ar: سيكون متاحا في:
ca: Disponible a:
es: Disponible en:
kab: Yella deg:
nl: Beschikbaar in:
pl: Dostępne w:
sr: Доступно у:
ta: இதில் கிடைக்கிறது:
tr: Şurada mevcut:
uk: Доступний у:
zh_hans: 适用于：

# back_to_class
source: Go back to class
ar: الرجوع إلى الصف
ca: Torna a la classe
de: Gehe zurück zur Klasse
eo: Reen al klaso
es: Volver a la clase
hi: कक्षा में वापस जाएं
kab: Ûɣal ɣer usmil
ko: 수업으로 돌아가기
nl: Ga terug naar klas
pl: Powróć do klasy
sr: Вратите се на час
ta: மீண்டும் வகுப்புக்குச் செல்லுங்கள்
tr: Sınıfına geri dön
uk: Поверніться до класу
zh_hans: 回到课室

source: Become a sponsor
ar: صر راعيا وداعما
ca: Fes-te patrocinador
de: Werde ein Sponsor
es: Conviértete en patrocinador
fr: Devenir un sponsor
id: Menjadi sponsor
kab: Uɣal d amendad
ko: 후원하기
nl: Word sponsor
pl: Zostań sponsorem
sr: Постаните спонзор
ta: ஒரு ச்பான்சராகுங்கள்
tr: Sponsor olun
uk: Стати спонсором
zh_hans: 成为赞助商

source: Birth year
ar: سنة الميلاد
bg: Година на раждане
ca: Any de naixement
cs: Rok narození
de: Geburtjahr
eo: Naskiĝjaro
es: Año de nacimiento
fr: Année de naissance
fy: Bertejier
hi: जन्म वर्ष
id: Tahun lahir
kab: Aseggas n tlalit
ko: 출생년도
nl: Geboortejaar
pl: Rok urodzenia
sr: Година рођења
sw: Mwaka wa kuzaliwa
ta: பிறந்த ஆண்டு
tr: Doğum yılı
uk: Рік народження
zh_hans: 出生年份

source: by
ar: عند
bg: от
ca: per
cs: od
de: von
eo: far
es: por
fr: par
fy: troch
hi: से
id: dengan
kab: sɣur
nl: door
pl: przez
sr: од
tr: tarafından
uk: за
zh_hans: 经由

source: Cancel
ar: الغاء
ca: Cancel·lar
de: Abbrechen
eo: Nuligi
es: Cancelar
fr: Annuler
fy: Ofbrekke
hi: रद्द करें
id: Batal
kab: Sefsex
ko: 취소
nl: Afbreken
pl: Anuluj
sr: Откажи
ta: ரத்துசெய்
tr: İptal
uk: Скасувати
zh_hans: 取消

# cant_parse_exception
source: Couldn't parse the program
ar: تعذر تحليل البرنامج
ca: No s'ha pogut analitzar el programa
de: Das Programm konnte nicht analysiert werden
es: No se ha podido analizar el programa
id: Tidak dapat menguraikan program
kab: D awezɣi asekyed n wahil
ko: 프로그램을 구문 분석할 수 없습니다
nl: We konden het programma niet lezen
pl: Nie można przeanalizować programu
sr: Није могуће парсирати програм
ta: Couldn't பாகுபடுத்தல் the திட்டம்
tr: Program ayrıştırılamadı
uk: Не вдалося проаналізувати програму
zh_hans: 无法解析程序

# certificate
source: Certificate of Completion
ca: Certificat de finalització
de: Abschlusszertifikat
fr: Certificat de complétion
id: Sertifikat Penyelesaian
ko: 수료증
nl: Certificaat van voltooiing
pl: Certyfikat ukończenia
sr: Сертификат о завршетку
tr: Tamamlama Sertifikası
uk: Свідоцтво про проходження курсу
zh_hans: 竣工证书

source: Certified teacher
ar: معلم مُعتمد
ca: Professor certificat
de: Zertifizierte Lehrperson
es: Profesor certificado
fr: Enseignant certifié
id: Guru bersertifikat
kab: Aselmad yewwi aselkin
ko: 수료된 선생님
nl: Gecertificeerde leraar
pl: Certyfikowany nauczyciel
sr: Сертификовани наставник
tr: Sertifikalı Öğretmen
uk: Сертифікований викладач
zh_hans: 认证教师

source: Change password
ar: غيِّر كلمة المرور
bg: Смяна на паролата
ca: Canvia la contrasenya
cs: Změnit heslo
de: Ändere Passwort
eo: Ŝanĝi pasvorton
es: Cambiar contraseña
fr: Modifier le mot de passe
fy: Feroarje wachtwurd
hi: सांकेतिक शब्द बदलें
id: Ubah password
kab: Snifel awal n uɛeddi
ko: 비밀번호 변경하기
nl: Verander wachtwoord
pl: Zmień hasło
sr: Промени лозинку
sw: Badilisha nenosiri
tr: Şifre değiştirme
uk: Змінити пароль
zh_hans: 更改密码

# cheatsheet_title
source: Cheatsheet
ar: ورقة غش
ca: Xuleta
de: Spickzettel
eo: Resumo
es: Hoja de instrucciones
fr: Aide-mémoire
id: Contekan
kab: Tifert n tkatut
nl: Spiekbriefje
pl: Ściągawka
sr: Варалица
tr: Kopyakağıdı
uk: Шпаргалка
zh_hans: 小抄

# class_already_joined
source: You are already a student of class
ar: أنت أصلا تلميذ في الصف
ca: Ja ets alumne de la classe
de: Du bist schon in dieser Klasse
eo: Vi jam estas lernanto en klaso
es: Ya eres parte de la clase
fr: Tu es déjà un élève de la classe
fy: Dochst al mei oan de klas
hi: आप पहले से ही कक्षा के छात्र हैं
id: Kamu sudah terdaftar sebelumnya di kelas ini
kab: Telliḍ yakan d anelmad n usmil
ko: 당신은 이미 수업에 참가한 학생입니다
nl: Je zit al in deze klas
pl: Już jesteś uczeniem tej klasy
sr: Већ сте ученик разреда
ta: You அரே already a student of வகுப்பு
tr: Siz zaten bir sınıfın öğrencisisiniz
uk: Ви вже є учнем класу
zh_hans: 你已经是班级的学生了

# class_customize_success
source: Class successfully customized.
ar: تم تعديل الصف حسب رغبتك بنجاح.
ca: Classe personalitzada amb èxit.
de: Klasse erfolgreich angepasst.
es: Clase configurada correctamente.
fr: Classe modifiée avec succès.
hi: कक्षा को सफलतापूर्वक अनुकूलित किया गया।
id: Kelas berhasil disesuaikan.
kab: Asmil yettwasenfel akken iwata.
ko: 수업이 커스터마이징 되었습니다.
nl: Klas succesvol gepersonaliseerd.
pl: Personalizacje zostaly zapisane pomyślnie.
sr: Одељење успешно прилагођено.
ta: வகுப்பு successfully customized.
tr: Sınıf başarıyla özelleştirildi.
uk: Клас успішно налаштовано.
zh_hans: 成功自定义课程。

# class_graph_explanation
source: In this graph you can see represented the numbers of adventures your students have attempted (meaning they have done meaningful work in that adventure), with respect to the number of errors and successful runs.
ar: في هذا الرسم البياني يمكنك أن ترى عدد المغامرات التي حاول طلابك خوضها (أي أنهم قاموا بعمل جدير في تلك المغامرة)، وأيضا عدد المغامرات بالنسبة إلى عدد الأخطاء والمحاولات الناجحة.
ca: En aquest gràfic pots veure representats els nombres d'aventures que els teus estudiants han intentat (és a dir, que han fet feina significativa en aquesta aventura), en relació amb el nombre d'errors i execucions reeixides.
es: En este gráfico puede ver representado el número de aventuras que sus alumnos han intentado (lo que significa que han realizado un trabajo significativo en esa aventura), con respecto al número de errores y de ejecuciones con éxito.
sr: На овом графикону можете видети број авантура које су ваши ученици покушали (што значи да су радили значајан посао у тој авантури), у односу на број грешака и успешних извршења.
ta: In this graph you can see represented the numbers of adventures your students have attempted (meaning they have முடிந்தது meaningful வேலை in that adventure), with respect பெறுநர் the எண் of errors and successful runs.
tr: Bu grafikte, öğrencilerinizin denedikleri maceraların sayılarını (yani o macerada anlamlı bir çalışma yaptıklarını), hatalı deneme ve başarılı çalıştırma sayılarıyla karşılaştırmalı olarak sunulmuş görebilirsiniz.
uk: На цьому графіку ви можете побачити кількість пригод, у яких спробували ваші учні (це означає, що вони виконали значущу роботу в цій пригоді), по відношенню до кількості помилок і успішних запусків.
zh_hans: 在这张图表中，你可以看到学生尝试过的冒险次数（意味着他们在那次冒险中做了有意义的工作），以及错误次数和成功次数。

# class_logs
source: Last Login
ar: اخر تسجيل دخول
ca: Últim accés
de: Aufzeichnungen
eo: Protokoloj
es: Última conexión
fy: Lêst ynlogd
hi: आखरी लॉगइन
kab: Tuqqna taneggarut
ko: 로그
nl: Laaste Login
pl: Ostatnie logowanie
sr: Последња пријава
ta: Last புகுபதிவு
tr: Son Giriş
uk: Логи
zh_hans: 日志

# class_name_duplicate
source: You already have a class with this name.
ar: لديك أصلا صف بهذا الاسم.
ca: Ja teniu una classe amb aquest nom.
de: Du hast bereits eine Klasse mit diesem Namen.
es: Ya tienes una clase con este nombre.
fr: Une classe porte déjà ce nom.
hi: आपके पास पहले से ही इस नाम की एक कक्षा है!
id: Anda sudah memiliki kelas dengan nama ini.
kab: ɣur-k yakan asmil s yisem-a.
ko: 이미 이 이름의 수업가 있습니다.
nl: Je hebt al een klas met deze naam.
pl: Już masz klasę z taką nazwą.
sr: Већ имате одељење са овим именом.
ta: இந்த பெயருடன் உங்களிடம் ஏற்கனவே ஒரு வகுப்பு உள்ளது.
tr: Bu isimde bir sınıfınız zaten var.
uk: У вас вже є клас з такою назвою.
zh_hans: 您已经有一个同名的班级了。

# class_name_empty
source: You didn't enter a class name!
ar: لم تُدخل اسم الصف!
ca: No has introduït el nom de la classe!
de: Du hast keinen Namen für die Klasse eingegeben!
eo: Vi ne tajpis nomon de klaso!
es: ¡No has introducido un nombre de clase!
fr: Tu n'as pas entré de nom de classe !
hi: आपने कक्षा का नाम नहीं डाला!
id: Anda tidak memasukkan nama kelas!
kab: Ur teskecmeḍ isem n usmil!
ko: 학급 이름을 입력하지 않으셨군요!
nl: Je hebt geen klasnaam ingevuld!
pl: Nie wpisałeś nazwy klasy!
sr: Нисте унели име одељења!
ta: நீங்கள் ஒரு வகுப்பு பெயரை உள்ளிடவில்லை!
tr: Bir sınıf ismi girmediniz!
uk: Ви не ввели назву класу!
zh_hans: 你没有输入班级名称!
