Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# Unsupported String Value
source: We detected that text uses values it cannot contain `{invalid_value}`. Can you try removing the written value or change its type?
ar: لقد اكتشفنا أن النص الذي كتبته يحتوي على قيمة ممنوعة: '{invalid_value}'. هل بإمكانك حذف هذه القيمة، أو تغيير نوعها؟
ca: Hem detectat que el text fa servir valors que no pot contenir ` {invalid_value}`. Pots provar d'eliminar el valor que has escrit o canviar el seu tipus?
es: Hemos detectado que el texto utiliza valores que no puede contener `{invalid_value}`. ¿Puede intentar eliminar el valor escrito o cambiar su tipo?
fr: Les valeurs textes ne peuvent pas contenir `{invalid_value}`.
id: Nilai teks tidak boleh berisi `{invalid_value}`.
ko: 텍스트 값에는 {invalid_value}이(가) 포함될 수 없습니다.
pl: Wykryliśmy, że tekst używa wartości, których nie może zawierać `{invalid_value}`. Czy możesz spróbować usunąć zapisaną wartość lub zmienić jej typ?
sr: Открили смо да текст користи вредности које не може садржати `{invalid_value}`. Можете ли покушати да уклоните написану вредност или промените њен тип?
ta: உரை மதிப்புகளைப் பயன்படுத்துகிறது என்பதைக் கண்டறிந்தோம், அதில் `{invalid_value}`. எழுதப்பட்ட மதிப்பை அகற்ற முயற்சிக்கலாமா அல்லது அதன் வகையை மாற்றலாமா?
tr: Metnin, içinde bulunmaması gerek değerler, "`{invalid_value}`", kullandığını tespit ettik. Yazılan değeri kaldırmayı veya türünü değiştirmeyi deneyebilir misiniz?
uk: Ми виявили, що текст використовує значення, які не може містити `{invalid_value}`. Чи можете ви спробувати видалити записане значення або змінити його тип?
zh_hans: 我们检测到文本使用的值不能包含`{invalid_value}`。可以尝试删除写入的值或更改其类型吗？

# Unused Variable
source: We detected that variable {variable_name} defined on line {line_number}, but not used. Can you try using the defined variable or remove it?
ar: لقد اكتشفنا أن المتغير {variable_name} المُعرَّف في سطر {line_number} لم يُستخدم. هل بإمكانك استخدام المتغير المُعرَّف، أو إزالته؟
ca: Hem detectat que la variable {variable_name} està definida a la línia {line_number}, però no s'utilitza. Pots provar d'utilitzar la variable definida o treure-la?
es: Detectamos que la variable {variable_name} definida en la línea {line_number}, pero no se utiliza. ¿Puede intentar usar la variable definida o eliminarla?
pl: Wykryliśmy tę zmienną {variable_name} zdefiniowaną w wierszu {line_number} ,ale nieużywaną. Czy możesz spróbować użyć zdefiniowanej zmiennej lub ją usunąć?
sr: Открили смо да је променљива {variable_name} дефинисана на линији {line_number}, али није коришћена. Можете ли покушати да користите дефинисану променљиву или да је уклоните?
ta: {line_number} இல் வரையறுக்கப்பட்டுள்ள அந்த மாறி {variable_name} வரையறுக்கப்பட்டுள்ளது, ஆனால் பயன்படுத்தப்படவில்லை. வரையறுக்கப்பட்ட மாறியைப் பயன்படுத்த முயற்சிக்கலாமா அல்லது அதை அகற்றலாமா?
tr: "` {variable_name}`" isimli değişkeninin `{line_number}` numaralı satırda tanımlandığını ancak hiç kullanılmadığını tespit ettik. Bu tanımlı değişkeni kullanmayı veya kaldırmayı deneyebilir misiniz?
uk: Ми виявили, що змінна {variable_name} визначена в рядку {line_number}, але не використовується. Чи можете ви спробувати використати визначену змінну чи видалити її?
zh_hans: 我们检测到变量 {variable_name} 已在第 {line_number} 行定义，但未被使用。可以尝试使用已定义的变量或将其删除吗？

# Var Undefined
source: We detected that variable `{name}` is being used before being set. Can you set the variable before it is used or use quotation marks for `{name}`?
ar: بخصوص المتغير '{name}'، لقد اكتشفنا أنك استخدمته قبل أن تعرفه. هل بإمكانك تعريفه قبل استخدامه؟ أو إذا قصدت أن تستخدم {name} كنص، هل بإمكانك وضعه بين علامات الاقتباس؟
ca: Hem detectat que la variable `{name}` s'està utilitzant abans de ser definida. Pots definir la variable abans d'utilitzar-la o utilitzar cometes per a `{name}`?
es: Detectamos que la variable `{name}' se está utilizando antes de ser establecida. ¿Puede usted establecer la variable antes de que sea utilizada o usar comillas para `{name}`?
fr: Tu as essayé d’utiliser la variable `{name}`, mais tu ne l’as pas définie. Ou bien tu essayais d’utiliser le mot `{name}`, mais tu as oublié les guillemets.
id: Kamu mencoba untuk menampilkan variabel `{name}`, tapi kamu belum mengisinya dengan nilai. Ada kemungkinan bahwa kamu sedang mencoba untuk menampilkan kata `{name}` tapi melupakan tanda kutip.
ko: {name} 변수를 사용하려고 했지만 설정하지 않았습니다. {name} 단어를 사용하려고 했지만 따옴표를 잊어버렸을 수도 있습니다.
pl: Wykryliśmy, że zmienna `{name}` jest używana przed ustawieniem. Czy możesz ustawić zmienną przed jej użyciem lub użyć cudzysłowu dla `{name}`?
sr: Открили смо да се променљива `{name}` користи пре него што је постављена. Можете ли поставити променљиву пре него што се користи или користити наводнике за `{name}`?
ta: அமைக்கப்படுவதற்கு முன்பு `{name}` பயன்படுத்தப்படுவதை நாங்கள் கண்டறிந்தோம். மாறியைப் பயன்படுத்துவதற்கு முன்பு அதை அமைக்க முடியுமா அல்லது `{name}` என்பதற்கு மேற்கோள் குறிகளை பயன்படுத்த முடியுமா?
tr: "`{name}`" isimli değişkeninin henüz ayarlanmadan önce kullanıldığını tespit ettik. Bu değişkeni, kullanılmadan önce ayarlayabilir misiniz veya bu bir değişken değilse `{name}` kelimesini tırnak işaretleri içinde kullanabilir misiniz?
uk: Ми виявили, що змінна `{name}` використовується до встановлення. Чи можете ви встановити змінну перед її використанням або взяти лапки для `{name}`?
zh_hans: 我们检测到变量`{name}`在设置之前被使用。可以在使用之前设置变量，或者为“{name}”使用引号吗？

# Wrong Level
source: We detected that the written code is correct Hedy code, but `{offending_keyword}` is used on level {working_level}. {tip}
ar: {tip}: لقد اكتشفنا أنك أدخلت برنامج هيدي صحيح لكن هذه الكلمة: `{offending_keyword}` تُستخدم للمستوى {working_level}
ca: Això era codi Hedy correcte, però no pertany a aquest nivell. Has escrit `{offending_keyword}` que funcionaria al nivell {working_level}. Consell: {tip}
es: Detectamos que el código escrito es correcto Hedy code, pero `{offending_keyword}` se utiliza en nivel {working_level}. {tip}
fr: C'était un code Hedy correct, mais pas au bon niveau. Vous avez écrit `{offending_keyword}` pour le niveau {working_level}. Conseil : {tip}
id: Itu adalah kode Hedy yang benar, namun tidak pada level yang tepat. Kamu menulis kode `{offending_keyword}` untuk level {working_level}. Tip: {tip}
ko: 올바른 Hedy 코드이지만 올바른 레벨은 아닙니다. {working_level} 레벨에 대해 {offending_keyword}을(를) 작성했습니다. 팁: {tip}
pl: Wykryliśmy, że zapisany kod jest poprawny Kod Hedy, ale {offending_keyword} jest używane na poziomie {working_level}. {tip}
sr: Открили смо да је написани код исправан Hedy код, али `{offending_keyword}` се користи на нивоу {working_level}. {tip}
ta: எழுதப்பட்ட குறியீடு சரியான எடி குறியீடு என்பதை நாங்கள் கண்டறிந்தோம், ஆனால் `{offending_keyword}` {working_level} இல் பயன்படுத்தப்படுகிறது. {tip}
tr: Yazılan kodun doğru Hedy kodu olduğunu, ancak seviye `{working_level}` için kullanılmaması gereken "`{offending_keyword}`" kelimesinin kullanıldığını tespit ettik. {tip}
uk: Ми виявили, що написаний код є правильним кодом Hedy, але `{offending_keyword}` використовується на рівні {working_level}. {tip}
zh_hans: 这是正确的海蒂代码，但不是在正确的关卡。你在第{working_level}关用了`{offending_keyword}`。提示：{tip}

# Wrong Number of Arguments
source: We detected that function {name} has wrong number of arguments which is {used_number}. Can you try writing {defined_number} instead?
ar: لقد وجدنا أن الدالة باسم {name} لديها عدد مدخلات: {used_number} وهو عدد غير صحيح من المدخلات. هل بإمكانك بدلا من ذلك إدخال المدخلات بالعدد الصحيح: {defined_number}؟
ca: Hem detectat que la funció {name} té un nombre incorrecte d'arguments, que és {used_number}. Pots provar d'escriure {defined_number} en el seu lloc?
es: Detectamos que la función {name} tiene un número incorrecto de argumentos, que es {used_number}. ¿Puedes intentar escribir {defined_number} en su lugar?
pl: Wykryliśmy, że funkcja {name} ma błędną liczbę argumentów, która jest {used_number}. Czy możesz zamiast tego napisać {defined_number}?
sr: Открили смо да функција {name} има погрешан број аргумената који је {used_number}. Можете ли покушати да напишете {defined_number} уместо тога?
ta: {name} தவறான வாதங்களின் எண்ணிக்கையை நாங்கள் கண்டறிந்தோம், இது {used_number}. அதற்கு பதிலாக {defined_number} எழுத முயற்சிக்கலாமா?
tr: "`{name}`" fonksiyonunun yanlış sayıda argümana, `{used_number}`, sahip olduğunu tespit ettik. Bunun yerine `{defined_number}` tane kullanmayı deneyebilir misiniz?
uk: Ми виявили, що функція {name} має неправильну кількість аргументів: {used_number}. Чи можете ви замість цього спробувати написати {defined_number}?
zh_hans: 我们发现函数 {name} 的参数数量有误，为 {used_number}。可以尝试改写为 {defined_number} 吗？

source: About this adventure
ar: معلومات عن هذه الترجمة
ca: Sobre aquesta aventura
es: Sobre esta aventura
nl: Over dit avontuur
sr: О овој авантури
ta: இந்த சாகசத்தைப் பற்றி
tr: Bu macera hakkında
uk: Про цю пригоду

source: Account overview
ar: نظرة عامة على الحساب
ca: Visió general del compte
de: Kontoübersicht
eo: Superrigardo pri konto
es: Resumen de cuenta
fr: Aperçu du compte
hi: खाता निरीक्षण
id: Ikhtisar akun
kab: Taskant n umaɣnu
ko: 계정 개요
nl: Account overzicht
pl: Przegląd konta
sr: Преглед налога
ta: கணக்கு கண்ணோட்டம்
tr: Hesaba genel bakış
uk: Огляд облікового запису
zh_hans: 账户概览

source: Actions
ar: اجراءات
ca: Accions
es: Acciones
kab: Tigawin
pl: Akcje
sr: Акције
ta: செயல்கள்
tr: Eylemler
uk: Дії
zh_hans: 行动

source: Add
ar: أضف
ca: Afegeix
es: Añadir
id: Menambahkan
kab: Rnu
nl: Toevoegen
pl: Dodaj
sr: Додај
ta: கூட்டு
tr: Ekle
uk: додати
zh_hans: 以及

source: Add students
ar: أضف طلاب
ca: Afegeix estudiants
de: Schüler*innen hinzufügen
eo: Aldoni lernantojn
es: Añadir alumnos
fr: Ajouter des élèves
id: Tambahkan siswa-siswa
kab: Rnu inelmaden
ko: 학생 추가
nl: Leerlingen toevoegen
pl: Dodaj uczniów
sr: Додај ученике
ta: மாணவர்களைச் சேர்க்கவும்
tr: Öğrenci ekleyin
uk: Додати учня
zh_hans: 添加学生

source: Add your language!
ar: أضف لغتك!
ca: Afegeix la teva llengua!
es: ¡Agrega tu idioma!
kab: Rnu tutlayt-ik!
pl: Dodaj swój język!
sr: Додајте свој језик!
ta: உங்கள் மொழியைச் சேர்க்கவும்!
tr: Dilinizi ekleyin!
uk: Додайте свою мову!
zh_hans: 添加您的语言！

source: Admin
ar: إدارة الموقع
ca: Administrador
de: Administrator
es: Administrador
fr: Administration
kab: Anedbal
ko: 관리자
pl: Administrator
sr: Администратор
ta: நிர்வாகி
tr: Yönetici
uk: Адміністратор
zh_hans: 管理员

# advance_button
source: Go to level {level}
ca: Anar al nivell {level}
de: Gehe zu Level {level}
fr: Aller au niveau {level}
id: Lanjut ke level {level}
ko: 레벨 {level}(으)로 이동
nl: Ga naar level {level}
pl: Przejdź do poziomu {level}
sr: Иди на ниво {level}
tr: {level}. seviyeye git
uk: Перейдіть на рівень {level}
zh_hans: 去到等级 {level}

source: Adventure
ar: مغامرة
bg: Авантюра
ca: Aventura
cs: Dobrodružství
de: Abenteuer
eo: Aventuro
es: Aventura
fr: Aventure
fy: Aventoer
hi: साहसिक कार्य
id: Petualangan
kab: Tadyant
ko: 모험
nl: Avontuur
pl: Przygoda
sr: Авантура
ta: துணிவு
tr: Macera
uk: Пригода
zh_hans: 探险活动

# adventure_cloned
source: Adventure is cloned
ar: المغامرة قد نُسخت
ca: L'aventura s'ha clonat
es: La aventura es clonada
nl: Avontuur is gekopieerd
pl: Przygoda jest klonowana
sr: Авантуре су клониране
ta: துணிவு நகலி செய்யப்பட்டுள்ளது
tr: Macera klonlandı
uk: Пригоди клоновані
zh_hans: 冒险被克隆

# adventure_code_button
source: Adventure Code
ar: برنامج المغامرة
ca: Codi d'Aventura
es: Código de la aventura
kab: Tangalt n tedyant
pl: Kod przygody
sr: Код за авантуру
ta: சாகச குறியீடு
tr: Macera Kodu
uk: Код пригод
zh_hans: 代码冒险

# adventure_codeblock_button
source: Use this button when you want to create a block of code that students can run in your adventure. Tip: put the selection at the end of the last line of the code block and <kbd>Enter</kbd> 3 times to type after a code block.
ar: استخدم هذه الزر لكتابة مجموعة سطور البرمجة لاستخدام الطلاب في مغامرتك. ملاحظة: ضع هذه المجموعة في آخر سطر من سطور البرمجة و انقر 3 مرات لكي تستطيع الطباعة بعد مجموعة سطور البرمجة.
ca: Utilitza aquest botó quan vulguis crear un bloc de codi que els estudiants puguin executar en la teva aventura. Consell: posa la selecció al final de la darrera línia del bloc de codi i prem <kbd>Enter</kbd> 3 vegades per escriure després d'un bloc de codi.
es: Utilice este botón cuando desee crear un bloque de código que los alumnos puedan ejecutar en su aventura. Consejo: coloque la selección al final de la última línea del bloque de código e <kbd>introduzca</kbd> 3 veces para escribir después de un bloque de código.
nl: Gebruik deze knop als je een codeblok wil maken om in jouw avontuur te gebruiken. Tip: zet de selectie aan het einde van je laatste regel van het codeblok en druk 3 keer op <kbd>Enter</kbd> om na het codeblok tekst te typen.
pl: Użyj tego przycisku, gdy chcesz utworzyć blok kodu, który uczniowie mogą uruchomić w Twojej przygodzie. Wskazówka: umieść zaznaczenie na końcu ostatniego wiersza bloku kodu i <kbd> Enter </kbd> 3 razy, aby wpisać po bloku kodu.
sr: Користите ово дугме када желите да креирате блок кода који ученици могу покренути у вашој авантури. Савет: поставите избор на крај последње линије блока кода и <kbd>Enter</kbd> 3 пута да бисте куцали након блока кода.
ta: உங்கள் சாகசத்தில் மாணவர்கள் இயக்கக்கூடிய குறியீட்டின் தொகுதியை உருவாக்க விரும்பும்போது இந்தப் பொத்தானைப் பயன்படுத்தவும். உதவிக்குறிப்பு: குறியீடு தொகுதியின் கடைசி வரியின் முடிவில் தேர்வை வைக்கவும், ஒரு குறியீடு தொகுதிக்குப் பிறகு தட்டச்சு செய்ய 3 முறை <kbd>உள்ளிடவும்</kbd>.
tr: Öğrencilerin maceranızda çalıştırabileceği bir kod bloğu oluşturmak istediğinizde bu düğmeyi kullanın. İpucu: bir kod bloğundan sonra yazmak için, seçimi kod bloğunun son satırının sonuna getirin ve 3 kez <kbd>Enter</kbd> tuşuna basın.
uk: Використовуйте цю кнопку, якщо хочете створити блок коду, який студенти зможуть запускати у вашій пригоді. Порада: поставте виділення в кінці останнього рядка блоку коду та <kbd>введіть</kbd> 3 рази, щоб ввести після блоку коду.
zh_hans: 当您想要创建学生可以在冒险中运行的代码块时，请使用此按钮。提示：将所选内容放在代码块最后一行的末尾，<kbd>按3次</kbd>即可在代码块后键入内容。

# adventure_duplicate
source: You already have an adventure with this name.
ar: لديك بالفعل مغامرة بنفس هذا الإسم.
ca: Ja tens una aventura amb aquest nom.
de: Du hast bereits ein Abenteuer mit diesem Namen.
eo: Aventuro de tiu nomo jam ekzistas.
es: Ya tienes una aventura con este nombre.
fr: Tu as déjà une aventure avec ce nom.
hi: आपके पास पहले से ही इस नाम का एक adventure है
id: Anda sudah bertualang dengan nama ini.
ko: 당신은 이미 동일한 모험 이름을 사용하고 있습니다.
nl: Je hebt al een avontuur met deze naam.
pl: Posiadasz już przygodę o tej nazwie.
sr: Већ имате авантуру са овим именом.
ta: இந்த பெயருடன் உங்களுக்கு ஏற்கனவே ஒரு துணிவு உள்ளது.
tr: Bu isimle bir maceranız zaten var.
uk: У вас вже є пригода з такою назвою.
zh_hans: 您已经使用此名称进行了一次探险活动。

# adventure_empty
source: You didn't enter an adventure name!
ar: لم تدخل اسم المغامرة!
ca: No has introduït un nom d'aventura!
de: Du hast keinen Abenteuernamen eingegeben!
eo: Vi ne tajpis nomon de aventuro!
es: ¡No has introducido un nombre de aventura!
fr: Tu n'as pas entré de nom d'aventure !
hi: आपने एक adventure नाम दर्ज नहीं किया!
id: Anda tidak memasukkan nama petualangan!
ko: 모험 이름을 입력하지 않으셨군요!
nl: Je hebt geen naam voor je avontuur ingevuld!
pl: Nie podałeś nazwy przygody!
sr: Нисте унели име авантуре!
ta: நீங்கள் ஒரு சாகச பெயரை உள்ளிடவில்லை!
tr: Bir macera ismi girmediniz!
uk: Ви не ввели назву пригоди!
zh_hans: 你没有输入一个探险活动的名字！

# adventure_exp_classes
source: Your adventure is used within the following classes
ar: المغامرة هذه مُستخدمة في الصفوف التالية
ca: La teva aventura es fa servir en les classes següents
es: Tu aventura se utiliza dentro de las siguientes clases
kab: Tadyant-ik tettwaseqdac deg yismilen-a
pl: Twoja przygoda jest wykorzystywana w następujących klasach
sr: Ваша авантура се користи у следећим одељењима
ta: உங்கள் துணிவு பின்வரும் வகுப்புகளுக்குள் பயன்படுத்தப்படுகிறது
tr: Maceranız aşağıdaki sınıflarda kullanılır
uk: Ваша пригода використовується в наступних класах
zh_hans: 您的冒险将在以下类中使用

# adventure_flagged
source: The adventure was flagged successfully.
ar: تم وضع علامة على المغامرة بنجاح.
ca: L'aventura s'ha marcat amb èxit.
es: La aventura se ha marcado correctamente.
kab: Tadyant tettwaṛcem akken iwata.
nl: Jouw melding over dit avontuur is bij ons aangekomen.
pl: Przygoda została pomyślnie oznaczona.
sr: Авантура је успешно означена.
ta: துணிவு வெற்றிகரமாக கொடியிடப்பட்டது.
tr: Macera başarılı bir şekilde işaretlendi.
uk: Пригода була успішно позначена.
zh_hans: 此次冒险已被成功标记。

# adventure_id_invalid
source: This adventure id is invalid.
ar: رمز المغامرة هذا غير صالح.
ca: L'ID d'aventura no és vàlid.
de: Diese Abenteuer-ID ist ungültig.
eo: Jen nevalida identigilo de aventuro.
es: Esta aventura no es válida.
fr: Ce numéro d'aventure n'est pas valide.
hi: यह adventure आईडी अमान्य है
id: ID petualangan ini tidak valid.
kab: Asulay-a n tedyant d arameɣtu.
ko: 모험 ID가 잘못되었습니다.
nl: Dit avontuur id is ongeldig.
pl: Ten identyfikator przygody jest nieprawidłowy.
sr: Овај ID авантуре је неважећи.
ta: இந்த சாகச அடையாளம் தவறானது.
tr: Bu macera kimliği geçersiz.
uk: Цей ідентифікатор пригоди є недійсним.
zh_hans: 这个探险活动的账号是无效的。

# adventure_length
source: Your adventure has to be at least 20 characters.
ar: المغامرة يجب أن تحتوي على ٢٠ حرفاً على الأقل.
ca: L'aventura ha de contenir com a mínim 20 caràcters.
de: Dein Abenteuer muss mindestens 20 Zeichen haben.
eo: Via aventuro devas enhavi almenaŭ 20 skribsignojn.
es: Tu aventura debe tener al menos 20 carácteres.
fr: Ton aventure doit mesurer au moins 20 caractères.
hi: आपका adventure कम से कम 20 वर्णों का होना चाहिए
id: Petualangan Anda setidaknya harus terdiri dari 20 karakter.
kab: Tadyant-ik ilaq ad tegber ma drus 20 yisekkilen.
ko: 당신의 모험은 최소 20자 이상이어야 합니다.
nl: Jouw avontuur moet minimaal 20 karakters zijn.
pl: Treść twojej przygody musi składać się przynajmniej z 20 znaków.
sr: Ваша авантура мора имати најмање 20 карактера.
ta: உங்கள் துணிவு குறைந்தது 20 எழுத்துக்களாக இருக்க வேண்டும்.
tr: Maceranız en az 20 karakterden oluşmalıdır.
uk: У вашій пригоді має бути щонайменше 20 символів.
zh_hans: 你的探险活动必须至少有20个字符。

# adventure_name_invalid
source: This adventure name is invalid.
ar: اسم المغامرة غير صالح.
ca: El nom d'aventura no és vàlid.
de: Dieser Abenteuername ist ungültig.
eo: Jen nevalida nomo de aventuro.
es: El nombre de esta aventura no es válido.
fr: Le nom d'aventure n'est pas valide.
hi: यह adventure नाम अमान्य है
id: Petualangan Anda setidaknya harus terdiri dari 20 karakter.
kab: Isem n tedyant-a d arameɣtu.
ko: 모험 이름이 잘못되었습니다.
nl: Deze avontuurnaam is ongeldig.
pl: Ta nazwa przygody jest nieprawidłowa.
sr: Ово име авантуре је неважеће.
ta: இந்த சாகச பெயர் தவறானது.
tr: Bu macera ismi geçersiz.
uk: Ця назва пригоди є недійсною.
zh_hans: 这个探险活动的用户名是无效的。

# adventure_terms
source: I agree that my adventure might be made publicly available on Hedy.
ar: أوافق على أن مغامرتي قد تصير متاحة على العام على هيدي.
ca: Estic d'acord amb el fet que la meva aventura estigui disponible públicament a Hedy.
de: Ich stimme zu, dass mein Abenteuer mglw. auf Hedy veröffentlicht wird.
es: Confirmo que mi aventura puede hacerse pública en Hedy.
fr: J'accepte que mon aventure puisse être rendue disponible publiquement sur Hedy.
hi: मैं सहमत हूं कि मेरे रोमांच को हेडी पर सार्वजनिक रूप से उपलब्ध कराया जा सकता है।
id: Saya setuju bahwa petualangan saya dapat dipublikasikan di Hedy.
kab: Qebleɣ ad tili tedyant-iw d tazayazt ɣef Hedy.
ko: 나는 내 모험이 Hedy에서 공개되는 것에 동의합니다.
nl: Ik ga ermee akkoord dat mijn avontuur mogelijk beschikbaar komt op Hedy.
pl: Zgadzam się, że moja przygoda może być udostępniona publicznie na Hedy.
sr: Слажем се да моја авантура може бити јавно доступна на Hedy.
ta: எனது துணிவு எடியில் பகிரங்கமாக கிடைக்கக்கூடும் என்பதை நான் ஒப்புக்கொள்கிறேன்.
tr: Maceramın Hedy'de herkese açık hale getirilebileceğini kabul ediyorum.
uk: Я згоден з тим, що моя пригода може бути викладена у відкритому доступі на Hedy.
zh_hans: 我同意我的冒险可以在海蒂上公开。

# adventure_updated
source: The adventure has been updated!
ar: تم تحديث المغامرة!
ca: L'aventura s'ha actualitzat!
de: Das Abenteuer wurde geupdatet!
eo: La aventuro modifiĝis!
es: ¡La aventura ha sido actualizada!
fr: L'aventure à été mise à jour !
hi: adventure अद्यतन किया गया है!
id: Petualangan telah diperbarui!
kab: Tadyant tettwaleqqem!
ko: 모험이 업데이트 되었습니다!
nl: Jouw avontuur is bijgewerkt!
pl: Przygoda została zaktualizowana!
sr: Авантура је ажурирана!
ta: துணிவு புதுப்பிக்கப்பட்டது!
tr: Macera güncellendi!
uk: Пригоду оновлено!
zh_hans: 这个探险活动已被更新！

# adventures_completed
source: Adventures completed: {number_of_adventures}
ar: المغامرات المنهية: {number_of_adventures}
ca: Aventures completades: {number_of_adventures}
es: Aventuras completadas: {number_of_adventures}
kab: Tidyanin mmdent: {number_of_adventures}
nl: Avonturen afgerond: {number_of_adventures}
pl: Ukończone przygody: {number_of_adventures}
sr: Завршене авантуре: {number_of_adventures}
ta: சாகசங்கள் முடிந்தது: {number_of_adventures}
tr: Tamamlanan maceralar: `{number_of_adventures}`
uk: Здійснено пригод: {number_of_adventures}
zh_hans: 已完成的冒险：{number_of_adventures}
