Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# adventure_exp_3
source: Make sure you always surround keywords with { } when you write them outside of code blocks, then they are recognized correctly. You can use the "preview" button to view a styled version of your adventure. To view the adventure on a dedicated page, select "view" from the teachers page.
ar: تأكد من وضع الكلمات المفتاحية دائمًا بين قوسين معقوفين عند كتابتها خارج كتل التعليمات البرمجية، حتى يتم التعرف عليها بشكل صحيح. يمكنك استخدام زر "معاينة" لعرض نسخة مصممة من مغامرتك. لعرض المغامرة على صفحة مخصصة ، اختر "عرض" من صفحة المعلمين.
ko: 키워드를 항상 {}(으)로 둘러싸야 합니다. 그러면 키워드가 올바르게 인식됩니다. 미리보기 버튼을 사용하여 모험의 스타일화된 버전을 볼 수 있습니다. 모험을 전용 페이지에서 보려면 선생님 페이지에서 "보기"를 선택합니다.
pl: Upewnij się, że zawsze otaczasz słowa kluczowe za pomocą klamr , gdy piszesz je poza blokami kodu, a następnie są one poprawnie rozpoznawane. Możesz użyć przycisku 'preview' aby wyświetlić stylizowaną wersję swojej przygody. Aby wyświetlić przygodę na dedykowanej stronie, wybierz 'view' ze strony nauczycieli.

source: Expand output
ar: وسع المُخرجات
ta: வெளியீட்டை விரிவாக்கு

# save_turtle_drawing
source: Save drawing
ar: احفظ هذه الرسمة
ta: வரைபடத்தைச் சேமி

source: Show editor
ar: اعرض المحرر
ta: திருத்தியைக் காட்டு

# something_went_wrong_keyword_parsing
source: There is a mistake in your adventure, are all keywords correctly surrounded with { }?
ar: يوجد خطأ في مغامرتك، هل كل الكلمات المهمة مُحاطة بأقواس مجعدة؟
de: Es gibt einen Fehler in deinem Abenteuer, sind alle Schlüsselwörter korrekt mit { } umgeben?
fr: Votre aventure contient des erreurs, est-ce que tous les mots-clés sont entourés de { } ?
id: Ada kesalahan dalam petualangan Anda, apakah semua kata kunci diapit oleh { } dengan benar?
ko: 모험에 오류가 있습니다. 모든 키워드가 {}(으)로 올바르게 둘러싸여 있습니까?
pl: Wystąpił problem z Twoją przygodą. Czy wszystkie polecenia są oznaczone symbolami nawiasów klamrowych?
