Repository: hedyorg/hedy
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ar, bg, ca, cs, da, de, eo, es, fr, fy, hi, id, kab, ko, nl, pl, sr, sw, ta, tr, uk, vi, zh_hans

# class_name_invalid
source: This class name is invalid.
ar: اسم هذا الصف غير صالح.
ca: Aquest nom de la classe no és vàlid.
de: Dieser Klassenname ist ungültig.
eo: Jen nevalida nomo de klaso.
es: El nombre de clase no es correcto.
fr: Le nom de classe n'est pas valide.
id: Nama kelas ini tidak valid.
kab: Isem n usmil-a d arameɣtu.
ko: 수업 이름이 잘못되었습니다.
nl: Deze klasnaam is ongeldig.
pl: Ta nazwa klasy jest nieprawidłowa.
sr: Ово име одељења је неважеће.
ta: இந்த வகுப்பு பெயர் தவறானது.
tr: Bu sınıf ismi geçersiz.
uk: Це ім'я класу є неприпустимим.
zh_hans: 此班级名称无效。

# class_name_prompt
source: Please enter the name of the new class
ar: أدخل اسم الصف رجاء
ca: Si us plau, introdueix el nom de la nova classe
de: Bitte gib den Namen der Klasse ein
eo: Bonvolu tajpi la nomon de la klaso
es: Por favor, introduce le nombre de la nueva clase
fr: Entrer le nom de la nouvelle classe
fy: Graach de namme fan de klas ynfiere
hi: कृपया कक्षा का नाम दर्ज करें
id: Silakan masukan nama dari kelas
kab: Ttxil-k sekcem isem n usmel amaynut
ko: 새 수업 이름을 입력하십시오
nl: Vul de naam in van de nieuwe klas
pl: Podaj proszę nazwę nowej klasy
sr: Унесите име новог разреда
ta: புதிய வகுப்பின் பெயரை உள்ளிடவும்
tr: Lütfen yeni sınıfın ismini girin
uk: Введіть назву нового класу
zh_hans: 请输入新班级的名称

source: Class performance graph
ca: Gràfic del rendiment de la classe
es: Gráfico del rendimiento de la clase
pl: Wykres wydajności klasy
sr: Графикон учинка класе
ta: வகுப்பு செயல்திறன் வரைபடம்
tr: Sınıf performans grafiği
uk: Графік роботи класу
zh_hans: 班级表现图

# class_survey_description
source: We would like to get a better overview of our Hedy users. By providing these answers, you would help improve Hedy. Thank you!
ar: نريد أن نعرف المزيد عن مستخدمي هيدي. بالإجابة عن هذه الأسئلة، ستساعد هيدي جدا. شكرا!
ca: Ens agradaria obtenir una millor visió general dels nostres usuaris d'Hedy. En proporcionar aquestes respostes, ajudaràs a millorar Hedy. Gràcies!
es: Nos gustaría obtener una mejor visión general de nuestros usarios de Hedy. Respondiendo estas preguntas nos ayudarías a mejorar. ¡Gracias!
nl: Wij willen graag een beter inzicht hebben van onze Hedy gebruikers. Door het beantwoorden van de volgende vragen, help je ons om Hedy nog beter te maken. Alvast dank!
pl: Chcielibyśmy uzyskać lepszy przegląd naszych użytkowników Hedy. Udzielając tych odpowiedzi, pomógłbyś ulepszyć Hedy. Dziękuję!
sr: Желимо да добијемо бољи преглед наших Hedy корисника. Пружањем ових одговора, помогли бисте унапређењу Hedy. Хвала вам!
ta: எங்கள் எடி பயனர்களின் சிறந்த கண்ணோட்டத்தைப் பெற விரும்புகிறோம். இந்த பதில்களை வழங்குவதன் மூலம், நீங்கள் எடியை மேம்படுத்த உதவுவீர்கள். நன்றி!
tr: Hedy kullanıcılarımız hakkında daha iyi bir genel bakış elde etmek istiyoruz. Bu yanıtları vererek Hedy'nin geliştirilmesine yardımcı olabilirsiniz. Teşekkür ederiz!
uk: Ми хочемо, щоб отримати кращий огляд наших користувачів. Надаючи ці відповіді, ви допоможете покращити Hedy. Дякуємо!
zh_hans: 我们希望更好地了解 海蒂 用户。 通过提供这些答案，将有助于改进 Hedy。 谢谢你！

# class_survey_later
source: Remind me tomorrow
ar: ذكِّرني غذا
ca: Recorda-m'ho demà
es: Recuérdame mañana
kab: Smekti-yi-d azekka
nl: Herinner mij morgen
pl: Przypomnij mi jutro
sr: Подсети ме сутра
ta: நாளை எனக்கு நினைவூட்டுங்கள்
tr: Yarın bana tekrar hatırlat
uk: Нагадати мені завтра
zh_hans: 明天提醒我

# class_survey_question1
source: What is the age range in your class?
ar: ما هو فارق الأعمار في صفك؟
ca: Quin és el rang d'edat de la teva classe?
es: ¿Cuál es el rango de edad en su clase?
nl: Wat is de leeftijdsgroep in jouw klas?
pl: Jaki jest przedział wiekowy w twojej klasie?
sr: Који је старосни распон у вашем одељењу?
ta: உங்கள் வகுப்பில் அகவை வரம்பு என்ன?
tr: Sınıfınızdaki yaş aralığı nedir?
uk: Що таке віковий діапазон у класі?
zh_hans: 你们班学生年龄范围是多少？

# class_survey_question2
source: What is the spoken language in your class?
ar: ما هي اللغة المنطوقة في صفك؟
ca: Quina llengua es parla a la teva classe?
es: ¿Cuál es el idioma que se habla en su clase?
nl: Wat is de voertaal in jouw klas?
pl: W jakim języku mówi się w twojej klasie?
sr: Који је говорни језик у вашем одељењу?
ta: உங்கள் வகுப்பில் பேசும் மொழி என்ன?
tr: Sınıfınızda konuşma dili nedir?
uk: Яка розмовна мова у вашому класі?
zh_hans: 你们班上说什么语言?

# class_survey_question3
source: What is the gender balance in your class?
ar: ما هي نسبة الذكور والإناث في صفك؟
ca: Quin és el balanç de gènere de la teva classe?
es: ¿Cuántos niños y niñas hay en tu clase?
nl: Wat is de verhouding in aantal tussen meisjes en jongens in jouw klas?
pl: Jaka jest równowaga płci w twojej klasie?
sr: Какав је родни баланс у вашем одељењу?
ta: உங்கள் வகுப்பில் பாலின இருப்பு என்ன?
tr: Sınıfınızdaki cinsiyet dengesi nasıl?
uk: Який гендерний баланс у вашому класі?
zh_hans: 你们班级性别平衡嘛？

# class_survey_question4
source: What distinguishes your students from others?
ar: ما الذي يُمَيِّز طلابك من غيرهم؟
ca: Què distingeix els teus alumnes dels altres?
es: ¿Qué distingue a sus alumnos de los demás?
nl: Wat onderscheidt jouw leerlingen van anderen?
pl: Co wyróżnia twoich uczniów spośród innych?
sr: Шта разликује ваше ученике од других?
ta: உங்கள் மாணவர்களை மற்றவர்களிடமிருந்து வேறுபடுத்துவது எது?
tr: Öğrencilerinizi diğerlerinden ayıran nelerdir?
uk: Що відрізняє ваших студентів від інших?
zh_hans: 你的学生与其他学生有何不同？

# classes_info
source: Create a class to follow the progress of each student in dashboard, and to customize the adventures your students see, and even adding your own! You can create as many classes as you like, and each class can have multiple teachers each one with different roles. You can also add as many students as you want, but mind that each student can only be in one class at a time. You can find more information about classes in the <a href="https://hedy.org/for-teachers/manual/preparations#for-teachers">teacher manual</a>.
ar: أنشئ فصلًا دراسيًا لمتابعة تقدم كل طالب في لوحة التحكم، ولتعديل المغامرات التي يشاهدها طلابك حسب رغبتك، بل وإضافة مغامراتك الخاصة! يمكنك إنشاء عدد غير محدود من الفصول، ويمكن أن يضم كل فصل عدة معلمين لكل منهم دور مختلف. كما يمكنك إضافة عدد غير محدود من الطلاب، ولكن تذكر أن الطالب لا يمكنه الانضمام إلا إلى فصل واحد في الوقت نفسه. يمكنك العثور على مزيد من المعلومات حول الفصول الدراسية في <a href="https://hedy.org/for-teachers/manual/preparations#for-teachers">Teacher manual</a>.
ca: Creeu una classe per seguir el progrés de cada estudiant al tauler de control i per personalitzar les aventures que veuen els vostres estudiants, i fins i tot afegir-ne les vostres! Podeu crear tantes classes com vulgueu i cada classe pot tenir diversos professors, cadascun amb diferents rols. També podeu afegir tants estudiants com vulgueu, però tingueu en compte que cada alumne només pot estar en una classe alhora. Pots trobar més informació sobre les classes al <a href="https://hedy.org/for-teachers/manual/preparations#for-teachers">manual del professor</a>.
es: En Hedy, puedes crear tantas clases como quieras. Cada clase también puede tener varios profesores, cada uno con un rol específico. También puedes personalizar tus clases ordenando las aventuras ¡o incluso agregando las tuyas! Puedes ver más información acerca de las clases en el <a href="https://hedy.org/for-teachers/manual/preparations#for-teachers">manual de profesores</a>.
nl: Maak een klas aan om de voortgang van elke leerling te kunnen volgen op het dashboard, en om aanpassingen te maken aan avonturen die de leerlingen kunnen zien, maar ook het toevoegen van jouw eigen avonturen! Je kunt zoveel klassen aanmaken als je wilt, en elke klas kan meerdere leraren hebben met ieder een verschillende rol. Je kunt zoveel leerlingen toevoegen als je wilt, maar leerlingen kunnen alleen maar in 1 klas tegelijk zitten. Je kan meer informatie over klassen vinden in de <a href="https://hedy.org/for-teachers/manual/preparations#for-teachers">docentenhandleiding</a>.
pl: Utwórz klasę, aby śledzić postępy każdego ucznia w pulpicie nawigacyjnym (dashboard) i dostosowywać przygody, które widzą Twoi uczniowie, a nawet dodawać własne! Możesz utworzyć dowolną liczbę klas, a każda klasa może mieć wielu nauczycieli, z których każda ma różne role. Możesz także dodać tyle uczniów, ile chcesz, ale pamiętaj, że każdy uczeń może być tylko w jednej klasie na raz. Więcej informacji o klasach można znaleźć w podręczniku <a href="https://hedy.org/for-teachers/manual/preparations#for-teachers">teacher manual (instrukcja dla nauczycieli) </a>.
sr: Креирајте одељење да бисте пратили напредак сваког ученика на контролној табли, и да бисте прилагодили авантуре које ваши ученици виде, па чак и додали своје! Можете креирати онолико одељења колико желите, и свако одељење може имати више наставника, сваки са различитим улогама. Такође можете додати онолико ученика колико желите, али имајте на уму да сваки ученик може бити само у једном одељењу у исто време. Више информација о одељењима можете пронаћи у <a href="https://hedy.org/for-teachers/manual/preparations#for-teachers">приручнику за наставнике</a>.
ta: டாச்போர்டில் ஒவ்வொரு மாணவரின் முன்னேற்றத்தையும் பின்பற்ற ஒரு வகுப்பை உருவாக்கவும், உங்கள் மாணவர்கள் பார்க்கும் சாகசங்களைத் தனிப்பயனாக்கவும், உங்கள் சொந்தத்தைச் சேர்ப்பதாகவும்! நீங்கள் விரும்பும் பல வகுப்புகளை நீங்கள் உருவாக்கலாம், மேலும் ஒவ்வொரு வகுப்பிலும் பல ஆசிரியர்கள் ஒவ்வொருவரும் வெவ்வேறு பாத்திரங்களைக் கொண்டிருக்கலாம். நீங்கள் விரும்பும் அளவுக்கு மாணவர்களையும் சேர்க்கலாம், ஆனால் ஒவ்வொரு மாணவரும் ஒரே நேரத்தில் ஒரு வகுப்பில் மட்டுமே இருக்க முடியும் என்பதை நினைவில் கொள்ளுங்கள். வகுப்புகள் பற்றிய கூடுதல் தகவல்களை <a href = "https://hedy.org/for-teachers/manual/preparations#for-teachers"> ஆசிரியர் கையேடு </a> இல் காணலாம்.
uk: Створіть клас, щоб слідкувати за прогресом кожного студента в панельній панелі, і налаштувати пригоди, які ви бачите, і навіть додати свій власний! Ви можете створити якомога більше класів, як вам подобається, і кожен клас може мати кілька вчителів кожен з різних ролей. Ви також можете додати стільки студентів, скільки ви хочете, але розум, що кожен студент може бути тільки в одному класі. Дізнатися більше про класи в <a href="https://hedy.org/for-teachers/manual/preparations#for-teachers">навчання </a>.
zh_hans: 创建一个班级，在仪表板中跟踪每个学生的进度，并自定义学生看到的冒险，甚至添加你自己的冒险！ 可以根据需要创建任意数量的班级，每个班级可以有多名教师，每个教师具有不同的角色。 还可以根据需要添加任意数量的学生，但请注意每个学生一次只能在一个班级中。 您可以在<a href="https://hedy.org/for-teachers/manual/preparations#for-teachers">教师手册</a>中找到有关课程的更多信息。

source: Clone
ar: انسخ
ca: Clona
es: Clonar
nl: Kloon
pl: Klon
sr: Клонирај
ta: நகலி
uk: Клон
zh_hans: 克隆

# cloned_times
source: Clones
ar: عدد النسخ
ca: Clons
nl: Klonen
pl: Klony
sr: Клонови
ta: குளோன்கள்
uk: Клони
zh_hans: 克隆

source: Close
ar: أغلق
ca: Tanca
de: Schließen
es: Cerrar
fr: Fermer
id: Menutup
kab: Mdel
ko: 닫기
pl: Zamknij
sr: Затвори
ta: மூடு
tr: Kapat
uk: Закрити
zh_hans: 关闭

# comma
source: a comma
ar: فاصلة
bg: запетая
ca: una coma
cs: čárka
de: ein Komma
eo: komo
es: una coma
fr: une virgule
fy: in komma
hi: एक अल्पविराम
id: koma
kab: tafrayt
nl: een komma
pl: przecinek
sr: зарез
sw: koma
ta: பத்தி
tr: bir virgül
uk: кома
zh_hans: 逗号

# command_not_available_yet_exception
source: Command not available yet
ar: هذا الأمر البرمجي غير متوفر بعد
ca: La comanda encara no està disponible
de: Befehl noch nicht verfügbar
es: Comando aún no disponible
id: Perintah belum tersedia
kab: Ulac taladna-a akka tura
ko: 명령을 아직 사용할 수 없습니다
nl: Commando nog niet beschikbaar
pl: Polecenie nie jest jeszcze dostępne
sr: Команда још није доступна
ta: கட்டளை இன்னும் கிடைக்கவில்லை
tr: Komut henüz kullanılabilir değil
uk: Команда ще не доступна
zh_hans: 命令尚不可用

# command_unavailable_exception
source: Command not correct anymore
ar: هذا الأمر البرمجي لم يعد صحيحا
ca: La comanda ja no és correcta
de: Befehl nicht mehr korrekt
es: El comando ya no es correcto
id: Perintah tidak benar lagi
kab: Taladna ur tṣeḥḥa ara akk
ko: 명령이 더 이상 올바르지 않습니다
nl: Commando niet meer beschikbaar
pl: Polecenie już nie jest poprawne
sr: Команда више није исправна
ta: கட்டளை இனி சரியாக இல்லை
tr: Komut artık geçerli değil
uk: Команда більше не правильна
zh_hans: 命令不再正确

source: Commands
ar: أوامر برمجية
ca: Comandes
de: Befehle
es: Comandos
fr: Commandes
id: Perintah
kab: Tiludna
ko: 명령어
nl: Commando's
pl: Polecenia
sr: Команде
ta: கட்டளைகள்
tr: Komutlar
uk: Команди
zh_hans: 命令

# congrats_message
source: Congratulations, {username}, you have reached the following results with Hedy!
ca: Felicitats, {username}, has completat Hedy!
de: Herzlichen Glückwunsch, {username}, Du hast Hedy abgeschlossen!
fr: Félicitations, {username}, tu as fini Hedy !
id: Selamat, {username}, Anda telah mencapai hasil berikut dengan Hedy!
ko: 축하합니다, {username}님, Hedy에서 다음 결과를 얻으셨습니다!
nl: Gefeliciteerd, {username}, je hebt tot nu toe de volgende resultaten behaald met Hedy!
pl: Gratulacje, {username}, ukończyłeś Hedy!
sr: Честитамо, {username}, постигли сте следеће резултате са Hedy!
tr: Tebrikler {username}, Hedy ile aşağıdaki sonuçlara ulaştınız!
uk: Вітаємо, {username}, ви успішно прошли курс Hedy!
zh_hans: 恭喜你，{username}，你已经完成了Hedy!

# connect_guest_teacher
source: I would like to be connected with a guest teacher who can give a few lessons
ar: أريد أن أُربطَ بمعلم خارجي يستطيع أن يؤدي دروسا قليلة
ca: M'agradaria estar connectat amb un professor convidat que pogués donar algunes lliçons
es: Me gustaría que me pusieran en contacto con un profesor invitado que pueda dar algunas clases
kab: Bɣiɣ ad qqneɣ d uselmad inebgi i izemren ad iyi-mudd kra n temsirin
pl: Chciałbym być połączony z nauczycielem-gościem, który może udzielić kilku lekcji
sr: Желим да будем повезан са гостујућим наставником који може одржати неколико часова
ta: சில பாடங்களைக் கொடுக்கக்கூடிய விருந்தினர் ஆசிரியருடன் நான் இணைக்க விரும்புகிறேன்
uk: Я хотів би зв’язатися з запрошеним учителем, який може провести кілька уроків
zh_hans: 我想与一位可以教授一些课程的客座老师联系

# constant_variable_role
source: constant
ar: ثابت
es: constante
kab: yezga
pl: ciągła
sr: константа
ta: மாறா, மாறிலி
uk: постійний
zh_hans: 持续的

source: Containing
ar: يحتوي
ca: Contingent
nl: Bevat
sr: Садржи
ta: கொண்டிருக்கிறது
uk: Що містить

# content_invalid
source: This adventure is invalid.
ar: هذه المغامرة غير صالحة
ca: Aquesta aventura no és vàlida.
de: Dieses Abenteuer ist ungültig.
eo: Jen nevalida aventuro.
es: Esta aventura no es válida.
fr: Cette aventure n'est pas valide.
hi: यह adventure अमान्य है
id: Petualangan ini tidak valid.
kab: Tadyant-a d tarameɣtut.
ko: 이 모험은 부정확합니다.
nl: Dit avontuur is ongeldig.
pl: Ta przygoda jest nieprawidłowa.
sr: Ова авантура је неважећа.
ta: இந்த துணிவு தவறானது.
tr: Bu macera geçersiz.
uk: Ця пригода є недійсною.
zh_hans: 这个探险活动无效。

source: Continue
ar: أكمل
ca: Continua
es: Continuar
kab: Kemmel
sr: Настави
ta: தொடரவும்
uk: Продовжити
zh_hans: 继续

source: Contributor
ar: مشارك
ca: Contribuïdor
es: Contribuidor
fr: Contributeur
id: Penyumbang
kab: Imttekki
ko: 공헌자
nl: Hedy helper
pl: Współtwórca
sr: Сарадник
ta: பங்களிப்பாளர்
tr: Katılımcı
uk: Дописувач
zh_hans: 贡献者

# copy_accounts_to_clipboard
source: Copy to clipboard
ar: انسخ إلى لوحة النسخ
ca: Copia al porta-retalls
es: Copiar al portapapeles
kab: Nɣel ɣer tecfawt
sr: Копирајте у клипборд
ta: இடைநிலைப்பலகைக்கு நகலெடுக்கவும்
uk: Копіювати в буфер обміну
zh_hans: 复制到剪贴板

# copy_clipboard
source: Successfully copied to clipboard
ar: تم النسخ الى الحافظة (ذاكرة التخزين المؤقت) بنجاح
ca: Copiat amb èxit al porta-retalls
cs: Úspěšně skopírováno do schránky
de: Erfolgreich in die Zwischenablage kopiert
es: Copiado al portapapeles
fr: Copié avec succès dans le presse-papiers
fy: Nei it klemboerd kopiëerd
hi: क्लिपबोर्ड पर सफलतापूर्वक कॉपी किया गया
id: Berhasil disalin ke clipboard
kab: Yetwanɣel ɣer tecfawt akken iwata
ko: 클립보드에 성공적으로 복사되었습니다
nl: De link is gekopieerd
pl: Pomyślnie skopiowano do schowka
sr: Успешно копирано у клипборд
ta: இடைநிலைப்பலகைக்கு வெற்றிகரமாக நகலெடுக்கப்பட்டது
tr: Panoya başarıyla kopyalandı
uk: Успішно скопійовано до буфера обміну
zh_hans: 已成功复制到剪贴板

source: Copy code
ar: انسخ البرنامج
ca: Copia el codi
es: Copiar el código
kab: Nɣel tangalt
nl: Kopieer de code
pl: Skopiuj kod
sr: Копирај код
ta: குறியீட்டை நகலெடுக்கவும்
uk: Скопіюйте код
zh_hans: 复制代码

source: Copy join link
ca: Copia l'enllaç d'unió
de: Einladungslink kopieren
fr: Copie le lien d'accès
id: Salin tautan bergabung
ko: 참여 링크 복사
nl: Kopieer inschrijflink
pl: Skopiuj link do dołączenia
sr: Копирај линк за придруживање
tr: Katılma bağlantısını kopyala
uk: Скопіювати посилання для вступу
zh_hans: 复制链接

# copy_link_success
source: Join link successfully copied to clipboard
ca: Enllaç d'unió copiat amb èxit al porta-retalls
de: Beitrittslink wurde kopiert
fr: Lien pour joindre copié au presse-papier
id: Tautan bergabung berhasil disalin ke papan klip
ko: 참여 링크가 클립보드에 복사되었습니다
nl: Inschrijflink succesvol gekopieerd naar klembord
pl: Link udostępniania skopiowany do schowka
sr: Линк за придруживање је успешно копиран у клипборд
tr: Katılma bağlantısı panoya başarıyla kopyalandı
uk: Посилання на приєднання успішно скопійовано в буфер обміну
zh_hans: 成功把邀请链接复制到剪贴板

source: Copy link to share
ar: انسخ الرابط لمشاركته
ca: Copia l'enllaç per compartir
cs: Zkopírovat odkaz ke sdílení
de: Kopiere Link zum Weitergeben
es: Copiar enlace para compartir
fr: Copier le lien à partager
fy: Diellink kopiëare
hi: शेयर करने के लिए लिंक कॉपी करें
id: Salin tautan untuk berbagi
kab: Nɣel aseɣwen ara tebḍuḍ
ko: 공유할 링크 복사
nl: Kopieer link voor delen
pl: Skopiuj udostępniający link
sr: Копирај везу за дељење
ta: பகிர்வை நகலெடுக்கவும்
tr: Paylaşmak için bağlantıyı kopyalayın
uk: Скопіюйте посилання, щоб поділитися
zh_hans: 复制链接以分享

# copy_mail_link
source: Please copy and paste this link into a new tab:
ar: الرجاء نسخ هذا الرابط ولصقه في تبويبة جديدة:
ca: Si us plau, còpia i enganxa aquest enllaç a una nova pestanya:
de: Bitte kopiere diesen Link in ein neues Tab:
es: Por favor, copia y pega este enlace en una nueva pestaña:
fr: Entrez ce lien dans un nouvel onglet :
id: Silakan salin dan tempel tautan ini ke tab baru:
kab: Ttxil-k nɣel neɣ senteḍ aseɣwen deg yiccer amaynut:
ko: 이 링크를 복사하여 새 탭에 붙여넣으십시오:
nl: Kopieer en plak deze link in een andere tab:
pl: Proszę skopiować i wkleić ten link do nowej zakładki przeglądarki:
sr: Молимо вас да копирате и налепите ову везу у нови таб:
ta: தயவுசெய்து இந்த இணைப்பை புதிய தாவலில் நகலெடுத்து ஒட்டவும்:
tr: Lütfen bu bağlantıyı kopyalayıp yeni bir sekmeye yapıştırın:
uk: Будь ласка, скопіюйте та вставте це посилання в нову вкладку:
zh_hans: 请复制并粘贴此链接到一个新的标签页：

# correct_answer
source: The correct answer is
ca: La resposta correcta és
de: Die richtige Antwort ist
fr: La réponse correct est
id: Jawaban yang benar adalah
ko: 정답은
nl: Het juiste antwoord is
pl: Poprawna odpowiedź to
sr: Тачан одговор је
tr: Doğru cevap şudur
uk: Правильна відповідь
zh_hans: 正确答案是

source: Country
ar: البلد
bg: Държава
ca: País
cs: Země
de: Land
eo: Lando
es: País
fr: Pays
fy: Lân wêrst wennest
hi: देश
id: Negara
kab: Tamurt
ko: 국가
nl: Land waarin je woont
pl: Kraj
sr: Земља
sw: Nchi
ta: நாடு
tr: Ülke
uk: Країна
zh_hans: 国家

# country_invalid
source: Please select a valid country.
ar: الرجاء اختيار بلد صحيح.
ca: Seleccioneu un país vàlid.
de: Bitte wähle ein gültiges Land.
eo: Bonvolu elekti validan landon.
es: Por favor, selecciona un país válido.
fr: Sélectionnez un pays valide.
id: Silakan pilih negara yang valid.
kab: Ttxil-k fren tamurt iseḥḥan.
ko: 올바른 국가를 선택하십시오.
nl: Dit is geen geldig land, kies er een vanuit de lijst.
pl: Proszę wybrać poprawny kraj.
sr: Молимо вас да изаберете важећу земљу.
ta: சரியான நாட்டைத் தேர்ந்தெடுக்கவும்.
tr: Lütfen geçerli bir ülke seçin.
uk: Будь ласка, виберіть дійсну країну.
zh_hans: 请选择有效的国家。

source: Create account
ar: انشاء حساب
bg: Направи си акаунт
ca: Crear compte
cs: Vytvořit účet
de: Neues Konto anlegen
eo: Krei konton
es: Crear cuenta
fr: Créer un compte
fy: Meitsje in akkount
hi: खाता बनाएं
id: Membuat akun
kab: Snulfu-d amiḍan
ko: 계정 생성하기
nl: Maak een account
pl: Utwórz konto
sr: Направите налог
sw: Fungua Akaunti
ta: கணக்கை உருவாக்கவும்
tr: Hesap oluştur
uk: Створити обліковий запис
zh_hans: 创建账户

source: Create accounts
ar: انشاء عدة حسابات
ca: Crear comptes
de: Mehrere Konten erstellen
eo: Krei kontojn
es: Crear cuentas
fr: Créer des comptes
id: Buat akun
kab: Asnulfu n imiḍan
ko: 여러 계정 생성하기
nl: Accounts aanmaken
pl: Utwórz wiele kont
sr: Креирај налоге
ta: கணக்குகளை உருவாக்கவும்
tr: Çoklu hesaplar oluştur
uk: Створити акаунт
zh_hans: 创建多个账户

# create_accounts_placeholder
source: Type the accounts or paste them from a spreadsheet
ar: أدخل الحسابات أو ألصقها من جدول بيانات
ca: Escriviu els comptes o enganxeu-los des d'un full de càlcul
es: Escribe las cuentas o pégalas desde una hoja de cálculo
kab: Aru imiḍanen neɣ nɣel-iten-id seg tfelwit taẓarunayt
sr: Унесите налоге или налепите их из табеле
ta: கணக்குகளைத் தட்டச்சு செய்க அல்லது ஒரு விரிதாளில் இருந்து ஒட்டவும்
uk: Введіть облікові записи або вставте їх із електронної таблиці
zh_hans: 键入帐户或从电子表格中粘贴

# create_accounts_prompt
source: You will create {number_of_accounts} student accounts. Are you sure?
ar: ستنشأ حسابات للطلاب بعدد {number_of_accounts}، هل أنت متأكد؟
ca: Crearàs {number_of_accounts} comptes d'estudiant. Estàs segur?
de: Bist Du sicher, dass Du diese Konten erstellen willst?
es: Crearás {number_of_accounts} cuentas de alumno. ¿Estás seguro?
fr: Es-tu sur de vouloir créer ces comptes ?
id: Apakah Anda yakin ingin membuat akun-akun ini?
kab: Ad ternuḍ imiḍanen n yinelmaden {number_of_accounts}. D tidet tebɣiḍ?
ko: 이 계정들을 생성하시겠습니까?
nl: Je gaat {number_of_accounts} studentenaccounts aanmaken. Weet je het zeker?
sr: Креираћете {number_of_accounts} ученичких налога. Да ли сте сигурни?
ta: நீங்கள் {number_of_accounts} மாணவர் கணக்குகளை உருவாக்குவீர்கள். நீங்கள் உறுதியாக இருக்கிறீர்களா?
uk: Ви створите стільки облікових записів студентів: {number_of_accounts}. Ви впевнені?
zh_hans: 将创建 {number_of_accounts} 个学生帐户。确定吗？

source: Create adventure
ar: انشاء مغامرة
ca: Crear aventura
de: Abenteuer erstellen
eo: Krei aventuron
es: Crear aventura
fr: Créer l'aventure
hi: adventure बनाएं
id: Ciptakan petualangan
kab: Rnu tadyant
ko: 모험 만들기
nl: Maak nieuw avontuur
pl: Utwórz przygodę
sr: Направи авантуру
ta: சாகசத்தை உருவாக்கவும்
tr: Macera oluşturun
uk: Створіть пригоду
zh_hans: 创建探险

# create_class
source: Create a new class
ar: انشاء صف جديد
ca: Crea una nova classe
de: Erstelle eine neue Klasse
eo: Krei novan klason
es: Crear nueva clase
fr: Créer une nouvelle classe
fy: Nij klas meitsje
hi: नई कक्षा बनाएं
id: Buat kelas baru
kab: Rnu asmil amaynut
ko: 새 수업 만들기
nl: Maak een klas aan
pl: Utwórz nową klasę
sr: Направи ново одељење
ta: புதிய வகுப்பை உருவாக்கவும்
tr: Yeni bir sınıf oluşturun
uk: Створіть новий клас
zh_hans: 创建一个新的教室

# create_student_account
source: Create an account
ar: أنشأ حساب
ca: Crear un compte
de: Erstelle ein Konto
es: Crear una cuenta
fr: Créer un compte
id: Buat sebuah akun
kab: Snulfu-d amiḍan
ko: 계정 만들기
nl: Maak een account
pl: Utwórz konto
sr: Направите налог
ta: ஒரு கணக்கை உருவாக்கவும்
tr: Bir hesap oluşturun
uk: Створіть обліковий запис
zh_hans: 创建一个账户
